// automatically generated by rust-bindgen 0.69.2

pub const BSD: u32 = 199506;
pub const BSD4_3: u32 = 1;
pub const BSD4_4: u32 = 1;
pub const __FreeBSD_version: u32 = 1400097;
pub const __GNUCLIKE_ASM: u32 = 3;
pub const __GNUCLIKE___TYPEOF: u32 = 1;
pub const __GNUCLIKE___SECTION: u32 = 1;
pub const __GNUCLIKE_CTOR_SECTION_HANDLING: u32 = 1;
pub const __GNUCLIKE_BUILTIN_CONSTANT_P: u32 = 1;
pub const __GNUCLIKE_BUILTIN_VARARGS: u32 = 1;
pub const __GNUCLIKE_BUILTIN_STDARG: u32 = 1;
pub const __GNUCLIKE_BUILTIN_VAALIST: u32 = 1;
pub const __GNUC_VA_LIST_COMPATIBILITY: u32 = 1;
pub const __GNUCLIKE_BUILTIN_NEXT_ARG: u32 = 1;
pub const __GNUCLIKE_BUILTIN_MEMCPY: u32 = 1;
pub const __CC_SUPPORTS_INLINE: u32 = 1;
pub const __CC_SUPPORTS___INLINE: u32 = 1;
pub const __CC_SUPPORTS___INLINE__: u32 = 1;
pub const __CC_SUPPORTS___FUNC__: u32 = 1;
pub const __CC_SUPPORTS_WARNING: u32 = 1;
pub const __CC_SUPPORTS_VARADIC_XXX: u32 = 1;
pub const __CC_SUPPORTS_DYNAMIC_ARRAY_INIT: u32 = 1;
pub const __POSIX_VISIBLE: u32 = 200809;
pub const __XSI_VISIBLE: u32 = 700;
pub const __BSD_VISIBLE: u32 = 1;
pub const __ISO_C_VISIBLE: u32 = 2011;
pub const __EXT1_VISIBLE: u32 = 1;
pub const __CHAR_BIT: u32 = 8;
pub const __SCHAR_MAX: u32 = 127;
pub const __SCHAR_MIN: i32 = -128;
pub const __UCHAR_MAX: u32 = 255;
pub const __USHRT_MAX: u32 = 65535;
pub const __SHRT_MAX: u32 = 32767;
pub const __SHRT_MIN: i32 = -32768;
pub const __UINT_MAX: u32 = 4294967295;
pub const __INT_MAX: u32 = 2147483647;

pub type __uint_least32_t = __uint32_t;
pub type __uint_least64_t = __uint64_t;
pub type __uintmax_t = __uint64_t;
pub type __intptr_t = __int64_t;
pub type __intfptr_t = __int64_t;
pub type __uintptr_t = __uint64_t;
pub type __uintfptr_t = __uint64_t;
pub type __vm_offset_t = __uint64_t;
pub type __vm_size_t = __uint64_t;
pub type __size_t = __uint64_t;
pub type __ssize_t = __int64_t;
pub type __ptrdiff_t = __int64_t;
pub type __clock_t = __int32_t;
pub type __critical_t = __int64_t;
pub type __double_t = f64;
pub type __float_t = f32;
pub type __int_fast8_t = __int32_t;
pub type __int_fast16_t = __int32_t;
pub type __int_fast32_t = __int32_t;
pub type __int_fast64_t = __int64_t;
pub type __register_t = __int64_t;
pub type __segsz_t = __int64_t;
pub type __time_t = __int64_t;
pub type __uint_fast8_t = __uint32_t;
pub type __uint_fast16_t = __uint32_t;
pub type __uint_fast32_t = __uint32_t;
pub type __uint_fast64_t = __uint64_t;
pub type __u_register_t = __uint64_t;
pub type __vm_paddr_t = __uint64_t;
pub type ___wchar_t = ::std::os::raw::c_int;
pub type __blksize_t = __int32_t;
pub type __blkcnt_t = __int64_t;
pub type __clockid_t = __int32_t;
pub type __fflags_t = __uint32_t;
pub type __fsblkcnt_t = __uint64_t;
pub type __fsfilcnt_t = __uint64_t;
pub type __gid_t = __uint32_t;
pub type __id_t = __int64_t;
pub type __ino_t = __uint64_t;
pub type __key_t = ::std::os::raw::c_long;
pub type __lwpid_t = __int32_t;
pub type __mode_t = __uint16_t;
pub type __accmode_t = ::std::os::raw::c_int;
pub type __nl_item = ::std::os::raw::c_int;
pub type __nlink_t = __uint64_t;
pub type __off_t = __int64_t;
pub type __off64_t = __int64_t;
pub type __pid_t = __int32_t;
pub type __sbintime_t = __int64_t;
pub type __rlim_t = __int64_t;
pub type __sa_family_t = __uint8_t;
pub type __socklen_t = __uint32_t;
pub type __suseconds_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __timer {
    _unused: [u8; 0],
}
pub type __timer_t = *mut __timer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __mq {
    _unused: [u8; 0],
}
pub type __mqd_t = *mut __mq;
pub type __uid_t = __uint32_t;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __cpuwhich_t = ::std::os::raw::c_int;
pub type __cpulevel_t = ::std::os::raw::c_int;
pub type __cpusetid_t = ::std::os::raw::c_int;
pub type __daddr_t = __int64_t;
pub type __ct_rune_t = ::std::os::raw::c_int;
pub type __rune_t = __ct_rune_t;
pub type __wint_t = __ct_rune_t;
pub type __char16_t = __uint_least16_t;
pub type __char32_t = __uint_least32_t;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct __max_align_t {
    pub __max_align1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __max_align2: u128,
}
#[test]
fn bindgen_test_layout___max_align_t() {
    const UNINIT: ::std::mem::MaybeUninit<__max_align_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(__max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(__max_align_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__max_align1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__max_align_t),
            "::",
            stringify!(__max_align1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__max_align2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__max_align_t),
            "::",
            stringify!(__max_align2)
        )
    );
}
pub type __dev_t = __uint64_t;
pub type __fixpt_t = __uint32_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
    pub __mbstate8: [::std::os::raw::c_char; 128usize],
    pub _mbstateL: __int64_t,
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        128usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__mbstate8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__mbstate8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mbstateL) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(_mbstateL)
        )
    );
}
pub type __rman_res_t = __uintmax_t;
pub type __va_list = __builtin_va_list;
pub type __gnuc_va_list = __va_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_attr {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_cond {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_cond_attr {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_mutex {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_mutex_attr {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_rwlock {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_rwlockattr {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_barrier {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_barrier_attr {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_spinlock {
    _unused: [u8; 0],
}
pub type pthread_t = *mut pthread;
pub type pthread_attr_t = *mut pthread_attr;
pub type pthread_mutex_t = *mut pthread_mutex;
pub type pthread_mutexattr_t = *mut pthread_mutex_attr;
pub type pthread_cond_t = *mut pthread_cond;
pub type pthread_condattr_t = *mut pthread_cond_attr;
pub type pthread_key_t = ::std::os::raw::c_int;
pub type pthread_once_t = pthread_once;
pub type pthread_rwlock_t = *mut pthread_rwlock;
pub type pthread_rwlockattr_t = *mut pthread_rwlockattr;
pub type pthread_barrier_t = *mut pthread_barrier;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_barrierattr {
    _unused: [u8; 0],
}
pub type pthread_barrierattr_t = *mut pthread_barrierattr;
pub type pthread_spinlock_t = *mut pthread_spinlock;
pub type pthread_addr_t = *mut ::std::os::raw::c_void;
pub type pthread_startroutine_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_once {
    pub state: ::std::os::raw::c_int,
    pub mutex: pthread_mutex_t,
}
#[test]
fn bindgen_test_layout_pthread_once() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_once> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_once>(),
        16usize,
        concat!("Size of: ", stringify!(pthread_once))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_once>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_once))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(pthread_once), "::", stringify!(state))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mutex) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(pthread_once), "::", stringify!(mutex))
    );
}
pub type u_char = ::std::os::raw::c_uchar;
pub type u_short = ::std::os::raw::c_ushort;
pub type u_int = ::std::os::raw::c_uint;
pub type u_long = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type u_quad_t = __uint64_t;
pub type quad_t = __int64_t;
pub type qaddr_t = *mut quad_t;
pub type caddr_t = *mut ::std::os::raw::c_char;
pub type c_caddr_t = *const ::std::os::raw::c_char;
pub type blksize_t = __blksize_t;
pub type cpuwhich_t = __cpuwhich_t;
pub type cpulevel_t = __cpulevel_t;
pub type cpusetid_t = __cpusetid_t;
pub type blkcnt_t = __blkcnt_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type critical_t = __critical_t;
pub type daddr_t = __daddr_t;
pub type dev_t = __dev_t;
pub type fflags_t = __fflags_t;
pub type fixpt_t = __fixpt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub type gid_t = __gid_t;
pub type in_addr_t = __uint32_t;
pub type in_port_t = __uint16_t;
pub type id_t = __id_t;
pub type ino_t = __ino_t;
pub type key_t = __key_t;
pub type lwpid_t = __lwpid_t;
pub type mode_t = __mode_t;
pub type accmode_t = __accmode_t;
pub type nlink_t = __nlink_t;
pub type off_t = __off_t;
pub type off64_t = __off64_t;
pub type pid_t = __pid_t;
pub type register_t = __register_t;
pub type rlim_t = __rlim_t;
pub type sbintime_t = __sbintime_t;
pub type segsz_t = __segsz_t;
pub type suseconds_t = __suseconds_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type mqd_t = __mqd_t;
pub type u_register_t = __u_register_t;
pub type uid_t = __uid_t;
pub type useconds_t = __useconds_t;
pub type cap_ioctl_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cap_rights {
    _unused: [u8; 0],
}
pub type cap_rights_t = cap_rights;
pub type kpaddr_t = __uint64_t;
pub type kvaddr_t = __uint64_t;
pub type ksize_t = __uint64_t;
pub type kssize_t = __int64_t;
pub type vm_offset_t = __vm_offset_t;
pub type vm_ooffset_t = __uint64_t;
pub type vm_paddr_t = __vm_paddr_t;
pub type vm_pindex_t = __uint64_t;
pub type vm_size_t = __vm_size_t;
pub type rman_res_t = __rman_res_t;
pub type syscallarg_t = __register_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset {
    pub __bits: [__uint32_t; 4usize],
}
#[test]
fn bindgen_test_layout___sigset() {
    const UNINIT: ::std::mem::MaybeUninit<__sigset> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__sigset>(),
        16usize,
        concat!("Size of: ", stringify!(__sigset))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset>(),
        4usize,
        concat!("Alignment of ", stringify!(__sigset))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__bits) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(__sigset), "::", stringify!(__bits))
    );
}
pub type __sigset_t = __sigset;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: time_t,
    pub tv_usec: suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    const UNINIT: ::std::mem::MaybeUninit<timeval> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(timeval), "::", stringify!(tv_sec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_usec) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(timeval), "::", stringify!(tv_usec))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: time_t,
    pub tv_nsec: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_timespec() {
    const UNINIT: ::std::mem::MaybeUninit<timespec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(timespec), "::", stringify!(tv_sec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(timespec), "::", stringify!(tv_nsec))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[test]
fn bindgen_test_layout_itimerspec() {
    const UNINIT: ::std::mem::MaybeUninit<itimerspec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<itimerspec>(),
        32usize,
        concat!("Size of: ", stringify!(itimerspec))
    );
    assert_eq!(
        ::std::mem::align_of::<itimerspec>(),
        8usize,
        concat!("Alignment of ", stringify!(itimerspec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).it_interval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).it_value) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(itimerspec), "::", stringify!(it_value))
    );
}
pub type __fd_mask = ::std::os::raw::c_ulong;
pub type fd_mask = __fd_mask;
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    const UNINIT: ::std::mem::MaybeUninit<fd_set> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__fds_bits) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(fd_set), "::", stringify!(__fds_bits))
    );
}
extern "C" {
    pub fn pselect(
        arg1: ::std::os::raw::c_int,
        arg2: *mut fd_set,
        arg3: *mut fd_set,
        arg4: *mut fd_set,
        arg5: *const timespec,
        arg6: *const sigset_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn select(
        arg1: ::std::os::raw::c_int,
        arg2: *mut fd_set,
        arg3: *mut fd_set,
        arg4: *mut fd_set,
        arg5: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftruncate(arg1: ::std::os::raw::c_int, arg2: off_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lseek(arg1: ::std::os::raw::c_int, arg2: off_t, arg3: ::std::os::raw::c_int) -> off_t;
}
extern "C" {
    pub fn mmap(
        arg1: *mut ::std::os::raw::c_void,
        arg2: usize,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
        arg6: off_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn truncate(arg1: *const ::std::os::raw::c_char, arg2: off_t) -> ::std::os::raw::c_int;
}
pub type sig_atomic_t = ::std::os::raw::c_long;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct sigcontext {
    pub sc_mask: __sigset,
    pub sc_onstack: ::std::os::raw::c_long,
    pub sc_rdi: ::std::os::raw::c_long,
    pub sc_rsi: ::std::os::raw::c_long,
    pub sc_rdx: ::std::os::raw::c_long,
    pub sc_rcx: ::std::os::raw::c_long,
    pub sc_r8: ::std::os::raw::c_long,
    pub sc_r9: ::std::os::raw::c_long,
    pub sc_rax: ::std::os::raw::c_long,
    pub sc_rbx: ::std::os::raw::c_long,
    pub sc_rbp: ::std::os::raw::c_long,
    pub sc_r10: ::std::os::raw::c_long,
    pub sc_r11: ::std::os::raw::c_long,
    pub sc_r12: ::std::os::raw::c_long,
    pub sc_r13: ::std::os::raw::c_long,
    pub sc_r14: ::std::os::raw::c_long,
    pub sc_r15: ::std::os::raw::c_long,
    pub sc_trapno: ::std::os::raw::c_int,
    pub sc_fs: ::std::os::raw::c_short,
    pub sc_gs: ::std::os::raw::c_short,
    pub sc_addr: ::std::os::raw::c_long,
    pub sc_flags: ::std::os::raw::c_int,
    pub sc_es: ::std::os::raw::c_short,
    pub sc_ds: ::std::os::raw::c_short,
    pub sc_err: ::std::os::raw::c_long,
    pub sc_rip: ::std::os::raw::c_long,
    pub sc_cs: ::std::os::raw::c_long,
    pub sc_rflags: ::std::os::raw::c_long,
    pub sc_rsp: ::std::os::raw::c_long,
    pub sc_ss: ::std::os::raw::c_long,
    pub sc_len: ::std::os::raw::c_long,
    pub sc_fpformat: ::std::os::raw::c_long,
    pub sc_ownedfp: ::std::os::raw::c_long,
    pub sc_fpstate: [::std::os::raw::c_long; 64usize],
    pub sc_fsbase: ::std::os::raw::c_long,
    pub sc_gsbase: ::std::os::raw::c_long,
    pub sc_xfpustate: ::std::os::raw::c_long,
    pub sc_xfpustate_len: ::std::os::raw::c_long,
    pub sc_spare: [::std::os::raw::c_long; 4usize],
}
#[test]
fn bindgen_test_layout_sigcontext() {
    const UNINIT: ::std::mem::MaybeUninit<sigcontext> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sigcontext>(),
        816usize,
        concat!("Size of: ", stringify!(sigcontext))
    );
    assert_eq!(
        ::std::mem::align_of::<sigcontext>(),
        16usize,
        concat!("Alignment of ", stringify!(sigcontext))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_mask) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_mask))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_onstack) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sigcontext),
            "::",
            stringify!(sc_onstack)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_rdi) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_rdi))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_rsi) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_rsi))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_rdx) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_rdx))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_rcx) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_rcx))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_r8) as usize - ptr as usize },
        56usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_r8))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_r9) as usize - ptr as usize },
        64usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_r9))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_rax) as usize - ptr as usize },
        72usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_rax))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_rbx) as usize - ptr as usize },
        80usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_rbx))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_rbp) as usize - ptr as usize },
        88usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_rbp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_r10) as usize - ptr as usize },
        96usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_r10))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_r11) as usize - ptr as usize },
        104usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_r11))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_r12) as usize - ptr as usize },
        112usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_r12))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_r13) as usize - ptr as usize },
        120usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_r13))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_r14) as usize - ptr as usize },
        128usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_r14))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_r15) as usize - ptr as usize },
        136usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_r15))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_trapno) as usize - ptr as usize },
        144usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_trapno))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_fs) as usize - ptr as usize },
        148usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_fs))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_gs) as usize - ptr as usize },
        150usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_gs))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_addr) as usize - ptr as usize },
        152usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_flags) as usize - ptr as usize },
        160usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_flags))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_es) as usize - ptr as usize },
        164usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_es))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_ds) as usize - ptr as usize },
        166usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_ds))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_err) as usize - ptr as usize },
        168usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_err))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_rip) as usize - ptr as usize },
        176usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_rip))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_cs) as usize - ptr as usize },
        184usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_cs))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_rflags) as usize - ptr as usize },
        192usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_rflags))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_rsp) as usize - ptr as usize },
        200usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_rsp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_ss) as usize - ptr as usize },
        208usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_ss))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_len) as usize - ptr as usize },
        216usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_len))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_fpformat) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(sigcontext),
            "::",
            stringify!(sc_fpformat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_ownedfp) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(sigcontext),
            "::",
            stringify!(sc_ownedfp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_fpstate) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(sigcontext),
            "::",
            stringify!(sc_fpstate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_fsbase) as usize - ptr as usize },
        752usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_fsbase))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_gsbase) as usize - ptr as usize },
        760usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_gsbase))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_xfpustate) as usize - ptr as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(sigcontext),
            "::",
            stringify!(sc_xfpustate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_xfpustate_len) as usize - ptr as usize },
        776usize,
        concat!(
            "Offset of field: ",
            stringify!(sigcontext),
            "::",
            stringify!(sc_xfpustate_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_spare) as usize - ptr as usize },
        784usize,
        concat!("Offset of field: ", stringify!(sigcontext), "::", stringify!(sc_spare))
    );
}
pub type __sighandler_t = ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
#[repr(C)]
#[derive(Copy, Clone)]
pub union sigval {
    pub sival_int: ::std::os::raw::c_int,
    pub sival_ptr: *mut ::std::os::raw::c_void,
    pub sigval_int: ::std::os::raw::c_int,
    pub sigval_ptr: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_sigval() {
    const UNINIT: ::std::mem::MaybeUninit<sigval> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sigval>(),
        8usize,
        concat!("Size of: ", stringify!(sigval))
    );
    assert_eq!(
        ::std::mem::align_of::<sigval>(),
        8usize,
        concat!("Alignment of ", stringify!(sigval))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sival_int) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sigval), "::", stringify!(sival_int))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sival_ptr) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sigval), "::", stringify!(sival_ptr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sigval_int) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sigval), "::", stringify!(sigval_int))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sigval_ptr) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sigval), "::", stringify!(sigval_ptr))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sigevent {
    pub sigev_notify: ::std::os::raw::c_int,
    pub sigev_signo: ::std::os::raw::c_int,
    pub sigev_value: sigval,
    pub _sigev_un: sigevent__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union sigevent__bindgen_ty_1 {
    pub _threadid: __lwpid_t,
    pub _sigev_thread: sigevent__bindgen_ty_1__bindgen_ty_1,
    pub _kevent_flags: ::std::os::raw::c_ushort,
    pub __spare__: [::std::os::raw::c_long; 8usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigevent__bindgen_ty_1__bindgen_ty_1 {
    pub _function: ::std::option::Option<unsafe extern "C" fn(arg1: sigval)>,
    pub _attribute: *mut *mut pthread_attr,
}
#[test]
fn bindgen_test_layout_sigevent__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<sigevent__bindgen_ty_1__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sigevent__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(sigevent__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<sigevent__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(sigevent__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._function) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sigevent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_function)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._attribute) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sigevent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_attribute)
        )
    );
}
#[test]
fn bindgen_test_layout_sigevent__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<sigevent__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sigevent__bindgen_ty_1>(),
        64usize,
        concat!("Size of: ", stringify!(sigevent__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<sigevent__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(sigevent__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._threadid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sigevent__bindgen_ty_1),
            "::",
            stringify!(_threadid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._sigev_thread) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sigevent__bindgen_ty_1),
            "::",
            stringify!(_sigev_thread)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._kevent_flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sigevent__bindgen_ty_1),
            "::",
            stringify!(_kevent_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__spare__) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sigevent__bindgen_ty_1),
            "::",
            stringify!(__spare__)
        )
    );
}
#[test]
fn bindgen_test_layout_sigevent() {
    const UNINIT: ::std::mem::MaybeUninit<sigevent> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sigevent>(),
        80usize,
        concat!("Size of: ", stringify!(sigevent))
    );
    assert_eq!(
        ::std::mem::align_of::<sigevent>(),
        8usize,
        concat!("Alignment of ", stringify!(sigevent))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sigev_notify) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sigevent),
            "::",
            stringify!(sigev_notify)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sigev_signo) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(sigevent), "::", stringify!(sigev_signo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sigev_value) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(sigevent), "::", stringify!(sigev_value))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._sigev_un) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(sigevent), "::", stringify!(_sigev_un))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __siginfo {
    pub si_signo: ::std::os::raw::c_int,
    pub si_errno: ::std::os::raw::c_int,
    pub si_code: ::std::os::raw::c_int,
    pub si_pid: __pid_t,
    pub si_uid: __uid_t,
    pub si_status: ::std::os::raw::c_int,
    pub si_addr: *mut ::std::os::raw::c_void,
    pub si_value: sigval,
    pub _reason: __siginfo__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __siginfo__bindgen_ty_1 {
    pub _fault: __siginfo__bindgen_ty_1__bindgen_ty_1,
    pub _timer: __siginfo__bindgen_ty_1__bindgen_ty_2,
    pub _mesgq: __siginfo__bindgen_ty_1__bindgen_ty_3,
    pub _poll: __siginfo__bindgen_ty_1__bindgen_ty_4,
    pub _capsicum: __siginfo__bindgen_ty_1__bindgen_ty_5,
    pub __spare__: __siginfo__bindgen_ty_1__bindgen_ty_6,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __siginfo__bindgen_ty_1__bindgen_ty_1 {
    pub _trapno: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___siginfo__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<__siginfo__bindgen_ty_1__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__siginfo__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__siginfo__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__siginfo__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__siginfo__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._trapno) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__siginfo__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_trapno)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __siginfo__bindgen_ty_1__bindgen_ty_2 {
    pub _timerid: ::std::os::raw::c_int,
    pub _overrun: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___siginfo__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<__siginfo__bindgen_ty_1__bindgen_ty_2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__siginfo__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(__siginfo__bindgen_ty_1__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<__siginfo__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(__siginfo__bindgen_ty_1__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._timerid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__siginfo__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(_timerid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._overrun) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__siginfo__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(_overrun)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __siginfo__bindgen_ty_1__bindgen_ty_3 {
    pub _mqd: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___siginfo__bindgen_ty_1__bindgen_ty_3() {
    const UNINIT: ::std::mem::MaybeUninit<__siginfo__bindgen_ty_1__bindgen_ty_3> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__siginfo__bindgen_ty_1__bindgen_ty_3>(),
        4usize,
        concat!("Size of: ", stringify!(__siginfo__bindgen_ty_1__bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<__siginfo__bindgen_ty_1__bindgen_ty_3>(),
        4usize,
        concat!("Alignment of ", stringify!(__siginfo__bindgen_ty_1__bindgen_ty_3))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mqd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__siginfo__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(_mqd)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __siginfo__bindgen_ty_1__bindgen_ty_4 {
    pub _band: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout___siginfo__bindgen_ty_1__bindgen_ty_4() {
    const UNINIT: ::std::mem::MaybeUninit<__siginfo__bindgen_ty_1__bindgen_ty_4> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__siginfo__bindgen_ty_1__bindgen_ty_4>(),
        8usize,
        concat!("Size of: ", stringify!(__siginfo__bindgen_ty_1__bindgen_ty_4))
    );
    assert_eq!(
        ::std::mem::align_of::<__siginfo__bindgen_ty_1__bindgen_ty_4>(),
        8usize,
        concat!("Alignment of ", stringify!(__siginfo__bindgen_ty_1__bindgen_ty_4))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._band) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__siginfo__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(_band)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __siginfo__bindgen_ty_1__bindgen_ty_5 {
    pub _syscall: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___siginfo__bindgen_ty_1__bindgen_ty_5() {
    const UNINIT: ::std::mem::MaybeUninit<__siginfo__bindgen_ty_1__bindgen_ty_5> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__siginfo__bindgen_ty_1__bindgen_ty_5>(),
        4usize,
        concat!("Size of: ", stringify!(__siginfo__bindgen_ty_1__bindgen_ty_5))
    );
    assert_eq!(
        ::std::mem::align_of::<__siginfo__bindgen_ty_1__bindgen_ty_5>(),
        4usize,
        concat!("Alignment of ", stringify!(__siginfo__bindgen_ty_1__bindgen_ty_5))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._syscall) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__siginfo__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(_syscall)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __siginfo__bindgen_ty_1__bindgen_ty_6 {
    pub __spare1__: ::std::os::raw::c_long,
    pub __spare2__: [::std::os::raw::c_int; 7usize],
}
#[test]
fn bindgen_test_layout___siginfo__bindgen_ty_1__bindgen_ty_6() {
    const UNINIT: ::std::mem::MaybeUninit<__siginfo__bindgen_ty_1__bindgen_ty_6> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__siginfo__bindgen_ty_1__bindgen_ty_6>(),
        40usize,
        concat!("Size of: ", stringify!(__siginfo__bindgen_ty_1__bindgen_ty_6))
    );
    assert_eq!(
        ::std::mem::align_of::<__siginfo__bindgen_ty_1__bindgen_ty_6>(),
        8usize,
        concat!("Alignment of ", stringify!(__siginfo__bindgen_ty_1__bindgen_ty_6))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__spare1__) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__siginfo__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(__spare1__)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__spare2__) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__siginfo__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(__spare2__)
        )
    );
}
#[test]
fn bindgen_test_layout___siginfo__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<__siginfo__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__siginfo__bindgen_ty_1>(),
        40usize,
        concat!("Size of: ", stringify!(__siginfo__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__siginfo__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(__siginfo__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._fault) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__siginfo__bindgen_ty_1),
            "::",
            stringify!(_fault)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._timer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__siginfo__bindgen_ty_1),
            "::",
            stringify!(_timer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mesgq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__siginfo__bindgen_ty_1),
            "::",
            stringify!(_mesgq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._poll) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__siginfo__bindgen_ty_1),
            "::",
            stringify!(_poll)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._capsicum) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__siginfo__bindgen_ty_1),
            "::",
            stringify!(_capsicum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__spare__) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__siginfo__bindgen_ty_1),
            "::",
            stringify!(__spare__)
        )
    );
}
#[test]
fn bindgen_test_layout___siginfo() {
    const UNINIT: ::std::mem::MaybeUninit<__siginfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__siginfo>(),
        80usize,
        concat!("Size of: ", stringify!(__siginfo))
    );
    assert_eq!(
        ::std::mem::align_of::<__siginfo>(),
        8usize,
        concat!("Alignment of ", stringify!(__siginfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_signo) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(__siginfo), "::", stringify!(si_signo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_errno) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(__siginfo), "::", stringify!(si_errno))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_code) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(__siginfo), "::", stringify!(si_code))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_pid) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(__siginfo), "::", stringify!(si_pid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_uid) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(__siginfo), "::", stringify!(si_uid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_status) as usize - ptr as usize },
        20usize,
        concat!("Offset of field: ", stringify!(__siginfo), "::", stringify!(si_status))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_addr) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(__siginfo), "::", stringify!(si_addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_value) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(__siginfo), "::", stringify!(si_value))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._reason) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(__siginfo), "::", stringify!(_reason))
    );
}
pub type siginfo_t = __siginfo;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sigaction {
    pub __sigaction_u: sigaction__bindgen_ty_1,
    pub sa_flags: ::std::os::raw::c_int,
    pub sa_mask: sigset_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union sigaction__bindgen_ty_1 {
    pub __sa_handler: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
    pub __sa_sigaction: ::std::option::Option<
        unsafe extern "C" fn(arg1: ::std::os::raw::c_int, arg2: *mut __siginfo, arg3: *mut ::std::os::raw::c_void),
    >,
}
#[test]
fn bindgen_test_layout_sigaction__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<sigaction__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sigaction__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(sigaction__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<sigaction__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(sigaction__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sa_handler) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sigaction__bindgen_ty_1),
            "::",
            stringify!(__sa_handler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sa_sigaction) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sigaction__bindgen_ty_1),
            "::",
            stringify!(__sa_sigaction)
        )
    );
}
#[test]
fn bindgen_test_layout_sigaction() {
    const UNINIT: ::std::mem::MaybeUninit<sigaction> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sigaction>(),
        32usize,
        concat!("Size of: ", stringify!(sigaction))
    );
    assert_eq!(
        ::std::mem::align_of::<sigaction>(),
        8usize,
        concat!("Alignment of ", stringify!(sigaction))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sigaction_u) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sigaction),
            "::",
            stringify!(__sigaction_u)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_flags) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(sigaction), "::", stringify!(sa_flags))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_mask) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(sigaction), "::", stringify!(sa_mask))
    );
}
pub type sig_t = __sighandler_t;
pub type __siginfohandler_t = ::std::option::Option<
    unsafe extern "C" fn(arg1: ::std::os::raw::c_int, arg2: *mut __siginfo, arg3: *mut ::std::os::raw::c_void),
>;
pub type stack_t = sigaltstack;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigaltstack {
    pub ss_sp: *mut ::std::os::raw::c_void,
    pub ss_size: __size_t,
    pub ss_flags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_sigaltstack() {
    const UNINIT: ::std::mem::MaybeUninit<sigaltstack> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sigaltstack>(),
        24usize,
        concat!("Size of: ", stringify!(sigaltstack))
    );
    assert_eq!(
        ::std::mem::align_of::<sigaltstack>(),
        8usize,
        concat!("Alignment of ", stringify!(sigaltstack))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ss_sp) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sigaltstack), "::", stringify!(ss_sp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ss_size) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(sigaltstack), "::", stringify!(ss_size))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ss_flags) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(sigaltstack), "::", stringify!(ss_flags))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigvec {
    pub sv_handler: __sighandler_t,
    pub sv_mask: ::std::os::raw::c_int,
    pub sv_flags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_sigvec() {
    const UNINIT: ::std::mem::MaybeUninit<sigvec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sigvec>(),
        16usize,
        concat!("Size of: ", stringify!(sigvec))
    );
    assert_eq!(
        ::std::mem::align_of::<sigvec>(),
        8usize,
        concat!("Alignment of ", stringify!(sigvec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_handler) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sigvec), "::", stringify!(sv_handler))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_mask) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(sigvec), "::", stringify!(sv_mask))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_flags) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(sigvec), "::", stringify!(sv_flags))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigstack {
    pub ss_sp: *mut ::std::os::raw::c_void,
    pub ss_onstack: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_sigstack() {
    const UNINIT: ::std::mem::MaybeUninit<sigstack> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sigstack>(),
        16usize,
        concat!("Size of: ", stringify!(sigstack))
    );
    assert_eq!(
        ::std::mem::align_of::<sigstack>(),
        8usize,
        concat!("Alignment of ", stringify!(sigstack))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ss_sp) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sigstack), "::", stringify!(ss_sp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ss_onstack) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(sigstack), "::", stringify!(ss_onstack))
    );
}
extern "C" {
    pub fn signal(arg1: ::std::os::raw::c_int, arg2: __sighandler_t) -> __sighandler_t;
}
pub type counter_u64_t = *mut u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpuset {
    pub __bits: [::std::os::raw::c_long; 16usize],
}
#[test]
fn bindgen_test_layout__cpuset() {
    const UNINIT: ::std::mem::MaybeUninit<_cpuset> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cpuset>(),
        128usize,
        concat!("Size of: ", stringify!(_cpuset))
    );
    assert_eq!(
        ::std::mem::align_of::<_cpuset>(),
        8usize,
        concat!("Alignment of ", stringify!(_cpuset))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__bits) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_cpuset), "::", stringify!(__bits))
    );
}
pub type cpuset_t = _cpuset;
extern "C" {
    pub fn __cpuset_alloc(set_size: usize) -> *mut cpuset_t;
}
extern "C" {
    pub fn __cpuset_free(ptr: *mut cpuset_t);
}
extern "C" {
    pub fn cpuset(arg1: *mut cpusetid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cpuset_setid(arg1: cpuwhich_t, arg2: id_t, arg3: cpusetid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cpuset_getid(arg1: cpulevel_t, arg2: cpuwhich_t, arg3: id_t, arg4: *mut cpusetid_t)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cpuset_getaffinity(
        arg1: cpulevel_t,
        arg2: cpuwhich_t,
        arg3: id_t,
        arg4: usize,
        arg5: *mut cpuset_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cpuset_setaffinity(
        arg1: cpulevel_t,
        arg2: cpuwhich_t,
        arg3: id_t,
        arg4: usize,
        arg5: *const cpuset_t,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct epoch_context {
    pub data: [*mut ::std::os::raw::c_void; 2usize],
}
#[test]
fn bindgen_test_layout_epoch_context() {
    const UNINIT: ::std::mem::MaybeUninit<epoch_context> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<epoch_context>(),
        16usize,
        concat!("Size of: ", stringify!(epoch_context))
    );
    assert_eq!(
        ::std::mem::align_of::<epoch_context>(),
        8usize,
        concat!("Alignment of ", stringify!(epoch_context))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(epoch_context), "::", stringify!(data))
    );
}
pub type epoch_context_t = *mut epoch_context;
pub type epoch_callback_t = ::std::option::Option<unsafe extern "C" fn(arg1: epoch_context_t)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lock_object {
    pub lo_name: *const ::std::os::raw::c_char,
    pub lo_flags: u_int,
    pub lo_data: u_int,
    pub lo_witness: *mut witness,
}
#[test]
fn bindgen_test_layout_lock_object() {
    const UNINIT: ::std::mem::MaybeUninit<lock_object> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lock_object>(),
        24usize,
        concat!("Size of: ", stringify!(lock_object))
    );
    assert_eq!(
        ::std::mem::align_of::<lock_object>(),
        8usize,
        concat!("Alignment of ", stringify!(lock_object))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lo_name) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(lock_object), "::", stringify!(lo_name))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lo_flags) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(lock_object), "::", stringify!(lo_flags))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lo_data) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(lock_object), "::", stringify!(lo_data))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lo_witness) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lock_object),
            "::",
            stringify!(lo_witness)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mtx {
    pub lock_object: lock_object,
    pub mtx_lock: usize,
}
#[test]
fn bindgen_test_layout_mtx() {
    const UNINIT: ::std::mem::MaybeUninit<mtx> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mtx>(),
        32usize,
        concat!("Size of: ", stringify!(mtx))
    );
    assert_eq!(
        ::std::mem::align_of::<mtx>(),
        8usize,
        concat!("Alignment of ", stringify!(mtx))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lock_object) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(mtx), "::", stringify!(lock_object))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mtx_lock) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(mtx), "::", stringify!(mtx_lock))
    );
}
#[repr(C)]
#[repr(align(64))]
#[derive(Debug, Copy, Clone)]
pub struct mtx_padalign {
    pub lock_object: lock_object,
    pub mtx_lock: usize,
}
#[test]
fn bindgen_test_layout_mtx_padalign() {
    const UNINIT: ::std::mem::MaybeUninit<mtx_padalign> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mtx_padalign>(),
        64usize,
        concat!("Size of: ", stringify!(mtx_padalign))
    );
    assert_eq!(
        ::std::mem::align_of::<mtx_padalign>(),
        64usize,
        concat!("Alignment of ", stringify!(mtx_padalign))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lock_object) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mtx_padalign),
            "::",
            stringify!(lock_object)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mtx_lock) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mtx_padalign),
            "::",
            stringify!(mtx_lock)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct malloc_type_stats {
    pub mts_memalloced: u64,
    pub mts_memfreed: u64,
    pub mts_numallocs: u64,
    pub mts_numfrees: u64,
    pub mts_size: u64,
    pub _mts_reserved1: u64,
    pub _mts_reserved2: u64,
    pub _mts_reserved3: u64,
}
#[test]
fn bindgen_test_layout_malloc_type_stats() {
    const UNINIT: ::std::mem::MaybeUninit<malloc_type_stats> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<malloc_type_stats>(),
        64usize,
        concat!("Size of: ", stringify!(malloc_type_stats))
    );
    assert_eq!(
        ::std::mem::align_of::<malloc_type_stats>(),
        8usize,
        concat!("Alignment of ", stringify!(malloc_type_stats))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mts_memalloced) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(malloc_type_stats),
            "::",
            stringify!(mts_memalloced)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mts_memfreed) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(malloc_type_stats),
            "::",
            stringify!(mts_memfreed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mts_numallocs) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(malloc_type_stats),
            "::",
            stringify!(mts_numallocs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mts_numfrees) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(malloc_type_stats),
            "::",
            stringify!(mts_numfrees)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mts_size) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(malloc_type_stats),
            "::",
            stringify!(mts_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mts_reserved1) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(malloc_type_stats),
            "::",
            stringify!(_mts_reserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mts_reserved2) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(malloc_type_stats),
            "::",
            stringify!(_mts_reserved2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mts_reserved3) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(malloc_type_stats),
            "::",
            stringify!(_mts_reserved3)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct malloc_type_internal {
    pub mti_probes: [u32; 2usize],
    pub mti_zone: u_char,
    pub mti_stats: *mut malloc_type_stats,
    pub mti_spare: [u_long; 8usize],
}
#[test]
fn bindgen_test_layout_malloc_type_internal() {
    const UNINIT: ::std::mem::MaybeUninit<malloc_type_internal> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<malloc_type_internal>(),
        88usize,
        concat!("Size of: ", stringify!(malloc_type_internal))
    );
    assert_eq!(
        ::std::mem::align_of::<malloc_type_internal>(),
        8usize,
        concat!("Alignment of ", stringify!(malloc_type_internal))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mti_probes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(malloc_type_internal),
            "::",
            stringify!(mti_probes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mti_zone) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(malloc_type_internal),
            "::",
            stringify!(mti_zone)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mti_stats) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(malloc_type_internal),
            "::",
            stringify!(mti_stats)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mti_spare) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(malloc_type_internal),
            "::",
            stringify!(mti_spare)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct malloc_type {
    pub ks_next: *mut malloc_type,
    pub ks_version: u_long,
    pub ks_shortdesc: *const ::std::os::raw::c_char,
    pub ks_mti: malloc_type_internal,
}
#[test]
fn bindgen_test_layout_malloc_type() {
    const UNINIT: ::std::mem::MaybeUninit<malloc_type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<malloc_type>(),
        112usize,
        concat!("Size of: ", stringify!(malloc_type))
    );
    assert_eq!(
        ::std::mem::align_of::<malloc_type>(),
        8usize,
        concat!("Alignment of ", stringify!(malloc_type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ks_next) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(malloc_type), "::", stringify!(ks_next))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ks_version) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(malloc_type),
            "::",
            stringify!(ks_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ks_shortdesc) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(malloc_type),
            "::",
            stringify!(ks_shortdesc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ks_mti) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(malloc_type), "::", stringify!(ks_mti))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct malloc_type_stream_header {
    pub mtsh_version: u32,
    pub mtsh_maxcpus: u32,
    pub mtsh_count: u32,
    pub _mtsh_pad: u32,
}
#[test]
fn bindgen_test_layout_malloc_type_stream_header() {
    const UNINIT: ::std::mem::MaybeUninit<malloc_type_stream_header> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<malloc_type_stream_header>(),
        16usize,
        concat!("Size of: ", stringify!(malloc_type_stream_header))
    );
    assert_eq!(
        ::std::mem::align_of::<malloc_type_stream_header>(),
        4usize,
        concat!("Alignment of ", stringify!(malloc_type_stream_header))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mtsh_version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(malloc_type_stream_header),
            "::",
            stringify!(mtsh_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mtsh_maxcpus) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(malloc_type_stream_header),
            "::",
            stringify!(mtsh_maxcpus)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mtsh_count) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(malloc_type_stream_header),
            "::",
            stringify!(mtsh_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mtsh_pad) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(malloc_type_stream_header),
            "::",
            stringify!(_mtsh_pad)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct malloc_type_header {
    pub mth_name: [::std::os::raw::c_char; 32usize],
}
#[test]
fn bindgen_test_layout_malloc_type_header() {
    const UNINIT: ::std::mem::MaybeUninit<malloc_type_header> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<malloc_type_header>(),
        32usize,
        concat!("Size of: ", stringify!(malloc_type_header))
    );
    assert_eq!(
        ::std::mem::align_of::<malloc_type_header>(),
        1usize,
        concat!("Alignment of ", stringify!(malloc_type_header))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mth_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(malloc_type_header),
            "::",
            stringify!(mth_name)
        )
    );
}
pub type va_list = __va_list;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = __int_fast8_t;
pub type int_fast16_t = __int_fast16_t;
pub type int_fast32_t = __int_fast32_t;
pub type int_fast64_t = __int_fast64_t;
pub type uint_fast8_t = __uint_fast8_t;
pub type uint_fast16_t = __uint_fast16_t;
pub type uint_fast32_t = __uint_fast32_t;
pub type uint_fast64_t = __uint_fast64_t;
pub type fpos_t = __off_t;
pub type rsize_t = usize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut ::std::os::raw::c_uchar,
    pub _size: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___sbuf() {
    const UNINIT: ::std::mem::MaybeUninit<__sbuf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__sbuf>(),
        16usize,
        concat!("Size of: ", stringify!(__sbuf))
    );
    assert_eq!(
        ::std::mem::align_of::<__sbuf>(),
        8usize,
        concat!("Alignment of ", stringify!(__sbuf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._base) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(__sbuf), "::", stringify!(_base))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._size) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(__sbuf), "::", stringify!(_size))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut ::std::os::raw::c_uchar,
    pub _r: ::std::os::raw::c_int,
    pub _w: ::std::os::raw::c_int,
    pub _flags: ::std::os::raw::c_short,
    pub _file: ::std::os::raw::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: ::std::os::raw::c_int,
    pub _cookie: *mut ::std::os::raw::c_void,
    pub _close: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int>,
    pub _read: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut ::std::os::raw::c_char,
            arg3: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _seek: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: fpos_t, arg3: ::std::os::raw::c_int) -> fpos_t,
    >,
    pub _write: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_char,
            arg3: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _ub: __sbuf,
    pub _up: *mut ::std::os::raw::c_uchar,
    pub _ur: ::std::os::raw::c_int,
    pub _ubuf: [::std::os::raw::c_uchar; 3usize],
    pub _nbuf: [::std::os::raw::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: ::std::os::raw::c_int,
    pub _offset: fpos_t,
    pub _fl_mutex: *mut pthread_mutex,
    pub _fl_owner: *mut pthread,
    pub _fl_count: ::std::os::raw::c_int,
    pub _orientation: ::std::os::raw::c_int,
    pub _mbstate: __mbstate_t,
    pub _flags2: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___sFILE() {
    const UNINIT: ::std::mem::MaybeUninit<__sFILE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__sFILE>(),
        312usize,
        concat!("Size of: ", stringify!(__sFILE))
    );
    assert_eq!(
        ::std::mem::align_of::<__sFILE>(),
        8usize,
        concat!("Alignment of ", stringify!(__sFILE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._p) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_p))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._r) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_r))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._w) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_w))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_flags))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._file) as usize - ptr as usize },
        18usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_file))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._bf) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_bf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._lbfsize) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_lbfsize))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._cookie) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_cookie))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._close) as usize - ptr as usize },
        56usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_close))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._read) as usize - ptr as usize },
        64usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_read))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._seek) as usize - ptr as usize },
        72usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_seek))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._write) as usize - ptr as usize },
        80usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_write))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ub) as usize - ptr as usize },
        88usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_ub))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._up) as usize - ptr as usize },
        104usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_up))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ur) as usize - ptr as usize },
        112usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_ur))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ubuf) as usize - ptr as usize },
        116usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_ubuf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._nbuf) as usize - ptr as usize },
        119usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_nbuf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._lb) as usize - ptr as usize },
        120usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_lb))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._blksize) as usize - ptr as usize },
        136usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_blksize))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._offset) as usize - ptr as usize },
        144usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_offset))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._fl_mutex) as usize - ptr as usize },
        152usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_fl_mutex))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._fl_owner) as usize - ptr as usize },
        160usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_fl_owner))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._fl_count) as usize - ptr as usize },
        168usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_fl_count))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._orientation) as usize - ptr as usize },
        172usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_orientation))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mbstate) as usize - ptr as usize },
        176usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_mbstate))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags2) as usize - ptr as usize },
        304usize,
        concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_flags2))
    );
}
pub type FILE = __sFILE;
extern "C" {
    pub static mut __stdinp: *mut FILE;
}
extern "C" {
    pub static mut __stdoutp: *mut FILE;
}
extern "C" {
    pub static mut __stderrp: *mut FILE;
}
extern "C" {
    pub fn clearerr(arg1: *mut FILE);
}
extern "C" {
    pub fn fclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn feof(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetpos(arg1: *mut FILE, arg2: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fopen(arg1: *const ::std::os::raw::c_char, arg2: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn fprintf(arg1: *mut FILE, arg2: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputs(arg1: *const ::std::os::raw::c_char, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        arg1: *mut ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_ulong,
        arg3: ::std::os::raw::c_ulong,
        arg4: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn freopen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fscanf(arg1: *mut FILE, arg2: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fseek(arg1: *mut FILE, arg2: ::std::os::raw::c_long, arg3: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(arg1: *mut FILE, arg2: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(arg1: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn fwrite(
        arg1: *const ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_ulong,
        arg3: ::std::os::raw::c_ulong,
        arg4: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn getc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gets_s(arg1: *mut ::std::os::raw::c_char, arg2: rsize_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn perror(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn printf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn remove(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(arg1: *const ::std::os::raw::c_char, arg2: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rewind(arg1: *mut FILE);
}
extern "C" {
    pub fn scanf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuf(arg1: *mut FILE, arg2: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        arg1: *mut FILE,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ungetc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(arg1: *const ::std::os::raw::c_char, arg2: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_ulong,
        arg3: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_ulong,
        arg3: *const ::std::os::raw::c_char,
        arg4: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(arg1: *const ::std::os::raw::c_char, arg2: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fdopen(arg1: ::std::os::raw::c_int, arg2: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn fileno(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(arg1: *const ::std::os::raw::c_char, arg2: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn ftrylockfile(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn flockfile(arg1: *mut FILE);
}
extern "C" {
    pub fn funlockfile(arg1: *mut FILE);
}
extern "C" {
    pub fn getc_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(arg1: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputs_unlocked(arg1: *const ::std::os::raw::c_char, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread_unlocked(arg1: *mut ::std::os::raw::c_void, arg2: usize, arg3: usize, arg4: *mut FILE) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(arg1: *const ::std::os::raw::c_void, arg2: usize, arg3: usize, arg4: *mut FILE) -> usize;
}
extern "C" {
    pub fn fseeko(arg1: *mut FILE, arg2: __off_t, arg3: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(arg1: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn getw(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tempnam(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fmemopen(arg1: *mut ::std::os::raw::c_void, arg2: usize, arg3: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn getdelim(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *mut usize,
        arg3: ::std::os::raw::c_int,
        arg4: *mut FILE,
    ) -> isize;
}
extern "C" {
    pub fn open_memstream(arg1: *mut *mut ::std::os::raw::c_char, arg2: *mut usize) -> *mut FILE;
}
extern "C" {
    pub fn renameat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getline(arg1: *mut *mut ::std::os::raw::c_char, arg2: *mut usize, arg3: *mut FILE) -> isize;
}
extern "C" {
    pub fn dprintf(arg1: ::std::os::raw::c_int, arg2: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn asprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid_r(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcloseall();
}
extern "C" {
    pub fn fdclose(arg1: *mut FILE, arg2: *mut ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetln(arg1: *mut FILE, arg2: *mut usize) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fmtcheck(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn fpurge(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(arg1: *mut FILE, arg2: *mut ::std::os::raw::c_char, arg3: ::std::os::raw::c_int);
}
extern "C" {
    pub fn setlinebuf(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vasprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub static sys_nerr: ::std::os::raw::c_int;
}
extern "C" {
    pub static sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub fn funopen(
        arg1: *const ::std::os::raw::c_void,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *mut ::std::os::raw::c_char,
                arg3: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_char,
                arg3: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
        arg4: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: fpos_t,
                arg3: ::std::os::raw::c_int,
            ) -> fpos_t,
        >,
        arg5: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int>,
    ) -> *mut FILE;
}
pub type cookie_read_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_char,
        arg3: usize,
    ) -> __ssize_t,
>;
pub type cookie_write_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_char,
        arg3: usize,
    ) -> __ssize_t,
>;
pub type cookie_seek_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut off64_t,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type cookie_close_function_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cookie_io_functions_t {
    pub read: cookie_read_function_t,
    pub write: cookie_write_function_t,
    pub seek: cookie_seek_function_t,
    pub close: cookie_close_function_t,
}
#[test]
fn bindgen_test_layout_cookie_io_functions_t() {
    const UNINIT: ::std::mem::MaybeUninit<cookie_io_functions_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cookie_io_functions_t>(),
        32usize,
        concat!("Size of: ", stringify!(cookie_io_functions_t))
    );
    assert_eq!(
        ::std::mem::align_of::<cookie_io_functions_t>(),
        8usize,
        concat!("Alignment of ", stringify!(cookie_io_functions_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).read) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cookie_io_functions_t),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).write) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cookie_io_functions_t),
            "::",
            stringify!(write)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seek) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cookie_io_functions_t),
            "::",
            stringify!(seek)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).close) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(cookie_io_functions_t),
            "::",
            stringify!(close)
        )
    );
}
extern "C" {
    pub fn fopencookie(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_char,
        arg3: cookie_io_functions_t,
    ) -> *mut FILE;
}
extern "C" {
    pub fn __srget(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __swbuf(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub static mut __isthreaded: ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FreeBSD_nvlist {
    _unused: [u8; 0],
}
pub type FreeBSD_nvlist_t = FreeBSD_nvlist;
extern "C" {
    pub fn FreeBSD_nvlist_create(flags: ::std::os::raw::c_int) -> *mut FreeBSD_nvlist_t;
}
extern "C" {
    pub fn FreeBSD_nvlist_destroy(nvl: *mut FreeBSD_nvlist_t);
}
extern "C" {
    pub fn FreeBSD_nvlist_error(nvl: *const FreeBSD_nvlist_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn FreeBSD_nvlist_empty(nvl: *const FreeBSD_nvlist_t) -> bool;
}
extern "C" {
    pub fn FreeBSD_nvlist_flags(nvl: *const FreeBSD_nvlist_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn FreeBSD_nvlist_set_error(nvl: *mut FreeBSD_nvlist_t, error: ::std::os::raw::c_int);
}
extern "C" {
    pub fn FreeBSD_nvlist_clone(nvl: *const FreeBSD_nvlist_t) -> *mut FreeBSD_nvlist_t;
}
extern "C" {
    pub fn FreeBSD_nvlist_dump(nvl: *const FreeBSD_nvlist_t, fd: ::std::os::raw::c_int);
}
extern "C" {
    pub fn FreeBSD_nvlist_fdump(nvl: *const FreeBSD_nvlist_t, fp: *mut FILE);
}
extern "C" {
    pub fn FreeBSD_nvlist_size(nvl: *const FreeBSD_nvlist_t) -> usize;
}
extern "C" {
    pub fn FreeBSD_nvlist_pack(nvl: *const FreeBSD_nvlist_t, sizep: *mut usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn FreeBSD_nvlist_unpack(
        buf: *const ::std::os::raw::c_void,
        size: usize,
        flags: ::std::os::raw::c_int,
    ) -> *mut FreeBSD_nvlist_t;
}
extern "C" {
    pub fn FreeBSD_nvlist_send(sock: ::std::os::raw::c_int, nvl: *const FreeBSD_nvlist_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn FreeBSD_nvlist_recv(sock: ::std::os::raw::c_int, flags: ::std::os::raw::c_int) -> *mut FreeBSD_nvlist_t;
}
extern "C" {
    pub fn FreeBSD_nvlist_xfer(
        sock: ::std::os::raw::c_int,
        nvl: *mut FreeBSD_nvlist_t,
        flags: ::std::os::raw::c_int,
    ) -> *mut FreeBSD_nvlist_t;
}
extern "C" {
    pub fn FreeBSD_nvlist_next(
        nvl: *const FreeBSD_nvlist_t,
        typep: *mut ::std::os::raw::c_int,
        cookiep: *mut *mut ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn FreeBSD_nvlist_get_parent(
        nvl: *const FreeBSD_nvlist_t,
        cookiep: *mut *mut ::std::os::raw::c_void,
    ) -> *const FreeBSD_nvlist_t;
}
extern "C" {
    pub fn FreeBSD_nvlist_get_array_next(nvl: *const FreeBSD_nvlist_t) -> *const FreeBSD_nvlist_t;
}
extern "C" {
    pub fn FreeBSD_nvlist_in_array(nvl: *const FreeBSD_nvlist_t) -> bool;
}
extern "C" {
    pub fn FreeBSD_nvlist_get_pararr(
        nvl: *const FreeBSD_nvlist_t,
        cookiep: *mut *mut ::std::os::raw::c_void,
    ) -> *const FreeBSD_nvlist_t;
}
extern "C" {
    pub fn FreeBSD_nvlist_exists(nvl: *const FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char) -> bool;
}
extern "C" {
    pub fn FreeBSD_nvlist_exists_type(
        nvl: *const FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        type_: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    pub fn FreeBSD_nvlist_exists_null(nvl: *const FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char) -> bool;
}
extern "C" {
    pub fn FreeBSD_nvlist_exists_bool(nvl: *const FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char) -> bool;
}
extern "C" {
    pub fn FreeBSD_nvlist_exists_number(nvl: *const FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char) -> bool;
}
extern "C" {
    pub fn FreeBSD_nvlist_exists_string(nvl: *const FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char) -> bool;
}
extern "C" {
    pub fn FreeBSD_nvlist_exists_nvlist(nvl: *const FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char) -> bool;
}
extern "C" {
    pub fn FreeBSD_nvlist_exists_binary(nvl: *const FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char) -> bool;
}
extern "C" {
    pub fn FreeBSD_nvlist_exists_bool_array(nvl: *const FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char) -> bool;
}
extern "C" {
    pub fn FreeBSD_nvlist_exists_number_array(
        nvl: *const FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    pub fn FreeBSD_nvlist_exists_string_array(
        nvl: *const FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    pub fn FreeBSD_nvlist_exists_nvlist_array(
        nvl: *const FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    pub fn FreeBSD_nvlist_exists_descriptor(nvl: *const FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char) -> bool;
}
extern "C" {
    pub fn FreeBSD_nvlist_exists_descriptor_array(
        nvl: *const FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    pub fn FreeBSD_nvlist_add_null(nvl: *mut FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn FreeBSD_nvlist_add_bool(nvl: *mut FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char, value: bool);
}
extern "C" {
    pub fn FreeBSD_nvlist_add_number(nvl: *mut FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char, value: u64);
}
extern "C" {
    pub fn FreeBSD_nvlist_add_string(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_add_stringf(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        valuefmt: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_add_stringv(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        valuefmt: *const ::std::os::raw::c_char,
        valueap: *mut __va_list_tag,
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_add_nvlist(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        value: *const FreeBSD_nvlist_t,
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_add_binary(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_void,
        size: usize,
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_add_bool_array(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        value: *const bool,
        nitems: usize,
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_add_number_array(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        value: *const u64,
        nitems: usize,
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_add_string_array(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        value: *const *const ::std::os::raw::c_char,
        nitems: usize,
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_add_nvlist_array(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        value: *const *const FreeBSD_nvlist_t,
        nitems: usize,
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_add_descriptor(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        value: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_add_descriptor_array(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_int,
        nitems: usize,
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_append_bool_array(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        value: bool,
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_append_number_array(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        value: u64,
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_append_string_array(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_append_nvlist_array(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        value: *const FreeBSD_nvlist_t,
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_append_descriptor_array(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        value: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_move_string(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        value: *mut ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_move_nvlist(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        value: *mut FreeBSD_nvlist_t,
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_move_binary(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        value: *mut ::std::os::raw::c_void,
        size: usize,
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_move_bool_array(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        value: *mut bool,
        nitems: usize,
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_move_string_array(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        value: *mut *mut ::std::os::raw::c_char,
        nitems: usize,
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_move_nvlist_array(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        value: *mut *mut FreeBSD_nvlist_t,
        nitems: usize,
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_move_number_array(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        value: *mut u64,
        nitems: usize,
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_move_descriptor(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        value: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_move_descriptor_array(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        value: *mut ::std::os::raw::c_int,
        nitems: usize,
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_get_bool(nvl: *const FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char) -> bool;
}
extern "C" {
    pub fn FreeBSD_nvlist_get_number(nvl: *const FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char) -> u64;
}
extern "C" {
    pub fn FreeBSD_nvlist_get_string(
        nvl: *const FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn FreeBSD_nvlist_get_nvlist(
        nvl: *const FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
    ) -> *const FreeBSD_nvlist_t;
}
extern "C" {
    pub fn FreeBSD_nvlist_get_binary(
        nvl: *const FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        sizep: *mut usize,
    ) -> *const ::std::os::raw::c_void;
}
extern "C" {
    pub fn FreeBSD_nvlist_get_bool_array(
        nvl: *const FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        nitemsp: *mut usize,
    ) -> *const bool;
}
extern "C" {
    pub fn FreeBSD_nvlist_get_number_array(
        nvl: *const FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        nitemsp: *mut usize,
    ) -> *const u64;
}
extern "C" {
    pub fn FreeBSD_nvlist_get_string_array(
        nvl: *const FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        nitemsp: *mut usize,
    ) -> *const *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn FreeBSD_nvlist_get_nvlist_array(
        nvl: *const FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        nitemsp: *mut usize,
    ) -> *const *const FreeBSD_nvlist_t;
}
extern "C" {
    pub fn FreeBSD_nvlist_get_descriptor(
        nvl: *const FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn FreeBSD_nvlist_get_descriptor_array(
        nvl: *const FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        nitemsp: *mut usize,
    ) -> *const ::std::os::raw::c_int;
}
extern "C" {
    pub fn FreeBSD_nvlist_take_bool(nvl: *mut FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char) -> bool;
}
extern "C" {
    pub fn FreeBSD_nvlist_take_number(nvl: *mut FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char) -> u64;
}
extern "C" {
    pub fn FreeBSD_nvlist_take_string(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn FreeBSD_nvlist_take_nvlist(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
    ) -> *mut FreeBSD_nvlist_t;
}
extern "C" {
    pub fn FreeBSD_nvlist_take_binary(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        sizep: *mut usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn FreeBSD_nvlist_take_bool_array(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        nitemsp: *mut usize,
    ) -> *mut bool;
}
extern "C" {
    pub fn FreeBSD_nvlist_take_number_array(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        nitemsp: *mut usize,
    ) -> *mut u64;
}
extern "C" {
    pub fn FreeBSD_nvlist_take_string_array(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        nitemsp: *mut usize,
    ) -> *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn FreeBSD_nvlist_take_nvlist_array(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        nitemsp: *mut usize,
    ) -> *mut *mut FreeBSD_nvlist_t;
}
extern "C" {
    pub fn FreeBSD_nvlist_take_descriptor(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn FreeBSD_nvlist_take_descriptor_array(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        nitemsp: *mut usize,
    ) -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn FreeBSD_nvlist_free(nvl: *mut FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn FreeBSD_nvlist_free_type(
        nvl: *mut FreeBSD_nvlist_t,
        name: *const ::std::os::raw::c_char,
        type_: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn FreeBSD_nvlist_free_null(nvl: *mut FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn FreeBSD_nvlist_free_bool(nvl: *mut FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn FreeBSD_nvlist_free_number(nvl: *mut FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn FreeBSD_nvlist_free_string(nvl: *mut FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn FreeBSD_nvlist_free_nvlist(nvl: *mut FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn FreeBSD_nvlist_free_binary(nvl: *mut FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn FreeBSD_nvlist_free_bool_array(nvl: *mut FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn FreeBSD_nvlist_free_number_array(nvl: *mut FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn FreeBSD_nvlist_free_string_array(nvl: *mut FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn FreeBSD_nvlist_free_nvlist_array(nvl: *mut FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn FreeBSD_nvlist_free_binary_array(nvl: *mut FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn FreeBSD_nvlist_free_descriptor(nvl: *mut FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn FreeBSD_nvlist_free_descriptor_array(nvl: *mut FreeBSD_nvlist_t, name: *const ::std::os::raw::c_char);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __hack {
    _unused: [u8; 0],
}
extern "C" {
    pub fn sysctl(
        arg1: *const ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_uint,
        arg3: *mut ::std::os::raw::c_void,
        arg4: *mut usize,
        arg5: *const ::std::os::raw::c_void,
        arg6: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sysctlbyname(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut ::std::os::raw::c_void,
        arg3: *mut usize,
        arg4: *const ::std::os::raw::c_void,
        arg5: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sysctlnametomib(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut ::std::os::raw::c_int,
        arg3: *mut usize,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lock_list_entry {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct thread {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lock_class {
    pub lc_name: *const ::std::os::raw::c_char,
    pub lc_flags: u_int,
    pub lc_assert: ::std::option::Option<unsafe extern "C" fn(lock: *const lock_object, what: ::std::os::raw::c_int)>,
    pub lc_ddb_show: ::std::option::Option<unsafe extern "C" fn(lock: *const lock_object)>,
    pub lc_lock: ::std::option::Option<unsafe extern "C" fn(lock: *mut lock_object, how: usize)>,
    pub lc_owner: ::std::option::Option<
        unsafe extern "C" fn(lock: *const lock_object, owner: *mut *mut thread) -> ::std::os::raw::c_int,
    >,
    pub lc_unlock: ::std::option::Option<unsafe extern "C" fn(lock: *mut lock_object) -> usize>,
}
#[test]
fn bindgen_test_layout_lock_class() {
    const UNINIT: ::std::mem::MaybeUninit<lock_class> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lock_class>(),
        56usize,
        concat!("Size of: ", stringify!(lock_class))
    );
    assert_eq!(
        ::std::mem::align_of::<lock_class>(),
        8usize,
        concat!("Alignment of ", stringify!(lock_class))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lc_name) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(lock_class), "::", stringify!(lc_name))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lc_flags) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(lock_class), "::", stringify!(lc_flags))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lc_assert) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(lock_class), "::", stringify!(lc_assert))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lc_ddb_show) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lock_class),
            "::",
            stringify!(lc_ddb_show)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lc_lock) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(lock_class), "::", stringify!(lc_lock))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lc_owner) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(lock_class), "::", stringify!(lc_owner))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lc_unlock) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(lock_class), "::", stringify!(lc_unlock))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sx {
    pub lock_object: lock_object,
    pub sx_lock: usize,
}
#[test]
fn bindgen_test_layout_sx() {
    const UNINIT: ::std::mem::MaybeUninit<sx> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sx>(),
        32usize,
        concat!("Size of: ", stringify!(sx))
    );
    assert_eq!(
        ::std::mem::align_of::<sx>(),
        8usize,
        concat!("Alignment of ", stringify!(sx))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lock_object) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sx), "::", stringify!(lock_object))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sx_lock) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(sx), "::", stringify!(sx_lock))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmpriolist {
    pub lh_first: *mut rm_priotracker,
}
#[test]
fn bindgen_test_layout_rmpriolist() {
    const UNINIT: ::std::mem::MaybeUninit<rmpriolist> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmpriolist>(),
        8usize,
        concat!("Size of: ", stringify!(rmpriolist))
    );
    assert_eq!(
        ::std::mem::align_of::<rmpriolist>(),
        8usize,
        concat!("Alignment of ", stringify!(rmpriolist))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lh_first) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(rmpriolist), "::", stringify!(lh_first))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rm_queue {
    pub rmq_next: *mut rm_queue,
    pub rmq_prev: *mut rm_queue,
}
#[test]
fn bindgen_test_layout_rm_queue() {
    const UNINIT: ::std::mem::MaybeUninit<rm_queue> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rm_queue>(),
        16usize,
        concat!("Size of: ", stringify!(rm_queue))
    );
    assert_eq!(
        ::std::mem::align_of::<rm_queue>(),
        8usize,
        concat!("Alignment of ", stringify!(rm_queue))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rmq_next) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(rm_queue), "::", stringify!(rmq_next))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rmq_prev) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(rm_queue), "::", stringify!(rmq_prev))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct rmlock {
    pub lock_object: lock_object,
    pub rm_writecpus: cpuset_t,
    pub rm_activeReaders: rmlock__bindgen_ty_1,
    pub _rm_lock: rmlock__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmlock__bindgen_ty_1 {
    pub lh_first: *mut rm_priotracker,
}
#[test]
fn bindgen_test_layout_rmlock__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<rmlock__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmlock__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(rmlock__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<rmlock__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(rmlock__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lh_first) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmlock__bindgen_ty_1),
            "::",
            stringify!(lh_first)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union rmlock__bindgen_ty_2 {
    pub _rm_wlock_object: lock_object,
    pub _rm_lock_mtx: mtx,
    pub _rm_lock_sx: sx,
}
#[test]
fn bindgen_test_layout_rmlock__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<rmlock__bindgen_ty_2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmlock__bindgen_ty_2>(),
        32usize,
        concat!("Size of: ", stringify!(rmlock__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<rmlock__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(rmlock__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._rm_wlock_object) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmlock__bindgen_ty_2),
            "::",
            stringify!(_rm_wlock_object)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._rm_lock_mtx) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmlock__bindgen_ty_2),
            "::",
            stringify!(_rm_lock_mtx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._rm_lock_sx) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmlock__bindgen_ty_2),
            "::",
            stringify!(_rm_lock_sx)
        )
    );
}
#[test]
fn bindgen_test_layout_rmlock() {
    const UNINIT: ::std::mem::MaybeUninit<rmlock> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmlock>(),
        192usize,
        concat!("Size of: ", stringify!(rmlock))
    );
    assert_eq!(
        ::std::mem::align_of::<rmlock>(),
        8usize,
        concat!("Alignment of ", stringify!(rmlock))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lock_object) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(rmlock), "::", stringify!(lock_object))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rm_writecpus) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(rmlock), "::", stringify!(rm_writecpus))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rm_activeReaders) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(rmlock),
            "::",
            stringify!(rm_activeReaders)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._rm_lock) as usize - ptr as usize },
        160usize,
        concat!("Offset of field: ", stringify!(rmlock), "::", stringify!(_rm_lock))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rm_priotracker {
    pub rmp_cpuQueue: rm_queue,
    pub rmp_rmlock: *mut rmlock,
    pub rmp_thread: *mut thread,
    pub rmp_flags: ::std::os::raw::c_int,
    pub rmp_qentry: rm_priotracker__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rm_priotracker__bindgen_ty_1 {
    pub le_next: *mut rm_priotracker,
    pub le_prev: *mut *mut rm_priotracker,
}
#[test]
fn bindgen_test_layout_rm_priotracker__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<rm_priotracker__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rm_priotracker__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(rm_priotracker__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<rm_priotracker__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(rm_priotracker__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).le_next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rm_priotracker__bindgen_ty_1),
            "::",
            stringify!(le_next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).le_prev) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rm_priotracker__bindgen_ty_1),
            "::",
            stringify!(le_prev)
        )
    );
}
#[test]
fn bindgen_test_layout_rm_priotracker() {
    const UNINIT: ::std::mem::MaybeUninit<rm_priotracker> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rm_priotracker>(),
        56usize,
        concat!("Size of: ", stringify!(rm_priotracker))
    );
    assert_eq!(
        ::std::mem::align_of::<rm_priotracker>(),
        8usize,
        concat!("Alignment of ", stringify!(rm_priotracker))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rmp_cpuQueue) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rm_priotracker),
            "::",
            stringify!(rmp_cpuQueue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rmp_rmlock) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rm_priotracker),
            "::",
            stringify!(rmp_rmlock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rmp_thread) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rm_priotracker),
            "::",
            stringify!(rmp_thread)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rmp_flags) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(rm_priotracker),
            "::",
            stringify!(rmp_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rmp_qentry) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(rm_priotracker),
            "::",
            stringify!(rmp_qentry)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmslock_pcpu {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmslock {
    pub mtx: mtx,
    pub owner: *mut thread,
    pub pcpu: *mut rmslock_pcpu,
    pub writers: ::std::os::raw::c_int,
    pub readers: ::std::os::raw::c_int,
    pub debug_readers: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_rmslock() {
    const UNINIT: ::std::mem::MaybeUninit<rmslock> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmslock>(),
        64usize,
        concat!("Size of: ", stringify!(rmslock))
    );
    assert_eq!(
        ::std::mem::align_of::<rmslock>(),
        8usize,
        concat!("Alignment of ", stringify!(rmslock))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mtx) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(rmslock), "::", stringify!(mtx))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).owner) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(rmslock), "::", stringify!(owner))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pcpu) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(rmslock), "::", stringify!(pcpu))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).writers) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(rmslock), "::", stringify!(writers))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).readers) as usize - ptr as usize },
        52usize,
        concat!("Offset of field: ", stringify!(rmslock), "::", stringify!(readers))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).debug_readers) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(rmslock),
            "::",
            stringify!(debug_readers)
        )
    );
}
pub type seqc_t = u32;
pub type smr_seq_t = u32;
pub type smr_delta_t = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct smr {
    _unused: [u8; 0],
}
pub type smr_t = *mut smr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uma_zone {
    _unused: [u8; 0],
}
pub type uma_zone_t = *mut uma_zone;
pub type uma_ctor = ::std::option::Option<
    unsafe extern "C" fn(
        mem: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
        arg: *mut ::std::os::raw::c_void,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type uma_dtor = ::std::option::Option<
    unsafe extern "C" fn(
        mem: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
        arg: *mut ::std::os::raw::c_void,
    ),
>;
pub type uma_init = ::std::option::Option<
    unsafe extern "C" fn(
        mem: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type uma_fini =
    ::std::option::Option<unsafe extern "C" fn(mem: *mut ::std::os::raw::c_void, size: ::std::os::raw::c_int)>;
pub type uma_import = ::std::option::Option<
    unsafe extern "C" fn(
        arg: *mut ::std::os::raw::c_void,
        store: *mut *mut ::std::os::raw::c_void,
        count: ::std::os::raw::c_int,
        domain: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type uma_release = ::std::option::Option<
    unsafe extern "C" fn(
        arg: *mut ::std::os::raw::c_void,
        store: *mut *mut ::std::os::raw::c_void,
        count: ::std::os::raw::c_int,
    ),
>;
extern "C" {
    pub fn uma_zcreate(
        name: *const ::std::os::raw::c_char,
        size: usize,
        ctor: uma_ctor,
        dtor: uma_dtor,
        uminit: uma_init,
        fini: uma_fini,
        align: ::std::os::raw::c_int,
        flags: u32,
    ) -> uma_zone_t;
}
extern "C" {
    pub fn uma_zsecond_create(
        name: *const ::std::os::raw::c_char,
        ctor: uma_ctor,
        dtor: uma_dtor,
        zinit: uma_init,
        zfini: uma_fini,
        primary: uma_zone_t,
    ) -> uma_zone_t;
}
extern "C" {
    pub fn uma_zcache_create(
        name: *const ::std::os::raw::c_char,
        size: ::std::os::raw::c_int,
        ctor: uma_ctor,
        dtor: uma_dtor,
        zinit: uma_init,
        zfini: uma_fini,
        zimport: uma_import,
        zrelease: uma_release,
        arg: *mut ::std::os::raw::c_void,
        flags: ::std::os::raw::c_int,
    ) -> uma_zone_t;
}
extern "C" {
    pub fn uma_zdestroy(zone: uma_zone_t);
}
extern "C" {
    pub fn uma_zalloc_arg(
        zone: uma_zone_t,
        arg: *mut ::std::os::raw::c_void,
        flags: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn uma_zalloc_pcpu_arg(
        zone: uma_zone_t,
        arg: *mut ::std::os::raw::c_void,
        flags: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn uma_zalloc_smr(zone: uma_zone_t, flags: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn uma_zalloc_domain(
        zone: uma_zone_t,
        arg: *mut ::std::os::raw::c_void,
        domain: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn uma_zfree_arg(zone: uma_zone_t, item: *mut ::std::os::raw::c_void, arg: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn uma_zfree_pcpu_arg(zone: uma_zone_t, item: *mut ::std::os::raw::c_void, arg: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn uma_zfree_smr(zone: uma_zone_t, item: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn uma_zwait(zone: uma_zone_t);
}
pub type uma_alloc = ::std::option::Option<
    unsafe extern "C" fn(
        zone: uma_zone_t,
        size: vm_size_t,
        domain: ::std::os::raw::c_int,
        pflag: *mut u8,
        wait: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type uma_free =
    ::std::option::Option<unsafe extern "C" fn(item: *mut ::std::os::raw::c_void, size: vm_size_t, pflag: u8)>;
extern "C" {
    pub fn uma_reclaim(req: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uma_reclaim_domain(req: ::std::os::raw::c_int, domain: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uma_zone_reclaim(arg1: uma_zone_t, req: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uma_zone_reclaim_domain(arg1: uma_zone_t, req: ::std::os::raw::c_int, domain: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uma_set_align(align: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uma_zone_reserve(zone: uma_zone_t, nitems: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uma_zone_reserve_kva(zone: uma_zone_t, nitems: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uma_zone_set_max(zone: uma_zone_t, nitems: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uma_zone_set_maxcache(zone: uma_zone_t, nitems: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uma_zone_get_max(zone: uma_zone_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uma_zone_set_warning(zone: uma_zone_t, warning: *const ::std::os::raw::c_char);
}
pub type uma_maxaction_t = ::std::option::Option<unsafe extern "C" fn(arg1: uma_zone_t, arg2: ::std::os::raw::c_int)>;
extern "C" {
    pub fn uma_zone_set_maxaction(zone: uma_zone_t, arg1: uma_maxaction_t);
}
extern "C" {
    pub fn uma_zone_get_cur(zone: uma_zone_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uma_zone_set_init(zone: uma_zone_t, uminit: uma_init);
}
extern "C" {
    pub fn uma_zone_set_fini(zone: uma_zone_t, fini: uma_fini);
}
extern "C" {
    pub fn uma_zone_set_zinit(zone: uma_zone_t, zinit: uma_init);
}
extern "C" {
    pub fn uma_zone_set_zfini(zone: uma_zone_t, zfini: uma_fini);
}
extern "C" {
    pub fn uma_zone_set_allocf(zone: uma_zone_t, allocf: uma_alloc);
}
extern "C" {
    pub fn uma_zone_set_freef(zone: uma_zone_t, freef: uma_free);
}
extern "C" {
    pub fn uma_zone_set_smr(zone: uma_zone_t, smr: smr_t);
}
extern "C" {
    pub fn uma_zone_get_smr(zone: uma_zone_t) -> smr_t;
}
extern "C" {
    pub fn uma_prealloc(zone: uma_zone_t, itemcnt: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uma_zone_exhausted(zone: uma_zone_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uma_zone_memory(zone: uma_zone_t) -> usize;
}
extern "C" {
    pub static mut pcpu_zone_4: uma_zone_t;
}
extern "C" {
    pub static mut pcpu_zone_8: uma_zone_t;
}
extern "C" {
    pub static mut pcpu_zone_16: uma_zone_t;
}
extern "C" {
    pub static mut pcpu_zone_32: uma_zone_t;
}
extern "C" {
    pub static mut pcpu_zone_64: uma_zone_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uma_stream_header {
    pub ush_version: u32,
    pub ush_maxcpus: u32,
    pub ush_count: u32,
    pub _ush_pad: u32,
}
#[test]
fn bindgen_test_layout_uma_stream_header() {
    const UNINIT: ::std::mem::MaybeUninit<uma_stream_header> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uma_stream_header>(),
        16usize,
        concat!("Size of: ", stringify!(uma_stream_header))
    );
    assert_eq!(
        ::std::mem::align_of::<uma_stream_header>(),
        4usize,
        concat!("Alignment of ", stringify!(uma_stream_header))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ush_version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uma_stream_header),
            "::",
            stringify!(ush_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ush_maxcpus) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(uma_stream_header),
            "::",
            stringify!(ush_maxcpus)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ush_count) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uma_stream_header),
            "::",
            stringify!(ush_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ush_pad) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(uma_stream_header),
            "::",
            stringify!(_ush_pad)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uma_type_header {
    pub uth_name: [::std::os::raw::c_char; 32usize],
    pub uth_align: u32,
    pub uth_size: u32,
    pub uth_rsize: u32,
    pub uth_maxpages: u32,
    pub uth_limit: u32,
    pub uth_pages: u32,
    pub uth_keg_free: u32,
    pub uth_zone_free: u32,
    pub uth_bucketsize: u32,
    pub uth_zone_flags: u32,
    pub uth_allocs: u64,
    pub uth_frees: u64,
    pub uth_fails: u64,
    pub uth_sleeps: u64,
    pub uth_xdomain: u64,
    pub _uth_reserved1: [u64; 1usize],
}
#[test]
fn bindgen_test_layout_uma_type_header() {
    const UNINIT: ::std::mem::MaybeUninit<uma_type_header> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uma_type_header>(),
        120usize,
        concat!("Size of: ", stringify!(uma_type_header))
    );
    assert_eq!(
        ::std::mem::align_of::<uma_type_header>(),
        8usize,
        concat!("Alignment of ", stringify!(uma_type_header))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uth_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uma_type_header),
            "::",
            stringify!(uth_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uth_align) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uma_type_header),
            "::",
            stringify!(uth_align)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uth_size) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(uma_type_header),
            "::",
            stringify!(uth_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uth_rsize) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(uma_type_header),
            "::",
            stringify!(uth_rsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uth_maxpages) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(uma_type_header),
            "::",
            stringify!(uth_maxpages)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uth_limit) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(uma_type_header),
            "::",
            stringify!(uth_limit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uth_pages) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(uma_type_header),
            "::",
            stringify!(uth_pages)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uth_keg_free) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(uma_type_header),
            "::",
            stringify!(uth_keg_free)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uth_zone_free) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(uma_type_header),
            "::",
            stringify!(uth_zone_free)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uth_bucketsize) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(uma_type_header),
            "::",
            stringify!(uth_bucketsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uth_zone_flags) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(uma_type_header),
            "::",
            stringify!(uth_zone_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uth_allocs) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(uma_type_header),
            "::",
            stringify!(uth_allocs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uth_frees) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(uma_type_header),
            "::",
            stringify!(uth_frees)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uth_fails) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(uma_type_header),
            "::",
            stringify!(uth_fails)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uth_sleeps) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(uma_type_header),
            "::",
            stringify!(uth_sleeps)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uth_xdomain) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(uma_type_header),
            "::",
            stringify!(uth_xdomain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._uth_reserved1) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(uma_type_header),
            "::",
            stringify!(_uth_reserved1)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uma_percpu_stat {
    pub ups_allocs: u64,
    pub ups_frees: u64,
    pub ups_cache_free: u64,
    pub _ups_reserved: [u64; 5usize],
}
#[test]
fn bindgen_test_layout_uma_percpu_stat() {
    const UNINIT: ::std::mem::MaybeUninit<uma_percpu_stat> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uma_percpu_stat>(),
        64usize,
        concat!("Size of: ", stringify!(uma_percpu_stat))
    );
    assert_eq!(
        ::std::mem::align_of::<uma_percpu_stat>(),
        8usize,
        concat!("Alignment of ", stringify!(uma_percpu_stat))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ups_allocs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uma_percpu_stat),
            "::",
            stringify!(ups_allocs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ups_frees) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uma_percpu_stat),
            "::",
            stringify!(ups_frees)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ups_cache_free) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uma_percpu_stat),
            "::",
            stringify!(ups_cache_free)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ups_reserved) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uma_percpu_stat),
            "::",
            stringify!(_ups_reserved)
        )
    );
}
extern "C" {
    pub fn uma_reclaim_wakeup();
}
extern "C" {
    pub fn uma_reclaim_worker(arg1: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn uma_limit() -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn uma_size() -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn uma_avail() -> ::std::os::raw::c_long;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timezone {
    pub tz_minuteswest: ::std::os::raw::c_int,
    pub tz_dsttime: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_timezone() {
    const UNINIT: ::std::mem::MaybeUninit<timezone> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timezone>(),
        8usize,
        concat!("Size of: ", stringify!(timezone))
    );
    assert_eq!(
        ::std::mem::align_of::<timezone>(),
        4usize,
        concat!("Alignment of ", stringify!(timezone))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tz_minuteswest) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timezone),
            "::",
            stringify!(tz_minuteswest)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tz_dsttime) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(timezone), "::", stringify!(tz_dsttime))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bintime {
    pub sec: time_t,
    pub frac: u64,
}
#[test]
fn bindgen_test_layout_bintime() {
    const UNINIT: ::std::mem::MaybeUninit<bintime> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bintime>(),
        16usize,
        concat!("Size of: ", stringify!(bintime))
    );
    assert_eq!(
        ::std::mem::align_of::<bintime>(),
        8usize,
        concat!("Alignment of ", stringify!(bintime))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sec) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(bintime), "::", stringify!(sec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frac) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(bintime), "::", stringify!(frac))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerval {
    pub it_interval: timeval,
    pub it_value: timeval,
}
#[test]
fn bindgen_test_layout_itimerval() {
    const UNINIT: ::std::mem::MaybeUninit<itimerval> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<itimerval>(),
        32usize,
        concat!("Size of: ", stringify!(itimerval))
    );
    assert_eq!(
        ::std::mem::align_of::<itimerval>(),
        8usize,
        concat!("Alignment of ", stringify!(itimerval))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).it_interval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerval),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).it_value) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(itimerval), "::", stringify!(it_value))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct clockinfo {
    pub hz: ::std::os::raw::c_int,
    pub tick: ::std::os::raw::c_int,
    pub spare: ::std::os::raw::c_int,
    pub stathz: ::std::os::raw::c_int,
    pub profhz: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_clockinfo() {
    const UNINIT: ::std::mem::MaybeUninit<clockinfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<clockinfo>(),
        20usize,
        concat!("Size of: ", stringify!(clockinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<clockinfo>(),
        4usize,
        concat!("Alignment of ", stringify!(clockinfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hz) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(clockinfo), "::", stringify!(hz))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tick) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(clockinfo), "::", stringify!(tick))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).spare) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(clockinfo), "::", stringify!(spare))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stathz) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(clockinfo), "::", stringify!(stathz))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).profhz) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(clockinfo), "::", stringify!(profhz))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm() {
    const UNINIT: ::std::mem::MaybeUninit<tm> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<tm>(),
        56usize,
        concat!("Size of: ", stringify!(tm))
    );
    assert_eq!(
        ::std::mem::align_of::<tm>(),
        8usize,
        concat!("Alignment of ", stringify!(tm))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_sec) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_sec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_min) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_min))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_hour) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_hour))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_mday) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_mday))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_mon) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_mon))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_year) as usize - ptr as usize },
        20usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_year))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_wday) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_wday))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_yday) as usize - ptr as usize },
        28usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_yday))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_isdst) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_isdst))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_gmtoff) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_gmtoff))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_zone) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_zone))
    );
}
extern "C" {
    pub static mut tzname: [*mut ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub fn asctime(arg1: *const tm) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn clock() -> clock_t;
}
extern "C" {
    pub fn ctime(arg1: *const time_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn difftime(arg1: time_t, arg2: time_t) -> f64;
}
extern "C" {
    pub fn gmtime(arg1: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn localtime(arg1: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn mktime(arg1: *mut tm) -> time_t;
}
extern "C" {
    pub fn strftime(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: *const ::std::os::raw::c_char,
        arg4: *const tm,
    ) -> usize;
}
extern "C" {
    pub fn time(arg1: *mut time_t) -> time_t;
}
extern "C" {
    pub fn timer_create(arg1: clockid_t, arg2: *mut sigevent, arg3: *mut timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_delete(arg1: timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_gettime(arg1: timer_t, arg2: *mut itimerspec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_getoverrun(arg1: timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_settime(
        arg1: timer_t,
        arg2: ::std::os::raw::c_int,
        arg3: *const itimerspec,
        arg4: *mut itimerspec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tzset();
}
extern "C" {
    pub fn clock_getres(arg1: clockid_t, arg2: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_gettime(arg1: clockid_t, arg2: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_settime(arg1: clockid_t, arg2: *const timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nanosleep(arg1: *const timespec, arg2: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_getcpuclockid(arg1: pid_t, arg2: *mut clockid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_nanosleep(
        arg1: clockid_t,
        arg2: ::std::os::raw::c_int,
        arg3: *const timespec,
        arg4: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn asctime_r(arg1: *const tm, arg2: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime_r(arg1: *const time_t, arg2: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gmtime_r(arg1: *const time_t, arg2: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn localtime_r(arg1: *const time_t, arg2: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn strptime(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut tm,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn timezone(arg1: ::std::os::raw::c_int, arg2: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn timelocal(arg1: *mut tm) -> time_t;
}
extern "C" {
    pub fn timegm(arg1: *mut tm) -> time_t;
}
extern "C" {
    pub fn timer_oshandle_np(timerid: timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn time2posix(t: time_t) -> time_t;
}
extern "C" {
    pub fn posix2time(t: time_t) -> time_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xlocale {
    _unused: [u8; 0],
}
pub type locale_t = *mut _xlocale;
extern "C" {
    pub fn strftime_l(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: *const ::std::os::raw::c_char,
        arg4: *const tm,
        arg5: locale_t,
    ) -> usize;
}
extern "C" {
    pub fn timespec_get(ts: *mut timespec, base: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timespec_getres(arg1: *mut timespec, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setitimer(
        arg1: ::std::os::raw::c_int,
        arg2: *const itimerval,
        arg3: *mut itimerval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn utimes(arg1: *const ::std::os::raw::c_char, arg2: *const timeval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn adjtime(arg1: *const timeval, arg2: *mut timeval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_getcpuclockid2(arg1: id_t, arg2: ::std::os::raw::c_int, arg3: *mut clockid_t)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn futimes(arg1: ::std::os::raw::c_int, arg2: *const timeval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn futimesat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lutimes(arg1: *const ::std::os::raw::c_char, arg2: *const timeval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn settimeofday(arg1: *const timeval, arg2: *const timezone) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getitimer(arg1: ::std::os::raw::c_int, arg2: *mut itimerval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gettimeofday(arg1: *mut timeval, arg2: *mut timezone) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: usize,
}
#[test]
fn bindgen_test_layout_iovec() {
    const UNINIT: ::std::mem::MaybeUninit<iovec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iovec>(),
        16usize,
        concat!("Size of: ", stringify!(iovec))
    );
    assert_eq!(
        ::std::mem::align_of::<iovec>(),
        8usize,
        concat!("Alignment of ", stringify!(iovec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iov_base) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(iovec), "::", stringify!(iov_base))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iov_len) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(iovec), "::", stringify!(iov_len))
    );
}
pub type sa_family_t = __sa_family_t;
pub type socklen_t = __socklen_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct linger {
    pub l_onoff: ::std::os::raw::c_int,
    pub l_linger: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_linger() {
    const UNINIT: ::std::mem::MaybeUninit<linger> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<linger>(),
        8usize,
        concat!("Size of: ", stringify!(linger))
    );
    assert_eq!(
        ::std::mem::align_of::<linger>(),
        4usize,
        concat!("Alignment of ", stringify!(linger))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_onoff) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(linger), "::", stringify!(l_onoff))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_linger) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(linger), "::", stringify!(l_linger))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct accept_filter_arg {
    pub af_name: [::std::os::raw::c_char; 16usize],
    pub af_arg: [::std::os::raw::c_char; 240usize],
}
#[test]
fn bindgen_test_layout_accept_filter_arg() {
    const UNINIT: ::std::mem::MaybeUninit<accept_filter_arg> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<accept_filter_arg>(),
        256usize,
        concat!("Size of: ", stringify!(accept_filter_arg))
    );
    assert_eq!(
        ::std::mem::align_of::<accept_filter_arg>(),
        1usize,
        concat!("Alignment of ", stringify!(accept_filter_arg))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).af_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(accept_filter_arg),
            "::",
            stringify!(af_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).af_arg) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(accept_filter_arg),
            "::",
            stringify!(af_arg)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr {
    pub sa_len: ::std::os::raw::c_uchar,
    pub sa_family: sa_family_t,
    pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[test]
fn bindgen_test_layout_sockaddr() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr>(),
        16usize,
        concat!("Size of: ", stringify!(sockaddr))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr>(),
        1usize,
        concat!("Alignment of ", stringify!(sockaddr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_len) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sockaddr), "::", stringify!(sa_len))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_family) as usize - ptr as usize },
        1usize,
        concat!("Offset of field: ", stringify!(sockaddr), "::", stringify!(sa_family))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_data) as usize - ptr as usize },
        2usize,
        concat!("Offset of field: ", stringify!(sockaddr), "::", stringify!(sa_data))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockproto {
    pub sp_family: ::std::os::raw::c_ushort,
    pub sp_protocol: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout_sockproto() {
    const UNINIT: ::std::mem::MaybeUninit<sockproto> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockproto>(),
        4usize,
        concat!("Size of: ", stringify!(sockproto))
    );
    assert_eq!(
        ::std::mem::align_of::<sockproto>(),
        2usize,
        concat!("Alignment of ", stringify!(sockproto))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sp_family) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sockproto), "::", stringify!(sp_family))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sp_protocol) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockproto),
            "::",
            stringify!(sp_protocol)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_storage {
    pub ss_len: ::std::os::raw::c_uchar,
    pub ss_family: sa_family_t,
    pub __ss_pad1: [::std::os::raw::c_char; 6usize],
    pub __ss_align: __int64_t,
    pub __ss_pad2: [::std::os::raw::c_char; 112usize],
}
#[test]
fn bindgen_test_layout_sockaddr_storage() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr_storage> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr_storage>(),
        128usize,
        concat!("Size of: ", stringify!(sockaddr_storage))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_storage>(),
        8usize,
        concat!("Alignment of ", stringify!(sockaddr_storage))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ss_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(ss_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ss_family) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(ss_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ss_pad1) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(__ss_pad1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ss_align) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(__ss_align)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ss_pad2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(__ss_pad2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msghdr {
    pub msg_name: *mut ::std::os::raw::c_void,
    pub msg_namelen: socklen_t,
    pub msg_iov: *mut iovec,
    pub msg_iovlen: ::std::os::raw::c_int,
    pub msg_control: *mut ::std::os::raw::c_void,
    pub msg_controllen: socklen_t,
    pub msg_flags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_msghdr() {
    const UNINIT: ::std::mem::MaybeUninit<msghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<msghdr>(),
        48usize,
        concat!("Size of: ", stringify!(msghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<msghdr>(),
        8usize,
        concat!("Alignment of ", stringify!(msghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_name) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(msghdr), "::", stringify!(msg_name))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_namelen) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(msghdr), "::", stringify!(msg_namelen))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_iov) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(msghdr), "::", stringify!(msg_iov))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_iovlen) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(msghdr), "::", stringify!(msg_iovlen))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_control) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(msghdr), "::", stringify!(msg_control))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_controllen) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_controllen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_flags) as usize - ptr as usize },
        44usize,
        concat!("Offset of field: ", stringify!(msghdr), "::", stringify!(msg_flags))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cmsghdr {
    pub cmsg_len: socklen_t,
    pub cmsg_level: ::std::os::raw::c_int,
    pub cmsg_type: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_cmsghdr() {
    const UNINIT: ::std::mem::MaybeUninit<cmsghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cmsghdr>(),
        12usize,
        concat!("Size of: ", stringify!(cmsghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<cmsghdr>(),
        4usize,
        concat!("Alignment of ", stringify!(cmsghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmsg_len) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(cmsghdr), "::", stringify!(cmsg_len))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmsg_level) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(cmsghdr), "::", stringify!(cmsg_level))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmsg_type) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(cmsghdr), "::", stringify!(cmsg_type))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cmsgcred {
    pub cmcred_pid: pid_t,
    pub cmcred_uid: uid_t,
    pub cmcred_euid: uid_t,
    pub cmcred_gid: gid_t,
    pub cmcred_ngroups: ::std::os::raw::c_short,
    pub cmcred_groups: [gid_t; 16usize],
}
#[test]
fn bindgen_test_layout_cmsgcred() {
    const UNINIT: ::std::mem::MaybeUninit<cmsgcred> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cmsgcred>(),
        84usize,
        concat!("Size of: ", stringify!(cmsgcred))
    );
    assert_eq!(
        ::std::mem::align_of::<cmsgcred>(),
        4usize,
        concat!("Alignment of ", stringify!(cmsgcred))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmcred_pid) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(cmsgcred), "::", stringify!(cmcred_pid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmcred_uid) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(cmsgcred), "::", stringify!(cmcred_uid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmcred_euid) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(cmsgcred), "::", stringify!(cmcred_euid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmcred_gid) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(cmsgcred), "::", stringify!(cmcred_gid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmcred_ngroups) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsgcred),
            "::",
            stringify!(cmcred_ngroups)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmcred_groups) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsgcred),
            "::",
            stringify!(cmcred_groups)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockcred {
    pub sc_uid: uid_t,
    pub sc_euid: uid_t,
    pub sc_gid: gid_t,
    pub sc_egid: gid_t,
    pub sc_ngroups: ::std::os::raw::c_int,
    pub sc_groups: [gid_t; 1usize],
}
#[test]
fn bindgen_test_layout_sockcred() {
    const UNINIT: ::std::mem::MaybeUninit<sockcred> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockcred>(),
        24usize,
        concat!("Size of: ", stringify!(sockcred))
    );
    assert_eq!(
        ::std::mem::align_of::<sockcred>(),
        4usize,
        concat!("Alignment of ", stringify!(sockcred))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_uid) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sockcred), "::", stringify!(sc_uid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_euid) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(sockcred), "::", stringify!(sc_euid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_gid) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(sockcred), "::", stringify!(sc_gid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_egid) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(sockcred), "::", stringify!(sc_egid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_ngroups) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(sockcred), "::", stringify!(sc_ngroups))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_groups) as usize - ptr as usize },
        20usize,
        concat!("Offset of field: ", stringify!(sockcred), "::", stringify!(sc_groups))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockcred2 {
    pub sc_version: ::std::os::raw::c_int,
    pub sc_pid: pid_t,
    pub sc_uid: uid_t,
    pub sc_euid: uid_t,
    pub sc_gid: gid_t,
    pub sc_egid: gid_t,
    pub sc_ngroups: ::std::os::raw::c_int,
    pub sc_groups: [gid_t; 1usize],
}
#[test]
fn bindgen_test_layout_sockcred2() {
    const UNINIT: ::std::mem::MaybeUninit<sockcred2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockcred2>(),
        32usize,
        concat!("Size of: ", stringify!(sockcred2))
    );
    assert_eq!(
        ::std::mem::align_of::<sockcred2>(),
        4usize,
        concat!("Alignment of ", stringify!(sockcred2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_version) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sockcred2), "::", stringify!(sc_version))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_pid) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(sockcred2), "::", stringify!(sc_pid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_uid) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(sockcred2), "::", stringify!(sc_uid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_euid) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(sockcred2), "::", stringify!(sc_euid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_gid) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(sockcred2), "::", stringify!(sc_gid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_egid) as usize - ptr as usize },
        20usize,
        concat!("Offset of field: ", stringify!(sockcred2), "::", stringify!(sc_egid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_ngroups) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(sockcred2), "::", stringify!(sc_ngroups))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sc_groups) as usize - ptr as usize },
        28usize,
        concat!("Offset of field: ", stringify!(sockcred2), "::", stringify!(sc_groups))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sock_timestamp_info {
    pub st_info_flags: __uint32_t,
    pub st_info_pad0: __uint32_t,
    pub st_info_rsv: [__uint64_t; 7usize],
}
#[test]
fn bindgen_test_layout_sock_timestamp_info() {
    const UNINIT: ::std::mem::MaybeUninit<sock_timestamp_info> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sock_timestamp_info>(),
        64usize,
        concat!("Size of: ", stringify!(sock_timestamp_info))
    );
    assert_eq!(
        ::std::mem::align_of::<sock_timestamp_info>(),
        8usize,
        concat!("Alignment of ", stringify!(sock_timestamp_info))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_info_flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sock_timestamp_info),
            "::",
            stringify!(st_info_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_info_pad0) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sock_timestamp_info),
            "::",
            stringify!(st_info_pad0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_info_rsv) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sock_timestamp_info),
            "::",
            stringify!(st_info_rsv)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct osockaddr {
    pub sa_family: ::std::os::raw::c_ushort,
    pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[test]
fn bindgen_test_layout_osockaddr() {
    const UNINIT: ::std::mem::MaybeUninit<osockaddr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<osockaddr>(),
        16usize,
        concat!("Size of: ", stringify!(osockaddr))
    );
    assert_eq!(
        ::std::mem::align_of::<osockaddr>(),
        2usize,
        concat!("Alignment of ", stringify!(osockaddr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_family) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(osockaddr), "::", stringify!(sa_family))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_data) as usize - ptr as usize },
        2usize,
        concat!("Offset of field: ", stringify!(osockaddr), "::", stringify!(sa_data))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct omsghdr {
    pub msg_name: *mut ::std::os::raw::c_char,
    pub msg_namelen: ::std::os::raw::c_int,
    pub msg_iov: *mut iovec,
    pub msg_iovlen: ::std::os::raw::c_int,
    pub msg_accrights: *mut ::std::os::raw::c_char,
    pub msg_accrightslen: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_omsghdr() {
    const UNINIT: ::std::mem::MaybeUninit<omsghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<omsghdr>(),
        48usize,
        concat!("Size of: ", stringify!(omsghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<omsghdr>(),
        8usize,
        concat!("Alignment of ", stringify!(omsghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_name) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(omsghdr), "::", stringify!(msg_name))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_namelen) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(omsghdr), "::", stringify!(msg_namelen))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_iov) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(omsghdr), "::", stringify!(msg_iov))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_iovlen) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(omsghdr), "::", stringify!(msg_iovlen))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_accrights) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(omsghdr),
            "::",
            stringify!(msg_accrights)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_accrightslen) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(omsghdr),
            "::",
            stringify!(msg_accrightslen)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sf_hdtr {
    pub headers: *mut iovec,
    pub hdr_cnt: ::std::os::raw::c_int,
    pub trailers: *mut iovec,
    pub trl_cnt: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_sf_hdtr() {
    const UNINIT: ::std::mem::MaybeUninit<sf_hdtr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sf_hdtr>(),
        32usize,
        concat!("Size of: ", stringify!(sf_hdtr))
    );
    assert_eq!(
        ::std::mem::align_of::<sf_hdtr>(),
        8usize,
        concat!("Alignment of ", stringify!(sf_hdtr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).headers) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sf_hdtr), "::", stringify!(headers))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hdr_cnt) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(sf_hdtr), "::", stringify!(hdr_cnt))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trailers) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(sf_hdtr), "::", stringify!(trailers))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trl_cnt) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(sf_hdtr), "::", stringify!(trl_cnt))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mmsghdr {
    pub msg_hdr: msghdr,
    pub msg_len: isize,
}
#[test]
fn bindgen_test_layout_mmsghdr() {
    const UNINIT: ::std::mem::MaybeUninit<mmsghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mmsghdr>(),
        56usize,
        concat!("Size of: ", stringify!(mmsghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<mmsghdr>(),
        8usize,
        concat!("Alignment of ", stringify!(mmsghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_hdr) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(mmsghdr), "::", stringify!(msg_hdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_len) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(mmsghdr), "::", stringify!(msg_len))
    );
}
extern "C" {
    pub fn accept(arg1: ::std::os::raw::c_int, arg2: *mut sockaddr, arg3: *mut socklen_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bind(arg1: ::std::os::raw::c_int, arg2: *const sockaddr, arg3: socklen_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn connect(arg1: ::std::os::raw::c_int, arg2: *const sockaddr, arg3: socklen_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn accept4(
        arg1: ::std::os::raw::c_int,
        arg2: *mut sockaddr,
        arg3: *mut socklen_t,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bindat(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: *const sockaddr,
        arg4: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn connectat(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: *const sockaddr,
        arg4: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getpeername(arg1: ::std::os::raw::c_int, arg2: *mut sockaddr, arg3: *mut socklen_t)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsockname(arg1: ::std::os::raw::c_int, arg2: *mut sockaddr, arg3: *mut socklen_t)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsockopt(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_void,
        arg5: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn listen(arg1: ::std::os::raw::c_int, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn recv(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_void,
        arg3: usize,
        arg4: ::std::os::raw::c_int,
    ) -> isize;
}
extern "C" {
    pub fn recvfrom(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_void,
        arg3: usize,
        arg4: ::std::os::raw::c_int,
        arg5: *mut sockaddr,
        arg6: *mut socklen_t,
    ) -> isize;
}
extern "C" {
    pub fn recvmsg(arg1: ::std::os::raw::c_int, arg2: *mut msghdr, arg3: ::std::os::raw::c_int) -> isize;
}
extern "C" {
    pub fn recvmmsg(
        arg1: ::std::os::raw::c_int,
        arg2: *mut mmsghdr,
        arg3: usize,
        arg4: ::std::os::raw::c_int,
        arg5: *const timespec,
    ) -> isize;
}
extern "C" {
    pub fn send(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_void,
        arg3: usize,
        arg4: ::std::os::raw::c_int,
    ) -> isize;
}
extern "C" {
    pub fn sendto(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_void,
        arg3: usize,
        arg4: ::std::os::raw::c_int,
        arg5: *const sockaddr,
        arg6: socklen_t,
    ) -> isize;
}
extern "C" {
    pub fn sendmsg(arg1: ::std::os::raw::c_int, arg2: *const msghdr, arg3: ::std::os::raw::c_int) -> isize;
}
extern "C" {
    pub fn sendfile(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: off_t,
        arg4: usize,
        arg5: *mut sf_hdtr,
        arg6: *mut off_t,
        arg7: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sendmmsg(arg1: ::std::os::raw::c_int, arg2: *mut mmsghdr, arg3: usize, arg4: ::std::os::raw::c_int)
        -> isize;
}
extern "C" {
    pub fn setfib(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setsockopt(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_void,
        arg5: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn shutdown(arg1: ::std::os::raw::c_int, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sockatmark(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn socket(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn socketpair(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct if_clonereq {
    pub ifcr_total: ::std::os::raw::c_int,
    pub ifcr_count: ::std::os::raw::c_int,
    pub ifcr_buffer: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_if_clonereq() {
    const UNINIT: ::std::mem::MaybeUninit<if_clonereq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<if_clonereq>(),
        16usize,
        concat!("Size of: ", stringify!(if_clonereq))
    );
    assert_eq!(
        ::std::mem::align_of::<if_clonereq>(),
        8usize,
        concat!("Alignment of ", stringify!(if_clonereq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifcr_total) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(if_clonereq),
            "::",
            stringify!(ifcr_total)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifcr_count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(if_clonereq),
            "::",
            stringify!(ifcr_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifcr_buffer) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(if_clonereq),
            "::",
            stringify!(ifcr_buffer)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct if_data {
    pub ifi_type: u8,
    pub ifi_physical: u8,
    pub ifi_addrlen: u8,
    pub ifi_hdrlen: u8,
    pub ifi_link_state: u8,
    pub ifi_vhid: u8,
    pub ifi_datalen: u16,
    pub ifi_mtu: u32,
    pub ifi_metric: u32,
    pub ifi_baudrate: u64,
    pub ifi_ipackets: u64,
    pub ifi_ierrors: u64,
    pub ifi_opackets: u64,
    pub ifi_oerrors: u64,
    pub ifi_collisions: u64,
    pub ifi_ibytes: u64,
    pub ifi_obytes: u64,
    pub ifi_imcasts: u64,
    pub ifi_omcasts: u64,
    pub ifi_iqdrops: u64,
    pub ifi_oqdrops: u64,
    pub ifi_noproto: u64,
    pub ifi_hwassist: u64,
    pub __ifi_epoch: if_data__bindgen_ty_1,
    pub __ifi_lastchange: if_data__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union if_data__bindgen_ty_1 {
    pub tt: time_t,
    pub ph: u64,
}
#[test]
fn bindgen_test_layout_if_data__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<if_data__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<if_data__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(if_data__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<if_data__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(if_data__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(if_data__bindgen_ty_1),
            "::",
            stringify!(tt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ph) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(if_data__bindgen_ty_1),
            "::",
            stringify!(ph)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union if_data__bindgen_ty_2 {
    pub tv: timeval,
    pub ph: if_data__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct if_data__bindgen_ty_2__bindgen_ty_1 {
    pub ph1: u64,
    pub ph2: u64,
}
#[test]
fn bindgen_test_layout_if_data__bindgen_ty_2__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<if_data__bindgen_ty_2__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<if_data__bindgen_ty_2__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(if_data__bindgen_ty_2__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<if_data__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(if_data__bindgen_ty_2__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ph1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(if_data__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(ph1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ph2) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(if_data__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(ph2)
        )
    );
}
#[test]
fn bindgen_test_layout_if_data__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<if_data__bindgen_ty_2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<if_data__bindgen_ty_2>(),
        16usize,
        concat!("Size of: ", stringify!(if_data__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<if_data__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(if_data__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(if_data__bindgen_ty_2),
            "::",
            stringify!(tv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ph) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(if_data__bindgen_ty_2),
            "::",
            stringify!(ph)
        )
    );
}
#[test]
fn bindgen_test_layout_if_data() {
    const UNINIT: ::std::mem::MaybeUninit<if_data> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<if_data>(),
        152usize,
        concat!("Size of: ", stringify!(if_data))
    );
    assert_eq!(
        ::std::mem::align_of::<if_data>(),
        8usize,
        concat!("Alignment of ", stringify!(if_data))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_type) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_physical) as usize - ptr as usize },
        1usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_physical))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_addrlen) as usize - ptr as usize },
        2usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_addrlen))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_hdrlen) as usize - ptr as usize },
        3usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_hdrlen))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_link_state) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(if_data),
            "::",
            stringify!(ifi_link_state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_vhid) as usize - ptr as usize },
        5usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_vhid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_datalen) as usize - ptr as usize },
        6usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_datalen))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_mtu) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_mtu))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_metric) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_metric))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_baudrate) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_baudrate))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_ipackets) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_ipackets))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_ierrors) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_ierrors))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_opackets) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_opackets))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_oerrors) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_oerrors))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_collisions) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(if_data),
            "::",
            stringify!(ifi_collisions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_ibytes) as usize - ptr as usize },
        64usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_ibytes))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_obytes) as usize - ptr as usize },
        72usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_obytes))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_imcasts) as usize - ptr as usize },
        80usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_imcasts))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_omcasts) as usize - ptr as usize },
        88usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_omcasts))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_iqdrops) as usize - ptr as usize },
        96usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_iqdrops))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_oqdrops) as usize - ptr as usize },
        104usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_oqdrops))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_noproto) as usize - ptr as usize },
        112usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_noproto))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_hwassist) as usize - ptr as usize },
        120usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_hwassist))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ifi_epoch) as usize - ptr as usize },
        128usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(__ifi_epoch))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ifi_lastchange) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(if_data),
            "::",
            stringify!(__ifi_lastchange)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct if_msghdr {
    pub ifm_msglen: u_short,
    pub ifm_version: u_char,
    pub ifm_type: u_char,
    pub ifm_addrs: ::std::os::raw::c_int,
    pub ifm_flags: ::std::os::raw::c_int,
    pub ifm_index: u_short,
    pub _ifm_spare1: u_short,
    pub ifm_data: if_data,
}
#[test]
fn bindgen_test_layout_if_msghdr() {
    const UNINIT: ::std::mem::MaybeUninit<if_msghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<if_msghdr>(),
        168usize,
        concat!("Size of: ", stringify!(if_msghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<if_msghdr>(),
        8usize,
        concat!("Alignment of ", stringify!(if_msghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_msglen) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(if_msghdr), "::", stringify!(ifm_msglen))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_version) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(if_msghdr),
            "::",
            stringify!(ifm_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_type) as usize - ptr as usize },
        3usize,
        concat!("Offset of field: ", stringify!(if_msghdr), "::", stringify!(ifm_type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_addrs) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(if_msghdr), "::", stringify!(ifm_addrs))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_flags) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(if_msghdr), "::", stringify!(ifm_flags))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_index) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(if_msghdr), "::", stringify!(ifm_index))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ifm_spare1) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(if_msghdr),
            "::",
            stringify!(_ifm_spare1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_data) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(if_msghdr), "::", stringify!(ifm_data))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct if_msghdrl {
    pub ifm_msglen: u_short,
    pub ifm_version: u_char,
    pub ifm_type: u_char,
    pub ifm_addrs: ::std::os::raw::c_int,
    pub ifm_flags: ::std::os::raw::c_int,
    pub ifm_index: u_short,
    pub _ifm_spare1: u_short,
    pub ifm_len: u_short,
    pub ifm_data_off: u_short,
    pub _ifm_spare2: ::std::os::raw::c_int,
    pub ifm_data: if_data,
}
#[test]
fn bindgen_test_layout_if_msghdrl() {
    const UNINIT: ::std::mem::MaybeUninit<if_msghdrl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<if_msghdrl>(),
        176usize,
        concat!("Size of: ", stringify!(if_msghdrl))
    );
    assert_eq!(
        ::std::mem::align_of::<if_msghdrl>(),
        8usize,
        concat!("Alignment of ", stringify!(if_msghdrl))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_msglen) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(if_msghdrl),
            "::",
            stringify!(ifm_msglen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_version) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(if_msghdrl),
            "::",
            stringify!(ifm_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_type) as usize - ptr as usize },
        3usize,
        concat!("Offset of field: ", stringify!(if_msghdrl), "::", stringify!(ifm_type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_addrs) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(if_msghdrl), "::", stringify!(ifm_addrs))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_flags) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(if_msghdrl), "::", stringify!(ifm_flags))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_index) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(if_msghdrl), "::", stringify!(ifm_index))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ifm_spare1) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(if_msghdrl),
            "::",
            stringify!(_ifm_spare1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_len) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(if_msghdrl), "::", stringify!(ifm_len))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_data_off) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(if_msghdrl),
            "::",
            stringify!(ifm_data_off)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ifm_spare2) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(if_msghdrl),
            "::",
            stringify!(_ifm_spare2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_data) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(if_msghdrl), "::", stringify!(ifm_data))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifa_msghdr {
    pub ifam_msglen: u_short,
    pub ifam_version: u_char,
    pub ifam_type: u_char,
    pub ifam_addrs: ::std::os::raw::c_int,
    pub ifam_flags: ::std::os::raw::c_int,
    pub ifam_index: u_short,
    pub _ifam_spare1: u_short,
    pub ifam_metric: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ifa_msghdr() {
    const UNINIT: ::std::mem::MaybeUninit<ifa_msghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifa_msghdr>(),
        20usize,
        concat!("Size of: ", stringify!(ifa_msghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<ifa_msghdr>(),
        4usize,
        concat!("Alignment of ", stringify!(ifa_msghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_msglen) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_msghdr),
            "::",
            stringify!(ifam_msglen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_version) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_msghdr),
            "::",
            stringify!(ifam_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_type) as usize - ptr as usize },
        3usize,
        concat!("Offset of field: ", stringify!(ifa_msghdr), "::", stringify!(ifam_type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_addrs) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_msghdr),
            "::",
            stringify!(ifam_addrs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_msghdr),
            "::",
            stringify!(ifam_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_index) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_msghdr),
            "::",
            stringify!(ifam_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ifam_spare1) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_msghdr),
            "::",
            stringify!(_ifam_spare1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_metric) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_msghdr),
            "::",
            stringify!(ifam_metric)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ifa_msghdrl {
    pub ifam_msglen: u_short,
    pub ifam_version: u_char,
    pub ifam_type: u_char,
    pub ifam_addrs: ::std::os::raw::c_int,
    pub ifam_flags: ::std::os::raw::c_int,
    pub ifam_index: u_short,
    pub _ifam_spare1: u_short,
    pub ifam_len: u_short,
    pub ifam_data_off: u_short,
    pub ifam_metric: ::std::os::raw::c_int,
    pub ifam_data: if_data,
}
#[test]
fn bindgen_test_layout_ifa_msghdrl() {
    const UNINIT: ::std::mem::MaybeUninit<ifa_msghdrl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifa_msghdrl>(),
        176usize,
        concat!("Size of: ", stringify!(ifa_msghdrl))
    );
    assert_eq!(
        ::std::mem::align_of::<ifa_msghdrl>(),
        8usize,
        concat!("Alignment of ", stringify!(ifa_msghdrl))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_msglen) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_msghdrl),
            "::",
            stringify!(ifam_msglen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_version) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_msghdrl),
            "::",
            stringify!(ifam_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_type) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_msghdrl),
            "::",
            stringify!(ifam_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_addrs) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_msghdrl),
            "::",
            stringify!(ifam_addrs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_msghdrl),
            "::",
            stringify!(ifam_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_index) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_msghdrl),
            "::",
            stringify!(ifam_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ifam_spare1) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_msghdrl),
            "::",
            stringify!(_ifam_spare1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_len) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(ifa_msghdrl), "::", stringify!(ifam_len))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_data_off) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_msghdrl),
            "::",
            stringify!(ifam_data_off)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_metric) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_msghdrl),
            "::",
            stringify!(ifam_metric)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_data) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_msghdrl),
            "::",
            stringify!(ifam_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifma_msghdr {
    pub ifmam_msglen: u_short,
    pub ifmam_version: u_char,
    pub ifmam_type: u_char,
    pub ifmam_addrs: ::std::os::raw::c_int,
    pub ifmam_flags: ::std::os::raw::c_int,
    pub ifmam_index: u_short,
    pub _ifmam_spare1: u_short,
}
#[test]
fn bindgen_test_layout_ifma_msghdr() {
    const UNINIT: ::std::mem::MaybeUninit<ifma_msghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifma_msghdr>(),
        16usize,
        concat!("Size of: ", stringify!(ifma_msghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<ifma_msghdr>(),
        4usize,
        concat!("Alignment of ", stringify!(ifma_msghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifmam_msglen) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifma_msghdr),
            "::",
            stringify!(ifmam_msglen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifmam_version) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ifma_msghdr),
            "::",
            stringify!(ifmam_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifmam_type) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(ifma_msghdr),
            "::",
            stringify!(ifmam_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifmam_addrs) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ifma_msghdr),
            "::",
            stringify!(ifmam_addrs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifmam_flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ifma_msghdr),
            "::",
            stringify!(ifmam_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifmam_index) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ifma_msghdr),
            "::",
            stringify!(ifmam_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ifmam_spare1) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(ifma_msghdr),
            "::",
            stringify!(_ifmam_spare1)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct if_announcemsghdr {
    pub ifan_msglen: u_short,
    pub ifan_version: u_char,
    pub ifan_type: u_char,
    pub ifan_index: u_short,
    pub ifan_name: [::std::os::raw::c_char; 16usize],
    pub ifan_what: u_short,
}
#[test]
fn bindgen_test_layout_if_announcemsghdr() {
    const UNINIT: ::std::mem::MaybeUninit<if_announcemsghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<if_announcemsghdr>(),
        24usize,
        concat!("Size of: ", stringify!(if_announcemsghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<if_announcemsghdr>(),
        2usize,
        concat!("Alignment of ", stringify!(if_announcemsghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifan_msglen) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(if_announcemsghdr),
            "::",
            stringify!(ifan_msglen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifan_version) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(if_announcemsghdr),
            "::",
            stringify!(ifan_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifan_type) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(if_announcemsghdr),
            "::",
            stringify!(ifan_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifan_index) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(if_announcemsghdr),
            "::",
            stringify!(ifan_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifan_name) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(if_announcemsghdr),
            "::",
            stringify!(ifan_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifan_what) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(if_announcemsghdr),
            "::",
            stringify!(ifan_what)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifreq_buffer {
    pub length: usize,
    pub buffer: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ifreq_buffer() {
    const UNINIT: ::std::mem::MaybeUninit<ifreq_buffer> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifreq_buffer>(),
        16usize,
        concat!("Size of: ", stringify!(ifreq_buffer))
    );
    assert_eq!(
        ::std::mem::align_of::<ifreq_buffer>(),
        8usize,
        concat!("Alignment of ", stringify!(ifreq_buffer))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ifreq_buffer), "::", stringify!(length))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(ifreq_buffer), "::", stringify!(buffer))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifreq_nv_req {
    pub buf_length: u_int,
    pub length: u_int,
    pub buffer: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ifreq_nv_req() {
    const UNINIT: ::std::mem::MaybeUninit<ifreq_nv_req> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifreq_nv_req>(),
        16usize,
        concat!("Size of: ", stringify!(ifreq_nv_req))
    );
    assert_eq!(
        ::std::mem::align_of::<ifreq_nv_req>(),
        8usize,
        concat!("Alignment of ", stringify!(ifreq_nv_req))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buf_length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq_nv_req),
            "::",
            stringify!(buf_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(ifreq_nv_req), "::", stringify!(length))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(ifreq_nv_req), "::", stringify!(buffer))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ifreq {
    pub ifr_name: [::std::os::raw::c_char; 16usize],
    pub ifr_ifru: ifreq__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ifreq__bindgen_ty_1 {
    pub ifru_addr: sockaddr,
    pub ifru_dstaddr: sockaddr,
    pub ifru_broadaddr: sockaddr,
    pub ifru_buffer: ifreq_buffer,
    pub ifru_flags: [::std::os::raw::c_short; 2usize],
    pub ifru_index: ::std::os::raw::c_short,
    pub ifru_jid: ::std::os::raw::c_int,
    pub ifru_metric: ::std::os::raw::c_int,
    pub ifru_mtu: ::std::os::raw::c_int,
    pub ifru_phys: ::std::os::raw::c_int,
    pub ifru_media: ::std::os::raw::c_int,
    pub ifru_data: caddr_t,
    pub ifru_cap: [::std::os::raw::c_int; 2usize],
    pub ifru_fib: u_int,
    pub ifru_vlan_pcp: u_char,
    pub ifru_nv: ifreq_nv_req,
}
#[test]
fn bindgen_test_layout_ifreq__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ifreq__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifreq__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(ifreq__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ifreq__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(ifreq__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifru_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq__bindgen_ty_1),
            "::",
            stringify!(ifru_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifru_dstaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq__bindgen_ty_1),
            "::",
            stringify!(ifru_dstaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifru_broadaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq__bindgen_ty_1),
            "::",
            stringify!(ifru_broadaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifru_buffer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq__bindgen_ty_1),
            "::",
            stringify!(ifru_buffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifru_flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq__bindgen_ty_1),
            "::",
            stringify!(ifru_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifru_index) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq__bindgen_ty_1),
            "::",
            stringify!(ifru_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifru_jid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq__bindgen_ty_1),
            "::",
            stringify!(ifru_jid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifru_metric) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq__bindgen_ty_1),
            "::",
            stringify!(ifru_metric)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifru_mtu) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq__bindgen_ty_1),
            "::",
            stringify!(ifru_mtu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifru_phys) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq__bindgen_ty_1),
            "::",
            stringify!(ifru_phys)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifru_media) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq__bindgen_ty_1),
            "::",
            stringify!(ifru_media)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifru_data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq__bindgen_ty_1),
            "::",
            stringify!(ifru_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifru_cap) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq__bindgen_ty_1),
            "::",
            stringify!(ifru_cap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifru_fib) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq__bindgen_ty_1),
            "::",
            stringify!(ifru_fib)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifru_vlan_pcp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq__bindgen_ty_1),
            "::",
            stringify!(ifru_vlan_pcp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifru_nv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq__bindgen_ty_1),
            "::",
            stringify!(ifru_nv)
        )
    );
}
#[test]
fn bindgen_test_layout_ifreq() {
    const UNINIT: ::std::mem::MaybeUninit<ifreq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifreq>(),
        32usize,
        concat!("Size of: ", stringify!(ifreq))
    );
    assert_eq!(
        ::std::mem::align_of::<ifreq>(),
        8usize,
        concat!("Alignment of ", stringify!(ifreq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifr_name) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ifreq), "::", stringify!(ifr_name))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifr_ifru) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(ifreq), "::", stringify!(ifr_ifru))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifaliasreq {
    pub ifra_name: [::std::os::raw::c_char; 16usize],
    pub ifra_addr: sockaddr,
    pub ifra_broadaddr: sockaddr,
    pub ifra_mask: sockaddr,
    pub ifra_vhid: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ifaliasreq() {
    const UNINIT: ::std::mem::MaybeUninit<ifaliasreq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifaliasreq>(),
        68usize,
        concat!("Size of: ", stringify!(ifaliasreq))
    );
    assert_eq!(
        ::std::mem::align_of::<ifaliasreq>(),
        4usize,
        concat!("Alignment of ", stringify!(ifaliasreq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifra_name) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ifaliasreq), "::", stringify!(ifra_name))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifra_addr) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(ifaliasreq), "::", stringify!(ifra_addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifra_broadaddr) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaliasreq),
            "::",
            stringify!(ifra_broadaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifra_mask) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(ifaliasreq), "::", stringify!(ifra_mask))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifra_vhid) as usize - ptr as usize },
        64usize,
        concat!("Offset of field: ", stringify!(ifaliasreq), "::", stringify!(ifra_vhid))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct oifaliasreq {
    pub ifra_name: [::std::os::raw::c_char; 16usize],
    pub ifra_addr: sockaddr,
    pub ifra_broadaddr: sockaddr,
    pub ifra_mask: sockaddr,
}
#[test]
fn bindgen_test_layout_oifaliasreq() {
    const UNINIT: ::std::mem::MaybeUninit<oifaliasreq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<oifaliasreq>(),
        64usize,
        concat!("Size of: ", stringify!(oifaliasreq))
    );
    assert_eq!(
        ::std::mem::align_of::<oifaliasreq>(),
        1usize,
        concat!("Alignment of ", stringify!(oifaliasreq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifra_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(oifaliasreq),
            "::",
            stringify!(ifra_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifra_addr) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(oifaliasreq),
            "::",
            stringify!(ifra_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifra_broadaddr) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(oifaliasreq),
            "::",
            stringify!(ifra_broadaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifra_mask) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(oifaliasreq),
            "::",
            stringify!(ifra_mask)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifmediareq {
    pub ifm_name: [::std::os::raw::c_char; 16usize],
    pub ifm_current: ::std::os::raw::c_int,
    pub ifm_mask: ::std::os::raw::c_int,
    pub ifm_status: ::std::os::raw::c_int,
    pub ifm_active: ::std::os::raw::c_int,
    pub ifm_count: ::std::os::raw::c_int,
    pub ifm_ulist: *mut ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ifmediareq() {
    const UNINIT: ::std::mem::MaybeUninit<ifmediareq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifmediareq>(),
        48usize,
        concat!("Size of: ", stringify!(ifmediareq))
    );
    assert_eq!(
        ::std::mem::align_of::<ifmediareq>(),
        8usize,
        concat!("Alignment of ", stringify!(ifmediareq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_name) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ifmediareq), "::", stringify!(ifm_name))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_current) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ifmediareq),
            "::",
            stringify!(ifm_current)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_mask) as usize - ptr as usize },
        20usize,
        concat!("Offset of field: ", stringify!(ifmediareq), "::", stringify!(ifm_mask))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_status) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ifmediareq),
            "::",
            stringify!(ifm_status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_active) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ifmediareq),
            "::",
            stringify!(ifm_active)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_count) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(ifmediareq), "::", stringify!(ifm_count))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_ulist) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(ifmediareq), "::", stringify!(ifm_ulist))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifdrv {
    pub ifd_name: [::std::os::raw::c_char; 16usize],
    pub ifd_cmd: ::std::os::raw::c_ulong,
    pub ifd_len: usize,
    pub ifd_data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ifdrv() {
    const UNINIT: ::std::mem::MaybeUninit<ifdrv> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifdrv>(),
        40usize,
        concat!("Size of: ", stringify!(ifdrv))
    );
    assert_eq!(
        ::std::mem::align_of::<ifdrv>(),
        8usize,
        concat!("Alignment of ", stringify!(ifdrv))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifd_name) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ifdrv), "::", stringify!(ifd_name))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifd_cmd) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(ifdrv), "::", stringify!(ifd_cmd))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifd_len) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(ifdrv), "::", stringify!(ifd_len))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifd_data) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(ifdrv), "::", stringify!(ifd_data))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifstat {
    pub ifs_name: [::std::os::raw::c_char; 16usize],
    pub ascii: [::std::os::raw::c_char; 801usize],
}
#[test]
fn bindgen_test_layout_ifstat() {
    const UNINIT: ::std::mem::MaybeUninit<ifstat> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifstat>(),
        817usize,
        concat!("Size of: ", stringify!(ifstat))
    );
    assert_eq!(
        ::std::mem::align_of::<ifstat>(),
        1usize,
        concat!("Alignment of ", stringify!(ifstat))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifs_name) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ifstat), "::", stringify!(ifs_name))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ascii) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(ifstat), "::", stringify!(ascii))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ifconf {
    pub ifc_len: ::std::os::raw::c_int,
    pub ifc_ifcu: ifconf__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ifconf__bindgen_ty_1 {
    pub ifcu_buf: caddr_t,
    pub ifcu_req: *mut ifreq,
}
#[test]
fn bindgen_test_layout_ifconf__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ifconf__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifconf__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(ifconf__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ifconf__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(ifconf__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifcu_buf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifconf__bindgen_ty_1),
            "::",
            stringify!(ifcu_buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifcu_req) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifconf__bindgen_ty_1),
            "::",
            stringify!(ifcu_req)
        )
    );
}
#[test]
fn bindgen_test_layout_ifconf() {
    const UNINIT: ::std::mem::MaybeUninit<ifconf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifconf>(),
        16usize,
        concat!("Size of: ", stringify!(ifconf))
    );
    assert_eq!(
        ::std::mem::align_of::<ifconf>(),
        8usize,
        concat!("Alignment of ", stringify!(ifconf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifc_len) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ifconf), "::", stringify!(ifc_len))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifc_ifcu) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(ifconf), "::", stringify!(ifc_ifcu))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ifg_req {
    pub ifgrq_ifgrqu: ifg_req__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ifg_req__bindgen_ty_1 {
    pub ifgrqu_group: [::std::os::raw::c_char; 16usize],
    pub ifgrqu_member: [::std::os::raw::c_char; 16usize],
}
#[test]
fn bindgen_test_layout_ifg_req__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ifg_req__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifg_req__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(ifg_req__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ifg_req__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(ifg_req__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifgrqu_group) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifg_req__bindgen_ty_1),
            "::",
            stringify!(ifgrqu_group)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifgrqu_member) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifg_req__bindgen_ty_1),
            "::",
            stringify!(ifgrqu_member)
        )
    );
}
#[test]
fn bindgen_test_layout_ifg_req() {
    const UNINIT: ::std::mem::MaybeUninit<ifg_req> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifg_req>(),
        16usize,
        concat!("Size of: ", stringify!(ifg_req))
    );
    assert_eq!(
        ::std::mem::align_of::<ifg_req>(),
        1usize,
        concat!("Alignment of ", stringify!(ifg_req))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifgrq_ifgrqu) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ifg_req), "::", stringify!(ifgrq_ifgrqu))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ifgroupreq {
    pub ifgr_name: [::std::os::raw::c_char; 16usize],
    pub ifgr_len: u_int,
    pub ifgr_ifgru: ifgroupreq__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ifgroupreq__bindgen_ty_1 {
    pub ifgru_group: [::std::os::raw::c_char; 16usize],
    pub ifgru_groups: *mut ifg_req,
}
#[test]
fn bindgen_test_layout_ifgroupreq__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ifgroupreq__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifgroupreq__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(ifgroupreq__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ifgroupreq__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(ifgroupreq__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifgru_group) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifgroupreq__bindgen_ty_1),
            "::",
            stringify!(ifgru_group)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifgru_groups) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifgroupreq__bindgen_ty_1),
            "::",
            stringify!(ifgru_groups)
        )
    );
}
#[test]
fn bindgen_test_layout_ifgroupreq() {
    const UNINIT: ::std::mem::MaybeUninit<ifgroupreq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifgroupreq>(),
        40usize,
        concat!("Size of: ", stringify!(ifgroupreq))
    );
    assert_eq!(
        ::std::mem::align_of::<ifgroupreq>(),
        8usize,
        concat!("Alignment of ", stringify!(ifgroupreq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifgr_name) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ifgroupreq), "::", stringify!(ifgr_name))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifgr_len) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(ifgroupreq), "::", stringify!(ifgr_len))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifgr_ifgru) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ifgroupreq),
            "::",
            stringify!(ifgr_ifgru)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifi2creq {
    pub dev_addr: u8,
    pub offset: u8,
    pub len: u8,
    pub spare0: u8,
    pub spare1: u32,
    pub data: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_ifi2creq() {
    const UNINIT: ::std::mem::MaybeUninit<ifi2creq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifi2creq>(),
        16usize,
        concat!("Size of: ", stringify!(ifi2creq))
    );
    assert_eq!(
        ::std::mem::align_of::<ifi2creq>(),
        4usize,
        concat!("Alignment of ", stringify!(ifi2creq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dev_addr) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ifi2creq), "::", stringify!(dev_addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        1usize,
        concat!("Offset of field: ", stringify!(ifi2creq), "::", stringify!(offset))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        2usize,
        concat!("Offset of field: ", stringify!(ifi2creq), "::", stringify!(len))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).spare0) as usize - ptr as usize },
        3usize,
        concat!("Offset of field: ", stringify!(ifi2creq), "::", stringify!(spare0))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).spare1) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(ifi2creq), "::", stringify!(spare1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(ifi2creq), "::", stringify!(data))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifrsskey {
    pub ifrk_name: [::std::os::raw::c_char; 16usize],
    pub ifrk_func: u8,
    pub ifrk_spare0: u8,
    pub ifrk_keylen: u16,
    pub ifrk_key: [u8; 128usize],
}
#[test]
fn bindgen_test_layout_ifrsskey() {
    const UNINIT: ::std::mem::MaybeUninit<ifrsskey> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifrsskey>(),
        148usize,
        concat!("Size of: ", stringify!(ifrsskey))
    );
    assert_eq!(
        ::std::mem::align_of::<ifrsskey>(),
        2usize,
        concat!("Alignment of ", stringify!(ifrsskey))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifrk_name) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ifrsskey), "::", stringify!(ifrk_name))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifrk_func) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(ifrsskey), "::", stringify!(ifrk_func))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifrk_spare0) as usize - ptr as usize },
        17usize,
        concat!("Offset of field: ", stringify!(ifrsskey), "::", stringify!(ifrk_spare0))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifrk_keylen) as usize - ptr as usize },
        18usize,
        concat!("Offset of field: ", stringify!(ifrsskey), "::", stringify!(ifrk_keylen))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifrk_key) as usize - ptr as usize },
        20usize,
        concat!("Offset of field: ", stringify!(ifrsskey), "::", stringify!(ifrk_key))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifrsshash {
    pub ifrh_name: [::std::os::raw::c_char; 16usize],
    pub ifrh_func: u8,
    pub ifrh_spare0: u8,
    pub ifrh_spare1: u16,
    pub ifrh_types: u32,
}
#[test]
fn bindgen_test_layout_ifrsshash() {
    const UNINIT: ::std::mem::MaybeUninit<ifrsshash> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifrsshash>(),
        24usize,
        concat!("Size of: ", stringify!(ifrsshash))
    );
    assert_eq!(
        ::std::mem::align_of::<ifrsshash>(),
        4usize,
        concat!("Alignment of ", stringify!(ifrsshash))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifrh_name) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ifrsshash), "::", stringify!(ifrh_name))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifrh_func) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(ifrsshash), "::", stringify!(ifrh_func))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifrh_spare0) as usize - ptr as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(ifrsshash),
            "::",
            stringify!(ifrh_spare0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifrh_spare1) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(ifrsshash),
            "::",
            stringify!(ifrh_spare1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifrh_types) as usize - ptr as usize },
        20usize,
        concat!("Offset of field: ", stringify!(ifrsshash), "::", stringify!(ifrh_types))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifdownreason {
    pub ifdr_name: [::std::os::raw::c_char; 16usize],
    pub ifdr_reason: u32,
    pub ifdr_vendor: u32,
    pub ifdr_msg: [::std::os::raw::c_char; 64usize],
}
#[test]
fn bindgen_test_layout_ifdownreason() {
    const UNINIT: ::std::mem::MaybeUninit<ifdownreason> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifdownreason>(),
        88usize,
        concat!("Size of: ", stringify!(ifdownreason))
    );
    assert_eq!(
        ::std::mem::align_of::<ifdownreason>(),
        4usize,
        concat!("Alignment of ", stringify!(ifdownreason))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifdr_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifdownreason),
            "::",
            stringify!(ifdr_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifdr_reason) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ifdownreason),
            "::",
            stringify!(ifdr_reason)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifdr_vendor) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ifdownreason),
            "::",
            stringify!(ifdr_vendor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifdr_msg) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ifdownreason),
            "::",
            stringify!(ifdr_msg)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifnet {
    _unused: [u8; 0],
}
pub type if_t = *mut ifnet;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct if_nameindex {
    pub if_index: ::std::os::raw::c_uint,
    pub if_name: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_if_nameindex() {
    const UNINIT: ::std::mem::MaybeUninit<if_nameindex> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<if_nameindex>(),
        16usize,
        concat!("Size of: ", stringify!(if_nameindex))
    );
    assert_eq!(
        ::std::mem::align_of::<if_nameindex>(),
        8usize,
        concat!("Alignment of ", stringify!(if_nameindex))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).if_index) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(if_nameindex),
            "::",
            stringify!(if_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).if_name) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(if_nameindex), "::", stringify!(if_name))
    );
}
extern "C" {
    pub fn if_freenameindex(arg1: *mut if_nameindex);
}
extern "C" {
    pub fn if_indextoname(
        arg1: ::std::os::raw::c_uint,
        arg2: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn if_nameindex() -> *mut if_nameindex;
}
extern "C" {
    pub fn if_nametoindex(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_uint;
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ether_header {
    pub ether_dhost: [u_char; 6usize],
    pub ether_shost: [u_char; 6usize],
    pub ether_type: u_short,
}
#[test]
fn bindgen_test_layout_ether_header() {
    const UNINIT: ::std::mem::MaybeUninit<ether_header> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ether_header>(),
        14usize,
        concat!("Size of: ", stringify!(ether_header))
    );
    assert_eq!(
        ::std::mem::align_of::<ether_header>(),
        1usize,
        concat!("Alignment of ", stringify!(ether_header))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ether_dhost) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ether_header),
            "::",
            stringify!(ether_dhost)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ether_shost) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(ether_header),
            "::",
            stringify!(ether_shost)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ether_type) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ether_header),
            "::",
            stringify!(ether_type)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ether_addr {
    pub octet: [u_char; 6usize],
}
#[test]
fn bindgen_test_layout_ether_addr() {
    const UNINIT: ::std::mem::MaybeUninit<ether_addr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ether_addr>(),
        6usize,
        concat!("Size of: ", stringify!(ether_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<ether_addr>(),
        1usize,
        concat!("Alignment of ", stringify!(ether_addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).octet) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ether_addr), "::", stringify!(octet))
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ether_vlan_header {
    pub evl_dhost: [u8; 6usize],
    pub evl_shost: [u8; 6usize],
    pub evl_encap_proto: u16,
    pub evl_tag: u16,
    pub evl_proto: u16,
}
#[test]
fn bindgen_test_layout_ether_vlan_header() {
    const UNINIT: ::std::mem::MaybeUninit<ether_vlan_header> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ether_vlan_header>(),
        18usize,
        concat!("Size of: ", stringify!(ether_vlan_header))
    );
    assert_eq!(
        ::std::mem::align_of::<ether_vlan_header>(),
        1usize,
        concat!("Alignment of ", stringify!(ether_vlan_header))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).evl_dhost) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ether_vlan_header),
            "::",
            stringify!(evl_dhost)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).evl_shost) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(ether_vlan_header),
            "::",
            stringify!(evl_shost)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).evl_encap_proto) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ether_vlan_header),
            "::",
            stringify!(evl_encap_proto)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).evl_tag) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(ether_vlan_header),
            "::",
            stringify!(evl_tag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).evl_proto) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ether_vlan_header),
            "::",
            stringify!(evl_proto)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mbuf {
    _unused: [u8; 0],
}
extern "C" {
    pub fn ether_bpf_mtap_if(ifp: *mut ifnet, m: *mut mbuf);
}
extern "C" {
    pub fn ether_aton(arg1: *const ::std::os::raw::c_char) -> *mut ether_addr;
}
extern "C" {
    pub fn ether_aton_r(arg1: *const ::std::os::raw::c_char, arg2: *mut ether_addr) -> *mut ether_addr;
}
extern "C" {
    pub fn ether_hostton(arg1: *const ::std::os::raw::c_char, arg2: *mut ether_addr) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ether_line(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut ether_addr,
        arg3: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ether_ntoa(arg1: *const ether_addr) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ether_ntoa_r(arg1: *const ether_addr, arg2: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ether_ntohost(arg1: *mut ::std::os::raw::c_char, arg2: *const ether_addr) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct radix_node {
    pub rn_mklist: *mut radix_mask,
    pub rn_parent: *mut radix_node,
    pub rn_bit: ::std::os::raw::c_short,
    pub rn_bmask: ::std::os::raw::c_char,
    pub rn_flags: u_char,
    pub rn_u: radix_node__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union radix_node__bindgen_ty_1 {
    pub rn_leaf: radix_node__bindgen_ty_1__bindgen_ty_1,
    pub rn_node: radix_node__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct radix_node__bindgen_ty_1__bindgen_ty_1 {
    pub rn_Key: caddr_t,
    pub rn_Mask: caddr_t,
    pub rn_Dupedkey: *mut radix_node,
}
#[test]
fn bindgen_test_layout_radix_node__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<radix_node__bindgen_ty_1__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<radix_node__bindgen_ty_1__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(radix_node__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<radix_node__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(radix_node__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_Key) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(rn_Key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_Mask) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(rn_Mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_Dupedkey) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(rn_Dupedkey)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct radix_node__bindgen_ty_1__bindgen_ty_2 {
    pub rn_Off: ::std::os::raw::c_int,
    pub rn_L: *mut radix_node,
    pub rn_R: *mut radix_node,
}
#[test]
fn bindgen_test_layout_radix_node__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<radix_node__bindgen_ty_1__bindgen_ty_2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<radix_node__bindgen_ty_1__bindgen_ty_2>(),
        24usize,
        concat!("Size of: ", stringify!(radix_node__bindgen_ty_1__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<radix_node__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(radix_node__bindgen_ty_1__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_Off) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(rn_Off)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_L) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(rn_L)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_R) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(rn_R)
        )
    );
}
#[test]
fn bindgen_test_layout_radix_node__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<radix_node__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<radix_node__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(radix_node__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<radix_node__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(radix_node__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_leaf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node__bindgen_ty_1),
            "::",
            stringify!(rn_leaf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_node) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node__bindgen_ty_1),
            "::",
            stringify!(rn_node)
        )
    );
}
#[test]
fn bindgen_test_layout_radix_node() {
    const UNINIT: ::std::mem::MaybeUninit<radix_node> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<radix_node>(),
        48usize,
        concat!("Size of: ", stringify!(radix_node))
    );
    assert_eq!(
        ::std::mem::align_of::<radix_node>(),
        8usize,
        concat!("Alignment of ", stringify!(radix_node))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_mklist) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(radix_node), "::", stringify!(rn_mklist))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_parent) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(radix_node), "::", stringify!(rn_parent))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_bit) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(radix_node), "::", stringify!(rn_bit))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_bmask) as usize - ptr as usize },
        18usize,
        concat!("Offset of field: ", stringify!(radix_node), "::", stringify!(rn_bmask))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_flags) as usize - ptr as usize },
        19usize,
        concat!("Offset of field: ", stringify!(radix_node), "::", stringify!(rn_flags))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_u) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(radix_node), "::", stringify!(rn_u))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct radix_mask {
    pub rm_bit: ::std::os::raw::c_short,
    pub rm_unused: ::std::os::raw::c_char,
    pub rm_flags: u_char,
    pub rm_mklist: *mut radix_mask,
    pub rm_rmu: radix_mask__bindgen_ty_1,
    pub rm_refs: ::std::os::raw::c_int,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union radix_mask__bindgen_ty_1 {
    pub rmu_mask: caddr_t,
    pub rmu_leaf: *mut radix_node,
}
#[test]
fn bindgen_test_layout_radix_mask__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<radix_mask__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<radix_mask__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(radix_mask__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<radix_mask__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(radix_mask__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rmu_mask) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_mask__bindgen_ty_1),
            "::",
            stringify!(rmu_mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rmu_leaf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_mask__bindgen_ty_1),
            "::",
            stringify!(rmu_leaf)
        )
    );
}
#[test]
fn bindgen_test_layout_radix_mask() {
    const UNINIT: ::std::mem::MaybeUninit<radix_mask> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<radix_mask>(),
        32usize,
        concat!("Size of: ", stringify!(radix_mask))
    );
    assert_eq!(
        ::std::mem::align_of::<radix_mask>(),
        8usize,
        concat!("Alignment of ", stringify!(radix_mask))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rm_bit) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(radix_mask), "::", stringify!(rm_bit))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rm_unused) as usize - ptr as usize },
        2usize,
        concat!("Offset of field: ", stringify!(radix_mask), "::", stringify!(rm_unused))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rm_flags) as usize - ptr as usize },
        3usize,
        concat!("Offset of field: ", stringify!(radix_mask), "::", stringify!(rm_flags))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rm_mklist) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(radix_mask), "::", stringify!(rm_mklist))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rm_rmu) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(radix_mask), "::", stringify!(rm_rmu))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rm_refs) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(radix_mask), "::", stringify!(rm_refs))
    );
}
pub type walktree_f_t = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut radix_node, arg2: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
pub type rn_matchaddr_f_t = ::std::option::Option<
    unsafe extern "C" fn(v: *const ::std::os::raw::c_void, head: *mut radix_head) -> *mut radix_node,
>;
pub type rn_addaddr_f_t = ::std::option::Option<
    unsafe extern "C" fn(
        v: *mut ::std::os::raw::c_void,
        mask: *const ::std::os::raw::c_void,
        head: *mut radix_head,
        nodes: *mut radix_node,
    ) -> *mut radix_node,
>;
pub type rn_deladdr_f_t = ::std::option::Option<
    unsafe extern "C" fn(
        v: *const ::std::os::raw::c_void,
        mask: *const ::std::os::raw::c_void,
        head: *mut radix_head,
    ) -> *mut radix_node,
>;
pub type rn_lookup_f_t = ::std::option::Option<
    unsafe extern "C" fn(
        v: *const ::std::os::raw::c_void,
        mask: *const ::std::os::raw::c_void,
        head: *mut radix_head,
    ) -> *mut radix_node,
>;
pub type rn_walktree_t = ::std::option::Option<
    unsafe extern "C" fn(
        head: *mut radix_head,
        f: walktree_f_t,
        w: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type rn_walktree_from_t = ::std::option::Option<
    unsafe extern "C" fn(
        head: *mut radix_head,
        a: *mut ::std::os::raw::c_void,
        m: *mut ::std::os::raw::c_void,
        f: walktree_f_t,
        w: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type rn_close_t = ::std::option::Option<unsafe extern "C" fn(rn: *mut radix_node, head: *mut radix_head)>;
extern "C" {
    pub fn rn_nextprefix(rn: *mut radix_node) -> *mut radix_node;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct radix_head {
    pub rnh_treetop: *mut radix_node,
    pub rnh_masks: *mut radix_mask_head,
}
#[test]
fn bindgen_test_layout_radix_head() {
    const UNINIT: ::std::mem::MaybeUninit<radix_head> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<radix_head>(),
        16usize,
        concat!("Size of: ", stringify!(radix_head))
    );
    assert_eq!(
        ::std::mem::align_of::<radix_head>(),
        8usize,
        concat!("Alignment of ", stringify!(radix_head))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rnh_treetop) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_head),
            "::",
            stringify!(rnh_treetop)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rnh_masks) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(radix_head), "::", stringify!(rnh_masks))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct radix_node_head {
    pub rh: radix_head,
    pub rnh_matchaddr: rn_matchaddr_f_t,
    pub rnh_addaddr: rn_addaddr_f_t,
    pub rnh_deladdr: rn_deladdr_f_t,
    pub rnh_lookup: rn_lookup_f_t,
    pub rnh_walktree: rn_walktree_t,
    pub rnh_walktree_from: rn_walktree_from_t,
    pub rnh_close: rn_close_t,
    pub rnh_nodes: [radix_node; 3usize],
}
#[test]
fn bindgen_test_layout_radix_node_head() {
    const UNINIT: ::std::mem::MaybeUninit<radix_node_head> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<radix_node_head>(),
        216usize,
        concat!("Size of: ", stringify!(radix_node_head))
    );
    assert_eq!(
        ::std::mem::align_of::<radix_node_head>(),
        8usize,
        concat!("Alignment of ", stringify!(radix_node_head))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rh) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(radix_node_head), "::", stringify!(rh))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rnh_matchaddr) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node_head),
            "::",
            stringify!(rnh_matchaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rnh_addaddr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node_head),
            "::",
            stringify!(rnh_addaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rnh_deladdr) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node_head),
            "::",
            stringify!(rnh_deladdr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rnh_lookup) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node_head),
            "::",
            stringify!(rnh_lookup)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rnh_walktree) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node_head),
            "::",
            stringify!(rnh_walktree)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rnh_walktree_from) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node_head),
            "::",
            stringify!(rnh_walktree_from)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rnh_close) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node_head),
            "::",
            stringify!(rnh_close)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rnh_nodes) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node_head),
            "::",
            stringify!(rnh_nodes)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct radix_mask_head {
    pub head: radix_head,
    pub mask_nodes: [radix_node; 3usize],
}
#[test]
fn bindgen_test_layout_radix_mask_head() {
    const UNINIT: ::std::mem::MaybeUninit<radix_mask_head> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<radix_mask_head>(),
        160usize,
        concat!("Size of: ", stringify!(radix_mask_head))
    );
    assert_eq!(
        ::std::mem::align_of::<radix_mask_head>(),
        8usize,
        concat!("Alignment of ", stringify!(radix_mask_head))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).head) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(radix_mask_head), "::", stringify!(head))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mask_nodes) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_mask_head),
            "::",
            stringify!(mask_nodes)
        )
    );
}
extern "C" {
    pub fn rn_inithead_internal(rh: *mut radix_head, base_nodes: *mut radix_node, off: ::std::os::raw::c_int);
}
extern "C" {
    pub fn rn_inithead(arg1: *mut *mut ::std::os::raw::c_void, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rn_detachhead(arg1: *mut *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rn_refines(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rn_addroute(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: *mut radix_head,
        arg4: *mut radix_node,
    ) -> *mut radix_node;
}
extern "C" {
    pub fn rn_delete(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: *mut radix_head,
    ) -> *mut radix_node;
}
extern "C" {
    pub fn rn_lookup(
        v_arg: *const ::std::os::raw::c_void,
        m_arg: *const ::std::os::raw::c_void,
        head: *mut radix_head,
    ) -> *mut radix_node;
}
extern "C" {
    pub fn rn_match(arg1: *const ::std::os::raw::c_void, arg2: *mut radix_head) -> *mut radix_node;
}
extern "C" {
    pub fn rn_walktree_from(
        h: *mut radix_head,
        a: *mut ::std::os::raw::c_void,
        m: *mut ::std::os::raw::c_void,
        f: walktree_f_t,
        w: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rn_walktree(
        arg1: *mut radix_head,
        arg2: walktree_f_t,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_addr {
    pub s_addr: in_addr_t,
}
#[test]
fn bindgen_test_layout_in_addr() {
    const UNINIT: ::std::mem::MaybeUninit<in_addr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<in_addr>(),
        4usize,
        concat!("Size of: ", stringify!(in_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<in_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(in_addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s_addr) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(in_addr), "::", stringify!(s_addr))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_in {
    pub sin_len: u8,
    pub sin_family: sa_family_t,
    pub sin_port: in_port_t,
    pub sin_addr: in_addr,
    pub sin_zero: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout_sockaddr_in() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr_in> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr_in>(),
        16usize,
        concat!("Size of: ", stringify!(sockaddr_in))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_in>(),
        4usize,
        concat!("Alignment of ", stringify!(sockaddr_in))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin_len) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sockaddr_in), "::", stringify!(sin_len))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin_family) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin_port) as usize - ptr as usize },
        2usize,
        concat!("Offset of field: ", stringify!(sockaddr_in), "::", stringify!(sin_port))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin_addr) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(sockaddr_in), "::", stringify!(sin_addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin_zero) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(sockaddr_in), "::", stringify!(sin_zero))
    );
}
extern "C" {
    pub fn htonl(arg1: u32) -> u32;
}
extern "C" {
    pub fn htons(arg1: u16) -> u16;
}
extern "C" {
    pub fn ntohl(arg1: u32) -> u32;
}
extern "C" {
    pub fn ntohs(arg1: u16) -> u16;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreq {
    pub imr_multiaddr: in_addr,
    pub imr_interface: in_addr,
}
#[test]
fn bindgen_test_layout_ip_mreq() {
    const UNINIT: ::std::mem::MaybeUninit<ip_mreq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ip_mreq>(),
        8usize,
        concat!("Size of: ", stringify!(ip_mreq))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_mreq>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_mreq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imr_multiaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq),
            "::",
            stringify!(imr_multiaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imr_interface) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq),
            "::",
            stringify!(imr_interface)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreqn {
    pub imr_multiaddr: in_addr,
    pub imr_address: in_addr,
    pub imr_ifindex: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ip_mreqn() {
    const UNINIT: ::std::mem::MaybeUninit<ip_mreqn> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ip_mreqn>(),
        12usize,
        concat!("Size of: ", stringify!(ip_mreqn))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_mreqn>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_mreqn))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imr_multiaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreqn),
            "::",
            stringify!(imr_multiaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imr_address) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(ip_mreqn), "::", stringify!(imr_address))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imr_ifindex) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(ip_mreqn), "::", stringify!(imr_ifindex))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreq_source {
    pub imr_multiaddr: in_addr,
    pub imr_sourceaddr: in_addr,
    pub imr_interface: in_addr,
}
#[test]
fn bindgen_test_layout_ip_mreq_source() {
    const UNINIT: ::std::mem::MaybeUninit<ip_mreq_source> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ip_mreq_source>(),
        12usize,
        concat!("Size of: ", stringify!(ip_mreq_source))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_mreq_source>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_mreq_source))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imr_multiaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq_source),
            "::",
            stringify!(imr_multiaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imr_sourceaddr) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq_source),
            "::",
            stringify!(imr_sourceaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imr_interface) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq_source),
            "::",
            stringify!(imr_interface)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct group_req {
    pub gr_interface: u32,
    pub gr_group: sockaddr_storage,
}
#[test]
fn bindgen_test_layout_group_req() {
    const UNINIT: ::std::mem::MaybeUninit<group_req> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<group_req>(),
        136usize,
        concat!("Size of: ", stringify!(group_req))
    );
    assert_eq!(
        ::std::mem::align_of::<group_req>(),
        8usize,
        concat!("Alignment of ", stringify!(group_req))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gr_interface) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(group_req),
            "::",
            stringify!(gr_interface)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gr_group) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(group_req), "::", stringify!(gr_group))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct group_source_req {
    pub gsr_interface: u32,
    pub gsr_group: sockaddr_storage,
    pub gsr_source: sockaddr_storage,
}
#[test]
fn bindgen_test_layout_group_source_req() {
    const UNINIT: ::std::mem::MaybeUninit<group_source_req> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<group_source_req>(),
        264usize,
        concat!("Size of: ", stringify!(group_source_req))
    );
    assert_eq!(
        ::std::mem::align_of::<group_source_req>(),
        8usize,
        concat!("Alignment of ", stringify!(group_source_req))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gsr_interface) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(group_source_req),
            "::",
            stringify!(gsr_interface)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gsr_group) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(group_source_req),
            "::",
            stringify!(gsr_group)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gsr_source) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(group_source_req),
            "::",
            stringify!(gsr_source)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __msfilterreq {
    pub msfr_ifindex: u32,
    pub msfr_fmode: u32,
    pub msfr_nsrcs: u32,
    pub msfr_group: sockaddr_storage,
    pub msfr_srcs: *mut sockaddr_storage,
}
#[test]
fn bindgen_test_layout___msfilterreq() {
    const UNINIT: ::std::mem::MaybeUninit<__msfilterreq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__msfilterreq>(),
        152usize,
        concat!("Size of: ", stringify!(__msfilterreq))
    );
    assert_eq!(
        ::std::mem::align_of::<__msfilterreq>(),
        8usize,
        concat!("Alignment of ", stringify!(__msfilterreq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msfr_ifindex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__msfilterreq),
            "::",
            stringify!(msfr_ifindex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msfr_fmode) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__msfilterreq),
            "::",
            stringify!(msfr_fmode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msfr_nsrcs) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__msfilterreq),
            "::",
            stringify!(msfr_nsrcs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msfr_group) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__msfilterreq),
            "::",
            stringify!(msfr_group)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msfr_srcs) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(__msfilterreq),
            "::",
            stringify!(msfr_srcs)
        )
    );
}
extern "C" {
    pub fn setipv4sourcefilter(
        arg1: ::std::os::raw::c_int,
        arg2: in_addr,
        arg3: in_addr,
        arg4: u32,
        arg5: u32,
        arg6: *mut in_addr,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getipv4sourcefilter(
        arg1: ::std::os::raw::c_int,
        arg2: in_addr,
        arg3: in_addr,
        arg4: *mut u32,
        arg5: *mut u32,
        arg6: *mut in_addr,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setsourcefilter(
        arg1: ::std::os::raw::c_int,
        arg2: u32,
        arg3: *mut sockaddr,
        arg4: socklen_t,
        arg5: u32,
        arg6: u32,
        arg7: *mut sockaddr_storage,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsourcefilter(
        arg1: ::std::os::raw::c_int,
        arg2: u32,
        arg3: *mut sockaddr,
        arg4: socklen_t,
        arg5: *mut u32,
        arg6: *mut u32,
        arg7: *mut sockaddr_storage,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in6_addr {
    pub __u6_addr: in6_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union in6_addr__bindgen_ty_1 {
    pub __u6_addr8: [u8; 16usize],
    pub __u6_addr16: [u16; 8usize],
    pub __u6_addr32: [u32; 4usize],
}
#[test]
fn bindgen_test_layout_in6_addr__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<in6_addr__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<in6_addr__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(in6_addr__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<in6_addr__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_addr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__u6_addr8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__u6_addr16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__u6_addr32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr32)
        )
    );
}
#[test]
fn bindgen_test_layout_in6_addr() {
    const UNINIT: ::std::mem::MaybeUninit<in6_addr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<in6_addr>(),
        16usize,
        concat!("Size of: ", stringify!(in6_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<in6_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__u6_addr) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(in6_addr), "::", stringify!(__u6_addr))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sockaddr_in6 {
    pub sin6_len: u8,
    pub sin6_family: sa_family_t,
    pub sin6_port: in_port_t,
    pub sin6_flowinfo: u32,
    pub sin6_addr: in6_addr,
    pub sin6_scope_id: u32,
}
#[test]
fn bindgen_test_layout_sockaddr_in6() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr_in6> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr_in6>(),
        28usize,
        concat!("Size of: ", stringify!(sockaddr_in6))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_in6>(),
        4usize,
        concat!("Alignment of ", stringify!(sockaddr_in6))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin6_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin6_family) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin6_port) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_port)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin6_flowinfo) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_flowinfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin6_addr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin6_scope_id) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_scope_id)
        )
    );
}
extern "C" {
    pub static in6addr_any: in6_addr;
}
extern "C" {
    pub static in6addr_loopback: in6_addr;
}
extern "C" {
    pub static in6addr_nodelocal_allnodes: in6_addr;
}
extern "C" {
    pub static in6addr_linklocal_allnodes: in6_addr;
}
extern "C" {
    pub static in6addr_linklocal_allrouters: in6_addr;
}
extern "C" {
    pub static in6addr_linklocal_allv2routers: in6_addr;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nhop_object {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct route_in6 {
    pub ro_nh: *mut nhop_object,
    pub ro_lle: *mut llentry,
    pub ro_prepend: *mut ::std::os::raw::c_char,
    pub ro_plen: u16,
    pub ro_flags: u16,
    pub ro_mtu: u16,
    pub spare: u16,
    pub ro_dst: sockaddr_in6,
}
#[test]
fn bindgen_test_layout_route_in6() {
    const UNINIT: ::std::mem::MaybeUninit<route_in6> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<route_in6>(),
        64usize,
        concat!("Size of: ", stringify!(route_in6))
    );
    assert_eq!(
        ::std::mem::align_of::<route_in6>(),
        8usize,
        concat!("Alignment of ", stringify!(route_in6))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ro_nh) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(route_in6), "::", stringify!(ro_nh))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ro_lle) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(route_in6), "::", stringify!(ro_lle))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ro_prepend) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(route_in6), "::", stringify!(ro_prepend))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ro_plen) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(route_in6), "::", stringify!(ro_plen))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ro_flags) as usize - ptr as usize },
        26usize,
        concat!("Offset of field: ", stringify!(route_in6), "::", stringify!(ro_flags))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ro_mtu) as usize - ptr as usize },
        28usize,
        concat!("Offset of field: ", stringify!(route_in6), "::", stringify!(ro_mtu))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).spare) as usize - ptr as usize },
        30usize,
        concat!("Offset of field: ", stringify!(route_in6), "::", stringify!(spare))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ro_dst) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(route_in6), "::", stringify!(ro_dst))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ipv6_mreq {
    pub ipv6mr_multiaddr: in6_addr,
    pub ipv6mr_interface: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_ipv6_mreq() {
    const UNINIT: ::std::mem::MaybeUninit<ipv6_mreq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ipv6_mreq>(),
        20usize,
        concat!("Size of: ", stringify!(ipv6_mreq))
    );
    assert_eq!(
        ::std::mem::align_of::<ipv6_mreq>(),
        4usize,
        concat!("Alignment of ", stringify!(ipv6_mreq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ipv6mr_multiaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ipv6_mreq),
            "::",
            stringify!(ipv6mr_multiaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ipv6mr_interface) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ipv6_mreq),
            "::",
            stringify!(ipv6mr_interface)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in6_pktinfo {
    pub ipi6_addr: in6_addr,
    pub ipi6_ifindex: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_in6_pktinfo() {
    const UNINIT: ::std::mem::MaybeUninit<in6_pktinfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<in6_pktinfo>(),
        20usize,
        concat!("Size of: ", stringify!(in6_pktinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<in6_pktinfo>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_pktinfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ipi6_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_pktinfo),
            "::",
            stringify!(ipi6_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ipi6_ifindex) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_pktinfo),
            "::",
            stringify!(ipi6_ifindex)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ip6_mtuinfo {
    pub ip6m_addr: sockaddr_in6,
    pub ip6m_mtu: u32,
}
#[test]
fn bindgen_test_layout_ip6_mtuinfo() {
    const UNINIT: ::std::mem::MaybeUninit<ip6_mtuinfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ip6_mtuinfo>(),
        32usize,
        concat!("Size of: ", stringify!(ip6_mtuinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<ip6_mtuinfo>(),
        4usize,
        concat!("Alignment of ", stringify!(ip6_mtuinfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ip6m_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip6_mtuinfo),
            "::",
            stringify!(ip6m_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ip6m_mtu) as usize - ptr as usize },
        28usize,
        concat!("Offset of field: ", stringify!(ip6_mtuinfo), "::", stringify!(ip6m_mtu))
    );
}
extern "C" {
    pub fn inet6_option_space(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_option_init(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut *mut cmsghdr,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_option_append(
        arg1: *mut cmsghdr,
        arg2: *const u8,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_option_alloc(
        arg1: *mut cmsghdr,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
    ) -> *mut u8;
}
extern "C" {
    pub fn inet6_option_next(arg1: *const cmsghdr, arg2: *mut *mut u8) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_option_find(
        arg1: *const cmsghdr,
        arg2: *mut *mut u8,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_rthdr_space(arg1: ::std::os::raw::c_int, arg2: ::std::os::raw::c_int) -> usize;
}
extern "C" {
    pub fn inet6_rthdr_init(arg1: *mut ::std::os::raw::c_void, arg2: ::std::os::raw::c_int) -> *mut cmsghdr;
}
extern "C" {
    pub fn inet6_rthdr_add(
        arg1: *mut cmsghdr,
        arg2: *const in6_addr,
        arg3: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_rthdr_lasthop(arg1: *mut cmsghdr, arg2: ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_rthdr_segments(arg1: *const cmsghdr) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_rthdr_getaddr(arg1: *mut cmsghdr, arg2: ::std::os::raw::c_int) -> *mut in6_addr;
}
extern "C" {
    pub fn inet6_rthdr_getflags(arg1: *const cmsghdr, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_opt_init(arg1: *mut ::std::os::raw::c_void, arg2: socklen_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_opt_append(
        arg1: *mut ::std::os::raw::c_void,
        arg2: socklen_t,
        arg3: ::std::os::raw::c_int,
        arg4: u8,
        arg5: socklen_t,
        arg6: u8,
        arg7: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_opt_finish(
        arg1: *mut ::std::os::raw::c_void,
        arg2: socklen_t,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_opt_set_val(
        arg1: *mut ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_void,
        arg4: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_opt_next(
        arg1: *mut ::std::os::raw::c_void,
        arg2: socklen_t,
        arg3: ::std::os::raw::c_int,
        arg4: *mut u8,
        arg5: *mut socklen_t,
        arg6: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_opt_find(
        arg1: *mut ::std::os::raw::c_void,
        arg2: socklen_t,
        arg3: ::std::os::raw::c_int,
        arg4: u8,
        arg5: *mut socklen_t,
        arg6: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_opt_get_val(
        arg1: *mut ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_void,
        arg4: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_rth_space(arg1: ::std::os::raw::c_int, arg2: ::std::os::raw::c_int) -> socklen_t;
}
extern "C" {
    pub fn inet6_rth_init(
        arg1: *mut ::std::os::raw::c_void,
        arg2: socklen_t,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn inet6_rth_add(arg1: *mut ::std::os::raw::c_void, arg2: *const in6_addr) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_rth_reverse(
        arg1: *const ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_rth_segments(arg1: *const ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_rth_getaddr(arg1: *const ::std::os::raw::c_void, arg2: ::std::os::raw::c_int) -> *mut in6_addr;
}
pub const PF_INOUT: _bindgen_ty_1 = 0;
pub const PF_IN: _bindgen_ty_1 = 1;
pub const PF_OUT: _bindgen_ty_1 = 2;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
pub const PF_PASS: _bindgen_ty_2 = 0;
pub const PF_DROP: _bindgen_ty_2 = 1;
pub const PF_SCRUB: _bindgen_ty_2 = 2;
pub const PF_NOSCRUB: _bindgen_ty_2 = 3;
pub const PF_NAT: _bindgen_ty_2 = 4;
pub const PF_NONAT: _bindgen_ty_2 = 5;
pub const PF_BINAT: _bindgen_ty_2 = 6;
pub const PF_NOBINAT: _bindgen_ty_2 = 7;
pub const PF_RDR: _bindgen_ty_2 = 8;
pub const PF_NORDR: _bindgen_ty_2 = 9;
pub const PF_SYNPROXY_DROP: _bindgen_ty_2 = 10;
pub const PF_DEFER: _bindgen_ty_2 = 11;
pub const PF_MATCH: _bindgen_ty_2 = 12;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
pub const PF_RULESET_SCRUB: _bindgen_ty_3 = 0;
pub const PF_RULESET_FILTER: _bindgen_ty_3 = 1;
pub const PF_RULESET_NAT: _bindgen_ty_3 = 2;
pub const PF_RULESET_BINAT: _bindgen_ty_3 = 3;
pub const PF_RULESET_RDR: _bindgen_ty_3 = 4;
pub const PF_RULESET_MAX: _bindgen_ty_3 = 5;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
pub const PF_OP_NONE: _bindgen_ty_4 = 0;
pub const PF_OP_IRG: _bindgen_ty_4 = 1;
pub const PF_OP_EQ: _bindgen_ty_4 = 2;
pub const PF_OP_NE: _bindgen_ty_4 = 3;
pub const PF_OP_LT: _bindgen_ty_4 = 4;
pub const PF_OP_LE: _bindgen_ty_4 = 5;
pub const PF_OP_GT: _bindgen_ty_4 = 6;
pub const PF_OP_GE: _bindgen_ty_4 = 7;
pub const PF_OP_XRG: _bindgen_ty_4 = 8;
pub const PF_OP_RRG: _bindgen_ty_4 = 9;
pub type _bindgen_ty_4 = ::std::os::raw::c_uint;
pub const PF_DEBUG_NONE: _bindgen_ty_5 = 0;
pub const PF_DEBUG_URGENT: _bindgen_ty_5 = 1;
pub const PF_DEBUG_MISC: _bindgen_ty_5 = 2;
pub const PF_DEBUG_NOISY: _bindgen_ty_5 = 3;
pub type _bindgen_ty_5 = ::std::os::raw::c_uint;
pub const PF_CHANGE_NONE: _bindgen_ty_6 = 0;
pub const PF_CHANGE_ADD_HEAD: _bindgen_ty_6 = 1;
pub const PF_CHANGE_ADD_TAIL: _bindgen_ty_6 = 2;
pub const PF_CHANGE_ADD_BEFORE: _bindgen_ty_6 = 3;
pub const PF_CHANGE_ADD_AFTER: _bindgen_ty_6 = 4;
pub const PF_CHANGE_REMOVE: _bindgen_ty_6 = 5;
pub const PF_CHANGE_GET_TICKET: _bindgen_ty_6 = 6;
pub type _bindgen_ty_6 = ::std::os::raw::c_uint;
pub const PF_GET_NONE: _bindgen_ty_7 = 0;
