// automatically generated by rust-bindgen 0.69.4

pub const __ISO_C_VISIBLE: u32 = 2011;
pub const __XPG_VISIBLE: u32 = 700;
pub const __POSIX_VISIBLE: u32 = 200809;
pub const __BSD_VISIBLE: u32 = 1;
pub const _STACKALIGNBYTES: u32 = 15;
pub const _MAX_PAGE_SHIFT: u32 = 12;
pub const INT8_MIN: i32 = -128;
pub const INT16_MIN: i32 = -32768;
pub const INT32_MIN: i32 = -2147483648;
pub const INT64_MIN: i64 = -9223372036854775808;
pub const INT8_MAX: u32 = 127;
pub const INT16_MAX: u32 = 32767;
pub const INT32_MAX: u32 = 2147483647;
pub const INT64_MAX: u64 = 9223372036854775807;
pub const UINT8_MAX: u32 = 255;
pub const UINT16_MAX: u32 = 65535;
pub const UINT32_MAX: u32 = 4294967295;
pub const UINT64_MAX: i32 = -1;
pub const INT_LEAST8_MIN: i32 = -128;
pub const INT_LEAST16_MIN: i32 = -32768;
pub const INT_LEAST32_MIN: i32 = -2147483648;
pub const INT_LEAST64_MIN: i64 = -9223372036854775808;
pub const INT_LEAST8_MAX: u32 = 127;
pub const INT_LEAST16_MAX: u32 = 32767;
pub const INT_LEAST32_MAX: u32 = 2147483647;
pub const INT_LEAST64_MAX: u64 = 9223372036854775807;
pub const UINT_LEAST8_MAX: u32 = 255;
pub const UINT_LEAST16_MAX: u32 = 65535;
pub const UINT_LEAST32_MAX: u32 = 4294967295;
pub const UINT_LEAST64_MAX: i32 = -1;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const UINTPTR_MAX: i32 = -1;
pub const INTMAX_MIN: i64 = -9223372036854775808;
pub const INTMAX_MAX: u64 = 9223372036854775807;

pub type __int_fast64_t = __int64_t;
pub type __uint_fast64_t = __uint64_t;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __uintptr_t = ::std::os::raw::c_ulong;
pub type __intmax_t = __int64_t;
pub type __uintmax_t = __uint64_t;
pub type __register_t = ::std::os::raw::c_long;
pub type __vaddr_t = ::std::os::raw::c_ulong;
pub type __paddr_t = ::std::os::raw::c_ulong;
pub type __vsize_t = ::std::os::raw::c_ulong;
pub type __psize_t = ::std::os::raw::c_ulong;
pub type __double_t = f64;
pub type __float_t = f32;
pub type __ptrdiff_t = ::std::os::raw::c_long;
pub type __size_t = ::std::os::raw::c_ulong;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __va_list = __builtin_va_list;
pub type __wchar_t = ::std::os::raw::c_int;
pub type __wint_t = ::std::os::raw::c_int;
pub type __rune_t = ::std::os::raw::c_int;
pub type __wctrans_t = *mut ::std::os::raw::c_void;
pub type __wctype_t = *mut ::std::os::raw::c_void;
pub type int_least8_t = __int_least8_t;
pub type uint_least8_t = __uint_least8_t;
pub type int_least16_t = __int_least16_t;
pub type uint_least16_t = __uint_least16_t;
pub type int_least32_t = __int_least32_t;
pub type uint_least32_t = __uint_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = __int_fast8_t;
pub type uint_fast8_t = __uint_fast8_t;
pub type int_fast16_t = __int_fast16_t;
pub type uint_fast16_t = __uint_fast16_t;
pub type int_fast32_t = __int_fast32_t;
pub type uint_fast32_t = __uint_fast32_t;
pub type int_fast64_t = __int_fast64_t;
pub type uint_fast64_t = __uint_fast64_t;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type __blkcnt_t = __int64_t;
pub type __blksize_t = __int32_t;
pub type __clock_t = __int64_t;
pub type __clockid_t = __int32_t;
pub type __cpuid_t = ::std::os::raw::c_ulong;
pub type __dev_t = __int32_t;
pub type __fixpt_t = __uint32_t;
pub type __fsblkcnt_t = __uint64_t;
pub type __fsfilcnt_t = __uint64_t;
pub type __gid_t = __uint32_t;
pub type __id_t = __uint32_t;
pub type __in_addr_t = __uint32_t;
pub type __in_port_t = __uint16_t;
pub type __ino_t = __uint64_t;
pub type __key_t = ::std::os::raw::c_long;
pub type __mode_t = __uint32_t;
pub type __nlink_t = __uint32_t;
pub type __off_t = __int64_t;
pub type __pid_t = __int32_t;
pub type __rlim_t = __uint64_t;
pub type __sa_family_t = __uint8_t;
pub type __segsz_t = __int32_t;
pub type __socklen_t = __uint32_t;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __time_t = __int64_t;
pub type __timer_t = __int32_t;
pub type __uid_t = __uint32_t;
pub type __useconds_t = __uint32_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
    pub __mbstate8: [::std::os::raw::c_char; 128usize],
    pub __mbstateL: __int64_t,
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        128usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__mbstate8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__mbstate8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__mbstateL) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__mbstateL)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: usize,
}
#[test]
fn bindgen_test_layout_iovec() {
    const UNINIT: ::std::mem::MaybeUninit<iovec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iovec>(),
        16usize,
        concat!("Size of: ", stringify!(iovec))
    );
    assert_eq!(
        ::std::mem::align_of::<iovec>(),
        8usize,
        concat!("Alignment of ", stringify!(iovec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iov_base) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(iovec), "::", stringify!(iov_base))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iov_len) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(iovec), "::", stringify!(iov_len))
    );
}
pub const uio_rw_UIO_READ: uio_rw = 0;
pub const uio_rw_UIO_WRITE: uio_rw = 1;
pub type uio_rw = ::std::os::raw::c_uint;
pub const uio_seg_UIO_USERSPACE: uio_seg = 0;
pub const uio_seg_UIO_SYSSPACE: uio_seg = 1;
pub type uio_seg = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn preadv(arg1: ::std::os::raw::c_int, arg2: *const iovec, arg3: ::std::os::raw::c_int, arg4: __off_t)
    -> isize;
}
unsafe extern "C" {
    pub fn pwritev(
        arg1: ::std::os::raw::c_int,
        arg2: *const iovec,
        arg3: ::std::os::raw::c_int,
        arg4: __off_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn readv(arg1: ::std::os::raw::c_int, arg2: *const iovec, arg3: ::std::os::raw::c_int) -> isize;
}
unsafe extern "C" {
    pub fn writev(arg1: ::std::os::raw::c_int, arg2: *const iovec, arg3: ::std::os::raw::c_int) -> isize;
}
pub type u_char = ::std::os::raw::c_uchar;
pub type u_short = ::std::os::raw::c_ushort;
pub type u_int = ::std::os::raw::c_uint;
pub type u_long = ::std::os::raw::c_ulong;
pub type unchar = ::std::os::raw::c_uchar;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type ulong = ::std::os::raw::c_ulong;
pub type cpuid_t = __cpuid_t;
pub type register_t = __register_t;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type quad_t = __int64_t;
pub type u_quad_t = __uint64_t;
pub type vaddr_t = __vaddr_t;
pub type paddr_t = __paddr_t;
pub type vsize_t = __vsize_t;
pub type psize_t = __psize_t;
pub type blkcnt_t = __blkcnt_t;
pub type blksize_t = __blksize_t;
pub type caddr_t = *mut ::std::os::raw::c_char;
pub type daddr32_t = __int32_t;
pub type daddr_t = __int64_t;
pub type dev_t = __dev_t;
pub type fixpt_t = __fixpt_t;
pub type gid_t = __gid_t;
pub type id_t = __id_t;
pub type ino_t = __ino_t;
pub type key_t = __key_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type rlim_t = __rlim_t;
pub type segsz_t = __segsz_t;
pub type uid_t = __uid_t;
pub type useconds_t = __useconds_t;
pub type suseconds_t = __suseconds_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type pid_t = __pid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type off_t = __off_t;
unsafe extern "C" {
    pub fn lseek(arg1: ::std::os::raw::c_int, arg2: off_t, arg3: ::std::os::raw::c_int) -> off_t;
}
unsafe extern "C" {
    pub fn ftruncate(arg1: ::std::os::raw::c_int, arg2: off_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn truncate(arg1: *const ::std::os::raw::c_char, arg2: off_t) -> ::std::os::raw::c_int;
}
pub type socklen_t = __socklen_t;
pub type sa_family_t = __sa_family_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct linger {
    pub l_onoff: ::std::os::raw::c_int,
    pub l_linger: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_linger() {
    const UNINIT: ::std::mem::MaybeUninit<linger> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<linger>(),
        8usize,
        concat!("Size of: ", stringify!(linger))
    );
    assert_eq!(
        ::std::mem::align_of::<linger>(),
        4usize,
        concat!("Alignment of ", stringify!(linger))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_onoff) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(linger), "::", stringify!(l_onoff))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_linger) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(linger), "::", stringify!(l_linger))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: time_t,
    pub tv_usec: suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    const UNINIT: ::std::mem::MaybeUninit<timeval> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(timeval), "::", stringify!(tv_sec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_usec) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(timeval), "::", stringify!(tv_usec))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct splice {
    pub sp_fd: ::std::os::raw::c_int,
    pub sp_max: off_t,
    pub sp_idle: timeval,
}
#[test]
fn bindgen_test_layout_splice() {
    const UNINIT: ::std::mem::MaybeUninit<splice> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<splice>(),
        32usize,
        concat!("Size of: ", stringify!(splice))
    );
    assert_eq!(
        ::std::mem::align_of::<splice>(),
        8usize,
        concat!("Alignment of ", stringify!(splice))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sp_fd) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(splice), "::", stringify!(sp_fd))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sp_max) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(splice), "::", stringify!(sp_max))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sp_idle) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(splice), "::", stringify!(sp_idle))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr {
    pub sa_len: __uint8_t,
    pub sa_family: sa_family_t,
    pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[test]
fn bindgen_test_layout_sockaddr() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr>(),
        16usize,
        concat!("Size of: ", stringify!(sockaddr))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr>(),
        1usize,
        concat!("Alignment of ", stringify!(sockaddr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_len) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sockaddr), "::", stringify!(sa_len))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_family) as usize - ptr as usize },
        1usize,
        concat!("Offset of field: ", stringify!(sockaddr), "::", stringify!(sa_family))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_data) as usize - ptr as usize },
        2usize,
        concat!("Offset of field: ", stringify!(sockaddr), "::", stringify!(sa_data))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_storage {
    pub ss_len: __uint8_t,
    pub ss_family: sa_family_t,
    pub __ss_pad1: [::std::os::raw::c_uchar; 6usize],
    pub __ss_pad2: __uint64_t,
    pub __ss_pad3: [::std::os::raw::c_uchar; 240usize],
}
#[test]
fn bindgen_test_layout_sockaddr_storage() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr_storage> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr_storage>(),
        256usize,
        concat!("Size of: ", stringify!(sockaddr_storage))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_storage>(),
        8usize,
        concat!("Alignment of ", stringify!(sockaddr_storage))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ss_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(ss_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ss_family) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(ss_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ss_pad1) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(__ss_pad1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ss_pad2) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(__ss_pad2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ss_pad3) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(__ss_pad3)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockpeercred {
    pub uid: uid_t,
    pub gid: gid_t,
    pub pid: pid_t,
}
#[test]
fn bindgen_test_layout_sockpeercred() {
    const UNINIT: ::std::mem::MaybeUninit<sockpeercred> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockpeercred>(),
        12usize,
        concat!("Size of: ", stringify!(sockpeercred))
    );
    assert_eq!(
        ::std::mem::align_of::<sockpeercred>(),
        4usize,
        concat!("Alignment of ", stringify!(sockpeercred))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uid) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sockpeercred), "::", stringify!(uid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gid) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(sockpeercred), "::", stringify!(gid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pid) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(sockpeercred), "::", stringify!(pid))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msghdr {
    pub msg_name: *mut ::std::os::raw::c_void,
    pub msg_namelen: socklen_t,
    pub msg_iov: *mut iovec,
    pub msg_iovlen: ::std::os::raw::c_uint,
    pub msg_control: *mut ::std::os::raw::c_void,
    pub msg_controllen: socklen_t,
    pub msg_flags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_msghdr() {
    const UNINIT: ::std::mem::MaybeUninit<msghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<msghdr>(),
        48usize,
        concat!("Size of: ", stringify!(msghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<msghdr>(),
        8usize,
        concat!("Alignment of ", stringify!(msghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_name) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(msghdr), "::", stringify!(msg_name))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_namelen) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(msghdr), "::", stringify!(msg_namelen))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_iov) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(msghdr), "::", stringify!(msg_iov))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_iovlen) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(msghdr), "::", stringify!(msg_iovlen))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_control) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(msghdr), "::", stringify!(msg_control))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_controllen) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_controllen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_flags) as usize - ptr as usize },
        44usize,
        concat!("Offset of field: ", stringify!(msghdr), "::", stringify!(msg_flags))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mmsghdr {
    pub msg_hdr: msghdr,
    pub msg_len: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_mmsghdr() {
    const UNINIT: ::std::mem::MaybeUninit<mmsghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mmsghdr>(),
        56usize,
        concat!("Size of: ", stringify!(mmsghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<mmsghdr>(),
        8usize,
        concat!("Alignment of ", stringify!(mmsghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_hdr) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(mmsghdr), "::", stringify!(msg_hdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_len) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(mmsghdr), "::", stringify!(msg_len))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cmsghdr {
    pub cmsg_len: socklen_t,
    pub cmsg_level: ::std::os::raw::c_int,
    pub cmsg_type: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_cmsghdr() {
    const UNINIT: ::std::mem::MaybeUninit<cmsghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cmsghdr>(),
        12usize,
        concat!("Size of: ", stringify!(cmsghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<cmsghdr>(),
        4usize,
        concat!("Alignment of ", stringify!(cmsghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmsg_len) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(cmsghdr), "::", stringify!(cmsg_len))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmsg_level) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(cmsghdr), "::", stringify!(cmsg_level))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmsg_type) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(cmsghdr), "::", stringify!(cmsg_type))
    );
}
unsafe extern "C" {
    pub fn accept(arg1: ::std::os::raw::c_int, arg2: *mut sockaddr, arg3: *mut socklen_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn bind(arg1: ::std::os::raw::c_int, arg2: *const sockaddr, arg3: socklen_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn connect(arg1: ::std::os::raw::c_int, arg2: *const sockaddr, arg3: socklen_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getpeername(arg1: ::std::os::raw::c_int, arg2: *mut sockaddr, arg3: *mut socklen_t)
    -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getsockname(arg1: ::std::os::raw::c_int, arg2: *mut sockaddr, arg3: *mut socklen_t)
    -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getsockopt(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_void,
        arg5: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn listen(arg1: ::std::os::raw::c_int, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn recv(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_void,
        arg3: usize,
        arg4: ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn recvfrom(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_void,
        arg3: usize,
        arg4: ::std::os::raw::c_int,
        arg5: *mut sockaddr,
        arg6: *mut socklen_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn recvmsg(arg1: ::std::os::raw::c_int, arg2: *mut msghdr, arg3: ::std::os::raw::c_int) -> isize;
}
unsafe extern "C" {
    pub fn recvmmsg(
        arg1: ::std::os::raw::c_int,
        arg2: *mut mmsghdr,
        arg3: ::std::os::raw::c_uint,
        arg4: ::std::os::raw::c_int,
        arg5: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn send(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_void,
        arg3: usize,
        arg4: ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn sendto(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_void,
        arg3: usize,
        arg4: ::std::os::raw::c_int,
        arg5: *const sockaddr,
        arg6: socklen_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn sendmsg(arg1: ::std::os::raw::c_int, arg2: *const msghdr, arg3: ::std::os::raw::c_int) -> isize;
}
unsafe extern "C" {
    pub fn sendmmsg(
        arg1: ::std::os::raw::c_int,
        arg2: *mut mmsghdr,
        arg3: ::std::os::raw::c_uint,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setsockopt(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_void,
        arg5: socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn shutdown(arg1: ::std::os::raw::c_int, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sockatmark(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn socket(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn socketpair(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn accept4(
        arg1: ::std::os::raw::c_int,
        arg2: *mut sockaddr,
        arg3: *mut socklen_t,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getpeereid(arg1: ::std::os::raw::c_int, arg2: *mut uid_t, arg3: *mut gid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getrtable() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setrtable(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct if_nameindex {
    pub if_index: ::std::os::raw::c_uint,
    pub if_name: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_if_nameindex() {
    const UNINIT: ::std::mem::MaybeUninit<if_nameindex> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<if_nameindex>(),
        16usize,
        concat!("Size of: ", stringify!(if_nameindex))
    );
    assert_eq!(
        ::std::mem::align_of::<if_nameindex>(),
        8usize,
        concat!("Alignment of ", stringify!(if_nameindex))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).if_index) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(if_nameindex),
            "::",
            stringify!(if_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).if_name) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(if_nameindex), "::", stringify!(if_name))
    );
}
unsafe extern "C" {
    pub fn if_nametoindex(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn if_indextoname(
        arg1: ::std::os::raw::c_uint,
        arg2: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn if_nameindex() -> *mut if_nameindex;
}
unsafe extern "C" {
    pub fn if_freenameindex(arg1: *mut if_nameindex);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: time_t,
    pub tv_nsec: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_timespec() {
    const UNINIT: ::std::mem::MaybeUninit<timespec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(timespec), "::", stringify!(tv_sec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(timespec), "::", stringify!(tv_nsec))
    );
}
pub type __fd_mask = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub fds_bits: [__fd_mask; 32usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    const UNINIT: ::std::mem::MaybeUninit<fd_set> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        4usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fds_bits) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(fd_set), "::", stringify!(fds_bits))
    );
}
pub type sigset_t = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn select(
        arg1: ::std::os::raw::c_int,
        arg2: *mut fd_set,
        arg3: *mut fd_set,
        arg4: *mut fd_set,
        arg5: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pselect(
        arg1: ::std::os::raw::c_int,
        arg2: *mut fd_set,
        arg3: *mut fd_set,
        arg4: *mut fd_set,
        arg5: *const timespec,
        arg6: *const sigset_t,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timezone {
    pub tz_minuteswest: ::std::os::raw::c_int,
    pub tz_dsttime: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_timezone() {
    const UNINIT: ::std::mem::MaybeUninit<timezone> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timezone>(),
        8usize,
        concat!("Size of: ", stringify!(timezone))
    );
    assert_eq!(
        ::std::mem::align_of::<timezone>(),
        4usize,
        concat!("Alignment of ", stringify!(timezone))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tz_minuteswest) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timezone),
            "::",
            stringify!(tz_minuteswest)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tz_dsttime) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(timezone), "::", stringify!(tz_dsttime))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerval {
    pub it_interval: timeval,
    pub it_value: timeval,
}
#[test]
fn bindgen_test_layout_itimerval() {
    const UNINIT: ::std::mem::MaybeUninit<itimerval> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<itimerval>(),
        32usize,
        concat!("Size of: ", stringify!(itimerval))
    );
    assert_eq!(
        ::std::mem::align_of::<itimerval>(),
        8usize,
        concat!("Alignment of ", stringify!(itimerval))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).it_interval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerval),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).it_value) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(itimerval), "::", stringify!(it_value))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct clockinfo {
    pub hz: ::std::os::raw::c_int,
    pub tick: ::std::os::raw::c_int,
    pub stathz: ::std::os::raw::c_int,
    pub profhz: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_clockinfo() {
    const UNINIT: ::std::mem::MaybeUninit<clockinfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<clockinfo>(),
        16usize,
        concat!("Size of: ", stringify!(clockinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<clockinfo>(),
        4usize,
        concat!("Alignment of ", stringify!(clockinfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hz) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(clockinfo), "::", stringify!(hz))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tick) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(clockinfo), "::", stringify!(tick))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stathz) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(clockinfo), "::", stringify!(stathz))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).profhz) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(clockinfo), "::", stringify!(profhz))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[test]
fn bindgen_test_layout_itimerspec() {
    const UNINIT: ::std::mem::MaybeUninit<itimerspec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<itimerspec>(),
        32usize,
        concat!("Size of: ", stringify!(itimerspec))
    );
    assert_eq!(
        ::std::mem::align_of::<itimerspec>(),
        8usize,
        concat!("Alignment of ", stringify!(itimerspec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).it_interval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).it_value) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(itimerspec), "::", stringify!(it_value))
    );
}
pub type locale_t = *mut ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm() {
    const UNINIT: ::std::mem::MaybeUninit<tm> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<tm>(),
        56usize,
        concat!("Size of: ", stringify!(tm))
    );
    assert_eq!(
        ::std::mem::align_of::<tm>(),
        8usize,
        concat!("Alignment of ", stringify!(tm))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_sec) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_sec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_min) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_min))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_hour) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_hour))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_mday) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_mday))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_mon) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_mon))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_year) as usize - ptr as usize },
        20usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_year))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_wday) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_wday))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_yday) as usize - ptr as usize },
        28usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_yday))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_isdst) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_isdst))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_gmtoff) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_gmtoff))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_zone) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_zone))
    );
}
unsafe extern "C" {
    pub fn asctime(arg1: *const tm) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn clock() -> clock_t;
}
unsafe extern "C" {
    pub fn ctime(arg1: *const time_t) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn difftime(arg1: time_t, arg2: time_t) -> f64;
}
unsafe extern "C" {
    pub fn gmtime(arg1: *const time_t) -> *mut tm;
}
unsafe extern "C" {
    pub fn localtime(arg1: *const time_t) -> *mut tm;
}
unsafe extern "C" {
    pub fn mktime(arg1: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn strftime(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: *const ::std::os::raw::c_char,
        arg4: *const tm,
    ) -> usize;
}
unsafe extern "C" {
    pub fn time(arg1: *mut time_t) -> time_t;
}
unsafe extern "C" {
    pub static mut daylight: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut timezone: ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn strptime(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut tm,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn asctime_r(arg1: *const tm, arg2: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ctime_r(arg1: *const time_t, arg2: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn gmtime_r(arg1: *const time_t, arg2: *mut tm) -> *mut tm;
}
unsafe extern "C" {
    pub fn localtime_r(arg1: *const time_t, arg2: *mut tm) -> *mut tm;
}
unsafe extern "C" {
    pub static mut tzname: [*mut ::std::os::raw::c_char; 2usize];
}
unsafe extern "C" {
    pub fn tzset();
}
unsafe extern "C" {
    pub fn clock_getres(arg1: clockid_t, arg2: *mut timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_gettime(arg1: clockid_t, arg2: *mut timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_settime(arg1: clockid_t, arg2: *const timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nanosleep(arg1: *const timespec, arg2: *mut timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_getcpuclockid(arg1: pid_t, arg2: *mut clockid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strftime_l(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: *const ::std::os::raw::c_char,
        arg4: *const tm,
        arg5: locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn timespec_get(_ts: *mut timespec, _base: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tzsetwall();
}
unsafe extern "C" {
    pub fn timelocal(arg1: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn timegm(arg1: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn timeoff(arg1: *mut tm, arg2: ::std::os::raw::c_long) -> time_t;
}
unsafe extern "C" {
    pub fn adjtime(arg1: *const timeval, arg2: *mut timeval) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn adjfreq(arg1: *const i64, arg2: *mut i64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn futimes(arg1: ::std::os::raw::c_int, arg2: *const timeval) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getitimer(arg1: ::std::os::raw::c_int, arg2: *mut itimerval) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn gettimeofday(arg1: *mut timeval, arg2: *mut timezone) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setitimer(
        arg1: ::std::os::raw::c_int,
        arg2: *const itimerval,
        arg3: *mut itimerval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn settimeofday(arg1: *const timeval, arg2: *const timezone) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn utimes(arg1: *const ::std::os::raw::c_char, arg2: *const timeval) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct if_clonereq {
    pub ifcr_total: ::std::os::raw::c_int,
    pub ifcr_count: ::std::os::raw::c_int,
    pub ifcr_buffer: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_if_clonereq() {
    const UNINIT: ::std::mem::MaybeUninit<if_clonereq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<if_clonereq>(),
        16usize,
        concat!("Size of: ", stringify!(if_clonereq))
    );
    assert_eq!(
        ::std::mem::align_of::<if_clonereq>(),
        8usize,
        concat!("Alignment of ", stringify!(if_clonereq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifcr_total) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(if_clonereq),
            "::",
            stringify!(ifcr_total)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifcr_count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(if_clonereq),
            "::",
            stringify!(ifcr_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifcr_buffer) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(if_clonereq),
            "::",
            stringify!(ifcr_buffer)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct if_rxring {
    pub rxr_adjusted: ::std::os::raw::c_int,
    pub rxr_alive: u_int,
    pub rxr_cwm: u_int,
    pub rxr_lwm: u_int,
    pub rxr_hwm: u_int,
}
#[test]
fn bindgen_test_layout_if_rxring() {
    const UNINIT: ::std::mem::MaybeUninit<if_rxring> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<if_rxring>(),
        20usize,
        concat!("Size of: ", stringify!(if_rxring))
    );
    assert_eq!(
        ::std::mem::align_of::<if_rxring>(),
        4usize,
        concat!("Alignment of ", stringify!(if_rxring))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rxr_adjusted) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(if_rxring),
            "::",
            stringify!(rxr_adjusted)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rxr_alive) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(if_rxring), "::", stringify!(rxr_alive))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rxr_cwm) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(if_rxring), "::", stringify!(rxr_cwm))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rxr_lwm) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(if_rxring), "::", stringify!(rxr_lwm))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rxr_hwm) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(if_rxring), "::", stringify!(rxr_hwm))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct if_rxring_info {
    pub ifr_name: [::std::os::raw::c_char; 16usize],
    pub ifr_size: u_int,
    pub ifr_info: if_rxring,
}
#[test]
fn bindgen_test_layout_if_rxring_info() {
    const UNINIT: ::std::mem::MaybeUninit<if_rxring_info> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<if_rxring_info>(),
        40usize,
        concat!("Size of: ", stringify!(if_rxring_info))
    );
    assert_eq!(
        ::std::mem::align_of::<if_rxring_info>(),
        4usize,
        concat!("Alignment of ", stringify!(if_rxring_info))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifr_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(if_rxring_info),
            "::",
            stringify!(ifr_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifr_size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(if_rxring_info),
            "::",
            stringify!(ifr_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifr_info) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(if_rxring_info),
            "::",
            stringify!(ifr_info)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct if_rxrinfo {
    pub ifri_total: u_int,
    pub ifri_entries: *mut if_rxring_info,
}
#[test]
fn bindgen_test_layout_if_rxrinfo() {
    const UNINIT: ::std::mem::MaybeUninit<if_rxrinfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<if_rxrinfo>(),
        16usize,
        concat!("Size of: ", stringify!(if_rxrinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<if_rxrinfo>(),
        8usize,
        concat!("Alignment of ", stringify!(if_rxrinfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifri_total) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(if_rxrinfo),
            "::",
            stringify!(ifri_total)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifri_entries) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(if_rxrinfo),
            "::",
            stringify!(ifri_entries)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct if_data {
    pub ifi_type: u_char,
    pub ifi_addrlen: u_char,
    pub ifi_hdrlen: u_char,
    pub ifi_link_state: u_char,
    pub ifi_mtu: u_int32_t,
    pub ifi_metric: u_int32_t,
    pub ifi_rdomain: u_int32_t,
    pub ifi_baudrate: u_int64_t,
    pub ifi_ipackets: u_int64_t,
    pub ifi_ierrors: u_int64_t,
    pub ifi_opackets: u_int64_t,
    pub ifi_oerrors: u_int64_t,
    pub ifi_collisions: u_int64_t,
    pub ifi_ibytes: u_int64_t,
    pub ifi_obytes: u_int64_t,
    pub ifi_imcasts: u_int64_t,
    pub ifi_omcasts: u_int64_t,
    pub ifi_iqdrops: u_int64_t,
    pub ifi_oqdrops: u_int64_t,
    pub ifi_noproto: u_int64_t,
    pub ifi_capabilities: u_int32_t,
    pub ifi_lastchange: timeval,
}
#[test]
fn bindgen_test_layout_if_data() {
    const UNINIT: ::std::mem::MaybeUninit<if_data> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<if_data>(),
        144usize,
        concat!("Size of: ", stringify!(if_data))
    );
    assert_eq!(
        ::std::mem::align_of::<if_data>(),
        8usize,
        concat!("Alignment of ", stringify!(if_data))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_type) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_addrlen) as usize - ptr as usize },
        1usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_addrlen))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_hdrlen) as usize - ptr as usize },
        2usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_hdrlen))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_link_state) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(if_data),
            "::",
            stringify!(ifi_link_state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_mtu) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_mtu))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_metric) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_metric))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_rdomain) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_rdomain))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_baudrate) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_baudrate))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_ipackets) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_ipackets))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_ierrors) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_ierrors))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_opackets) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_opackets))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_oerrors) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_oerrors))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_collisions) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(if_data),
            "::",
            stringify!(ifi_collisions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_ibytes) as usize - ptr as usize },
        64usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_ibytes))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_obytes) as usize - ptr as usize },
        72usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_obytes))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_imcasts) as usize - ptr as usize },
        80usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_imcasts))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_omcasts) as usize - ptr as usize },
        88usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_omcasts))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_iqdrops) as usize - ptr as usize },
        96usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_iqdrops))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_oqdrops) as usize - ptr as usize },
        104usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_oqdrops))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_noproto) as usize - ptr as usize },
        112usize,
        concat!("Offset of field: ", stringify!(if_data), "::", stringify!(ifi_noproto))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_capabilities) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(if_data),
            "::",
            stringify!(ifi_capabilities)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifi_lastchange) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(if_data),
            "::",
            stringify!(ifi_lastchange)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct if_status_description {
    pub ifs_type: u_char,
    pub ifs_state: u_char,
    pub ifs_string: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_if_status_description() {
    const UNINIT: ::std::mem::MaybeUninit<if_status_description> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<if_status_description>(),
        16usize,
        concat!("Size of: ", stringify!(if_status_description))
    );
    assert_eq!(
        ::std::mem::align_of::<if_status_description>(),
        8usize,
        concat!("Alignment of ", stringify!(if_status_description))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifs_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(if_status_description),
            "::",
            stringify!(ifs_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifs_state) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(if_status_description),
            "::",
            stringify!(ifs_state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifs_string) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(if_status_description),
            "::",
            stringify!(ifs_string)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct if_msghdr {
    pub ifm_msglen: u_short,
    pub ifm_version: u_char,
    pub ifm_type: u_char,
    pub ifm_hdrlen: u_short,
    pub ifm_index: u_short,
    pub ifm_tableid: u_short,
    pub ifm_pad1: u_char,
    pub ifm_pad2: u_char,
    pub ifm_addrs: ::std::os::raw::c_int,
    pub ifm_flags: ::std::os::raw::c_int,
    pub ifm_xflags: ::std::os::raw::c_int,
    pub ifm_data: if_data,
}
#[test]
fn bindgen_test_layout_if_msghdr() {
    const UNINIT: ::std::mem::MaybeUninit<if_msghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<if_msghdr>(),
        168usize,
        concat!("Size of: ", stringify!(if_msghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<if_msghdr>(),
        8usize,
        concat!("Alignment of ", stringify!(if_msghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_msglen) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(if_msghdr), "::", stringify!(ifm_msglen))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_version) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(if_msghdr),
            "::",
            stringify!(ifm_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_type) as usize - ptr as usize },
        3usize,
        concat!("Offset of field: ", stringify!(if_msghdr), "::", stringify!(ifm_type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_hdrlen) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(if_msghdr), "::", stringify!(ifm_hdrlen))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_index) as usize - ptr as usize },
        6usize,
        concat!("Offset of field: ", stringify!(if_msghdr), "::", stringify!(ifm_index))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_tableid) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(if_msghdr),
            "::",
            stringify!(ifm_tableid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_pad1) as usize - ptr as usize },
        10usize,
        concat!("Offset of field: ", stringify!(if_msghdr), "::", stringify!(ifm_pad1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_pad2) as usize - ptr as usize },
        11usize,
        concat!("Offset of field: ", stringify!(if_msghdr), "::", stringify!(ifm_pad2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_addrs) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(if_msghdr), "::", stringify!(ifm_addrs))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_flags) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(if_msghdr), "::", stringify!(ifm_flags))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_xflags) as usize - ptr as usize },
        20usize,
        concat!("Offset of field: ", stringify!(if_msghdr), "::", stringify!(ifm_xflags))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_data) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(if_msghdr), "::", stringify!(ifm_data))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifa_msghdr {
    pub ifam_msglen: u_short,
    pub ifam_version: u_char,
    pub ifam_type: u_char,
    pub ifam_hdrlen: u_short,
    pub ifam_index: u_short,
    pub ifam_tableid: u_short,
    pub ifam_pad1: u_char,
    pub ifam_pad2: u_char,
    pub ifam_addrs: ::std::os::raw::c_int,
    pub ifam_flags: ::std::os::raw::c_int,
    pub ifam_metric: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ifa_msghdr() {
    const UNINIT: ::std::mem::MaybeUninit<ifa_msghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifa_msghdr>(),
        24usize,
        concat!("Size of: ", stringify!(ifa_msghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<ifa_msghdr>(),
        4usize,
        concat!("Alignment of ", stringify!(ifa_msghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_msglen) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_msghdr),
            "::",
            stringify!(ifam_msglen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_version) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_msghdr),
            "::",
            stringify!(ifam_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_type) as usize - ptr as usize },
        3usize,
        concat!("Offset of field: ", stringify!(ifa_msghdr), "::", stringify!(ifam_type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_hdrlen) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_msghdr),
            "::",
            stringify!(ifam_hdrlen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_index) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_msghdr),
            "::",
            stringify!(ifam_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_tableid) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_msghdr),
            "::",
            stringify!(ifam_tableid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_pad1) as usize - ptr as usize },
        10usize,
        concat!("Offset of field: ", stringify!(ifa_msghdr), "::", stringify!(ifam_pad1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_pad2) as usize - ptr as usize },
        11usize,
        concat!("Offset of field: ", stringify!(ifa_msghdr), "::", stringify!(ifam_pad2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_addrs) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_msghdr),
            "::",
            stringify!(ifam_addrs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_flags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_msghdr),
            "::",
            stringify!(ifam_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifam_metric) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_msghdr),
            "::",
            stringify!(ifam_metric)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct if_announcemsghdr {
    pub ifan_msglen: u_short,
    pub ifan_version: u_char,
    pub ifan_type: u_char,
    pub ifan_hdrlen: u_short,
    pub ifan_index: u_short,
    pub ifan_what: u_short,
    pub ifan_name: [::std::os::raw::c_char; 16usize],
}
#[test]
fn bindgen_test_layout_if_announcemsghdr() {
    const UNINIT: ::std::mem::MaybeUninit<if_announcemsghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<if_announcemsghdr>(),
        26usize,
        concat!("Size of: ", stringify!(if_announcemsghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<if_announcemsghdr>(),
        2usize,
        concat!("Alignment of ", stringify!(if_announcemsghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifan_msglen) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(if_announcemsghdr),
            "::",
            stringify!(ifan_msglen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifan_version) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(if_announcemsghdr),
            "::",
            stringify!(ifan_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifan_type) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(if_announcemsghdr),
            "::",
            stringify!(ifan_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifan_hdrlen) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(if_announcemsghdr),
            "::",
            stringify!(ifan_hdrlen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifan_index) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(if_announcemsghdr),
            "::",
            stringify!(ifan_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifan_what) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(if_announcemsghdr),
            "::",
            stringify!(ifan_what)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifan_name) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(if_announcemsghdr),
            "::",
            stringify!(ifan_name)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct if_ieee80211_data {
    pub ifie_channel: u8,
    pub ifie_nwid_len: u8,
    pub ifie_flags: u32,
    pub ifie_xflags: u32,
    pub ifie_nwid: [u8; 32usize],
    pub ifie_addr: [u8; 6usize],
}
#[test]
fn bindgen_test_layout_if_ieee80211_data() {
    const UNINIT: ::std::mem::MaybeUninit<if_ieee80211_data> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<if_ieee80211_data>(),
        52usize,
        concat!("Size of: ", stringify!(if_ieee80211_data))
    );
    assert_eq!(
        ::std::mem::align_of::<if_ieee80211_data>(),
        4usize,
        concat!("Alignment of ", stringify!(if_ieee80211_data))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifie_channel) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(if_ieee80211_data),
            "::",
            stringify!(ifie_channel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifie_nwid_len) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(if_ieee80211_data),
            "::",
            stringify!(ifie_nwid_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifie_flags) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(if_ieee80211_data),
            "::",
            stringify!(ifie_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifie_xflags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(if_ieee80211_data),
            "::",
            stringify!(ifie_xflags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifie_nwid) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(if_ieee80211_data),
            "::",
            stringify!(ifie_nwid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifie_addr) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(if_ieee80211_data),
            "::",
            stringify!(ifie_addr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct if_ieee80211_msghdr {
    pub ifim_msglen: u16,
    pub ifim_version: u8,
    pub ifim_type: u8,
    pub ifim_hdrlen: u16,
    pub ifim_index: u16,
    pub ifim_tableid: u16,
    pub ifim_ifie: if_ieee80211_data,
}
#[test]
fn bindgen_test_layout_if_ieee80211_msghdr() {
    const UNINIT: ::std::mem::MaybeUninit<if_ieee80211_msghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<if_ieee80211_msghdr>(),
        64usize,
        concat!("Size of: ", stringify!(if_ieee80211_msghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<if_ieee80211_msghdr>(),
        4usize,
        concat!("Alignment of ", stringify!(if_ieee80211_msghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifim_msglen) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(if_ieee80211_msghdr),
            "::",
            stringify!(ifim_msglen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifim_version) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(if_ieee80211_msghdr),
            "::",
            stringify!(ifim_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifim_type) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(if_ieee80211_msghdr),
            "::",
            stringify!(ifim_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifim_hdrlen) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(if_ieee80211_msghdr),
            "::",
            stringify!(ifim_hdrlen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifim_index) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(if_ieee80211_msghdr),
            "::",
            stringify!(ifim_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifim_tableid) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(if_ieee80211_msghdr),
            "::",
            stringify!(ifim_tableid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifim_ifie) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(if_ieee80211_msghdr),
            "::",
            stringify!(ifim_ifie)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct if_nameindex_msg {
    pub if_index: ::std::os::raw::c_uint,
    pub if_name: [::std::os::raw::c_char; 16usize],
}
#[test]
fn bindgen_test_layout_if_nameindex_msg() {
    const UNINIT: ::std::mem::MaybeUninit<if_nameindex_msg> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<if_nameindex_msg>(),
        20usize,
        concat!("Size of: ", stringify!(if_nameindex_msg))
    );
    assert_eq!(
        ::std::mem::align_of::<if_nameindex_msg>(),
        4usize,
        concat!("Alignment of ", stringify!(if_nameindex_msg))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).if_index) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(if_nameindex_msg),
            "::",
            stringify!(if_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).if_name) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(if_nameindex_msg),
            "::",
            stringify!(if_name)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ifg_req {
    pub ifgrq_ifgrqu: ifg_req__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ifg_req__bindgen_ty_1 {
    pub ifgrqu_group: [::std::os::raw::c_char; 16usize],
    pub ifgrqu_member: [::std::os::raw::c_char; 16usize],
}
#[test]
fn bindgen_test_layout_ifg_req__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ifg_req__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifg_req__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(ifg_req__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ifg_req__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(ifg_req__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifgrqu_group) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifg_req__bindgen_ty_1),
            "::",
            stringify!(ifgrqu_group)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifgrqu_member) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifg_req__bindgen_ty_1),
            "::",
            stringify!(ifgrqu_member)
        )
    );
}
#[test]
fn bindgen_test_layout_ifg_req() {
    const UNINIT: ::std::mem::MaybeUninit<ifg_req> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifg_req>(),
        16usize,
        concat!("Size of: ", stringify!(ifg_req))
    );
    assert_eq!(
        ::std::mem::align_of::<ifg_req>(),
        1usize,
        concat!("Alignment of ", stringify!(ifg_req))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifgrq_ifgrqu) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ifg_req), "::", stringify!(ifgrq_ifgrqu))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifg_attrib {
    pub ifg_carp_demoted: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ifg_attrib() {
    const UNINIT: ::std::mem::MaybeUninit<ifg_attrib> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifg_attrib>(),
        4usize,
        concat!("Size of: ", stringify!(ifg_attrib))
    );
    assert_eq!(
        ::std::mem::align_of::<ifg_attrib>(),
        4usize,
        concat!("Alignment of ", stringify!(ifg_attrib))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifg_carp_demoted) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifg_attrib),
            "::",
            stringify!(ifg_carp_demoted)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ifgroupreq {
    pub ifgr_name: [::std::os::raw::c_char; 16usize],
    pub ifgr_len: u_int,
    pub ifgr_ifgru: ifgroupreq__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ifgroupreq__bindgen_ty_1 {
    pub ifgru_group: [::std::os::raw::c_char; 16usize],
    pub ifgru_groups: *mut ifg_req,
    pub ifgru_attrib: ifg_attrib,
}
#[test]
fn bindgen_test_layout_ifgroupreq__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ifgroupreq__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifgroupreq__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(ifgroupreq__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ifgroupreq__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(ifgroupreq__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifgru_group) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifgroupreq__bindgen_ty_1),
            "::",
            stringify!(ifgru_group)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifgru_groups) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifgroupreq__bindgen_ty_1),
            "::",
            stringify!(ifgru_groups)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifgru_attrib) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifgroupreq__bindgen_ty_1),
            "::",
            stringify!(ifgru_attrib)
        )
    );
}
#[test]
fn bindgen_test_layout_ifgroupreq() {
    const UNINIT: ::std::mem::MaybeUninit<ifgroupreq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifgroupreq>(),
        40usize,
        concat!("Size of: ", stringify!(ifgroupreq))
    );
    assert_eq!(
        ::std::mem::align_of::<ifgroupreq>(),
        8usize,
        concat!("Alignment of ", stringify!(ifgroupreq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifgr_name) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ifgroupreq), "::", stringify!(ifgr_name))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifgr_len) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(ifgroupreq), "::", stringify!(ifgr_len))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifgr_ifgru) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ifgroupreq),
            "::",
            stringify!(ifgr_ifgru)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ifreq {
    pub ifr_name: [::std::os::raw::c_char; 16usize],
    pub ifr_ifru: ifreq__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ifreq__bindgen_ty_1 {
    pub ifru_addr: sockaddr,
    pub ifru_dstaddr: sockaddr,
    pub ifru_broadaddr: sockaddr,
    pub ifru_flags: ::std::os::raw::c_short,
    pub ifru_metric: ::std::os::raw::c_int,
    pub ifru_vnetid: i64,
    pub ifru_media: u64,
    pub ifru_data: caddr_t,
    pub ifru_index: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_ifreq__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ifreq__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifreq__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(ifreq__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ifreq__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(ifreq__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifru_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq__bindgen_ty_1),
            "::",
            stringify!(ifru_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifru_dstaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq__bindgen_ty_1),
            "::",
            stringify!(ifru_dstaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifru_broadaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq__bindgen_ty_1),
            "::",
            stringify!(ifru_broadaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifru_flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq__bindgen_ty_1),
            "::",
            stringify!(ifru_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifru_metric) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq__bindgen_ty_1),
            "::",
            stringify!(ifru_metric)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifru_vnetid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq__bindgen_ty_1),
            "::",
            stringify!(ifru_vnetid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifru_media) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq__bindgen_ty_1),
            "::",
            stringify!(ifru_media)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifru_data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq__bindgen_ty_1),
            "::",
            stringify!(ifru_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifru_index) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifreq__bindgen_ty_1),
            "::",
            stringify!(ifru_index)
        )
    );
}
#[test]
fn bindgen_test_layout_ifreq() {
    const UNINIT: ::std::mem::MaybeUninit<ifreq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifreq>(),
        32usize,
        concat!("Size of: ", stringify!(ifreq))
    );
    assert_eq!(
        ::std::mem::align_of::<ifreq>(),
        8usize,
        concat!("Alignment of ", stringify!(ifreq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifr_name) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ifreq), "::", stringify!(ifr_name))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifr_ifru) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(ifreq), "::", stringify!(ifr_ifru))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ifaliasreq {
    pub ifra_name: [::std::os::raw::c_char; 16usize],
    pub ifra_ifrau: ifaliasreq__bindgen_ty_1,
    pub ifra_dstaddr: sockaddr,
    pub ifra_mask: sockaddr,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ifaliasreq__bindgen_ty_1 {
    pub ifrau_addr: sockaddr,
    pub ifrau_align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ifaliasreq__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ifaliasreq__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifaliasreq__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(ifaliasreq__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ifaliasreq__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(ifaliasreq__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifrau_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaliasreq__bindgen_ty_1),
            "::",
            stringify!(ifrau_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifrau_align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaliasreq__bindgen_ty_1),
            "::",
            stringify!(ifrau_align)
        )
    );
}
#[test]
fn bindgen_test_layout_ifaliasreq() {
    const UNINIT: ::std::mem::MaybeUninit<ifaliasreq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifaliasreq>(),
        64usize,
        concat!("Size of: ", stringify!(ifaliasreq))
    );
    assert_eq!(
        ::std::mem::align_of::<ifaliasreq>(),
        4usize,
        concat!("Alignment of ", stringify!(ifaliasreq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifra_name) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ifaliasreq), "::", stringify!(ifra_name))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifra_ifrau) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaliasreq),
            "::",
            stringify!(ifra_ifrau)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifra_dstaddr) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaliasreq),
            "::",
            stringify!(ifra_dstaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifra_mask) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(ifaliasreq), "::", stringify!(ifra_mask))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifmediareq {
    pub ifm_name: [::std::os::raw::c_char; 16usize],
    pub ifm_current: u64,
    pub ifm_mask: u64,
    pub ifm_status: u64,
    pub ifm_active: u64,
    pub ifm_count: ::std::os::raw::c_int,
    pub ifm_ulist: *mut u64,
}
#[test]
fn bindgen_test_layout_ifmediareq() {
    const UNINIT: ::std::mem::MaybeUninit<ifmediareq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifmediareq>(),
        64usize,
        concat!("Size of: ", stringify!(ifmediareq))
    );
    assert_eq!(
        ::std::mem::align_of::<ifmediareq>(),
        8usize,
        concat!("Alignment of ", stringify!(ifmediareq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_name) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ifmediareq), "::", stringify!(ifm_name))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_current) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ifmediareq),
            "::",
            stringify!(ifm_current)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_mask) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(ifmediareq), "::", stringify!(ifm_mask))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_status) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ifmediareq),
            "::",
            stringify!(ifm_status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_active) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ifmediareq),
            "::",
            stringify!(ifm_active)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_count) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(ifmediareq), "::", stringify!(ifm_count))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifm_ulist) as usize - ptr as usize },
        56usize,
        concat!("Offset of field: ", stringify!(ifmediareq), "::", stringify!(ifm_ulist))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifkalivereq {
    pub ikar_name: [::std::os::raw::c_char; 16usize],
    pub ikar_timeo: ::std::os::raw::c_int,
    pub ikar_cnt: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ifkalivereq() {
    const UNINIT: ::std::mem::MaybeUninit<ifkalivereq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifkalivereq>(),
        24usize,
        concat!("Size of: ", stringify!(ifkalivereq))
    );
    assert_eq!(
        ::std::mem::align_of::<ifkalivereq>(),
        4usize,
        concat!("Alignment of ", stringify!(ifkalivereq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ikar_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifkalivereq),
            "::",
            stringify!(ikar_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ikar_timeo) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ifkalivereq),
            "::",
            stringify!(ikar_timeo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ikar_cnt) as usize - ptr as usize },
        20usize,
        concat!("Offset of field: ", stringify!(ifkalivereq), "::", stringify!(ikar_cnt))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ifconf {
    pub ifc_len: ::std::os::raw::c_int,
    pub ifc_ifcu: ifconf__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ifconf__bindgen_ty_1 {
    pub ifcu_buf: caddr_t,
    pub ifcu_req: *mut ifreq,
}
#[test]
fn bindgen_test_layout_ifconf__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ifconf__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifconf__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(ifconf__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ifconf__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(ifconf__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifcu_buf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifconf__bindgen_ty_1),
            "::",
            stringify!(ifcu_buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifcu_req) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifconf__bindgen_ty_1),
            "::",
            stringify!(ifcu_req)
        )
    );
}
#[test]
fn bindgen_test_layout_ifconf() {
    const UNINIT: ::std::mem::MaybeUninit<ifconf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifconf>(),
        16usize,
        concat!("Size of: ", stringify!(ifconf))
    );
    assert_eq!(
        ::std::mem::align_of::<ifconf>(),
        8usize,
        concat!("Alignment of ", stringify!(ifconf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifc_len) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ifconf), "::", stringify!(ifc_len))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifc_ifcu) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(ifconf), "::", stringify!(ifc_ifcu))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct if_laddrreq {
    pub iflr_name: [::std::os::raw::c_char; 16usize],
    pub flags: ::std::os::raw::c_uint,
    pub prefixlen: ::std::os::raw::c_uint,
    pub addr: sockaddr_storage,
    pub dstaddr: sockaddr_storage,
}
#[test]
fn bindgen_test_layout_if_laddrreq() {
    const UNINIT: ::std::mem::MaybeUninit<if_laddrreq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<if_laddrreq>(),
        536usize,
        concat!("Size of: ", stringify!(if_laddrreq))
    );
    assert_eq!(
        ::std::mem::align_of::<if_laddrreq>(),
        8usize,
        concat!("Alignment of ", stringify!(if_laddrreq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iflr_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(if_laddrreq),
            "::",
            stringify!(iflr_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(if_laddrreq), "::", stringify!(flags))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prefixlen) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(if_laddrreq),
            "::",
            stringify!(prefixlen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(if_laddrreq), "::", stringify!(addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dstaddr) as usize - ptr as usize },
        280usize,
        concat!("Offset of field: ", stringify!(if_laddrreq), "::", stringify!(dstaddr))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct if_afreq {
    pub ifar_name: [::std::os::raw::c_char; 16usize],
    pub ifar_af: sa_family_t,
}
#[test]
fn bindgen_test_layout_if_afreq() {
    const UNINIT: ::std::mem::MaybeUninit<if_afreq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<if_afreq>(),
        17usize,
        concat!("Size of: ", stringify!(if_afreq))
    );
    assert_eq!(
        ::std::mem::align_of::<if_afreq>(),
        1usize,
        concat!("Alignment of ", stringify!(if_afreq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifar_name) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(if_afreq), "::", stringify!(ifar_name))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifar_af) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(if_afreq), "::", stringify!(ifar_af))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct if_parent {
    pub ifp_name: [::std::os::raw::c_char; 16usize],
    pub ifp_parent: [::std::os::raw::c_char; 16usize],
}
#[test]
fn bindgen_test_layout_if_parent() {
    const UNINIT: ::std::mem::MaybeUninit<if_parent> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<if_parent>(),
        32usize,
        concat!("Size of: ", stringify!(if_parent))
    );
    assert_eq!(
        ::std::mem::align_of::<if_parent>(),
        1usize,
        concat!("Alignment of ", stringify!(if_parent))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifp_name) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(if_parent), "::", stringify!(ifp_name))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifp_parent) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(if_parent), "::", stringify!(ifp_parent))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct if_sffpage {
    pub sff_ifname: [::std::os::raw::c_char; 16usize],
    pub sff_addr: u8,
    pub sff_page: u8,
    pub sff_data: [u8; 256usize],
}
#[test]
fn bindgen_test_layout_if_sffpage() {
    const UNINIT: ::std::mem::MaybeUninit<if_sffpage> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<if_sffpage>(),
        274usize,
        concat!("Size of: ", stringify!(if_sffpage))
    );
    assert_eq!(
        ::std::mem::align_of::<if_sffpage>(),
        1usize,
        concat!("Alignment of ", stringify!(if_sffpage))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sff_ifname) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(if_sffpage),
            "::",
            stringify!(sff_ifname)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sff_addr) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(if_sffpage), "::", stringify!(sff_addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sff_page) as usize - ptr as usize },
        17usize,
        concat!("Offset of field: ", stringify!(if_sffpage), "::", stringify!(sff_page))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sff_data) as usize - ptr as usize },
        18usize,
        concat!("Offset of field: ", stringify!(if_sffpage), "::", stringify!(sff_data))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct arphdr {
    pub ar_hrd: u_int16_t,
    pub ar_pro: u_int16_t,
    pub ar_hln: u_int8_t,
    pub ar_pln: u_int8_t,
    pub ar_op: u_int16_t,
}
#[test]
fn bindgen_test_layout_arphdr() {
    const UNINIT: ::std::mem::MaybeUninit<arphdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<arphdr>(),
        8usize,
        concat!("Size of: ", stringify!(arphdr))
    );
    assert_eq!(
        ::std::mem::align_of::<arphdr>(),
        2usize,
        concat!("Alignment of ", stringify!(arphdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ar_hrd) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(arphdr), "::", stringify!(ar_hrd))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ar_pro) as usize - ptr as usize },
        2usize,
        concat!("Offset of field: ", stringify!(arphdr), "::", stringify!(ar_pro))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ar_hln) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(arphdr), "::", stringify!(ar_hln))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ar_pln) as usize - ptr as usize },
        5usize,
        concat!("Offset of field: ", stringify!(arphdr), "::", stringify!(ar_pln))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ar_op) as usize - ptr as usize },
        6usize,
        concat!("Offset of field: ", stringify!(arphdr), "::", stringify!(ar_op))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct arpreq {
    pub arp_pa: sockaddr,
    pub arp_ha: sockaddr,
    pub arp_flags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_arpreq() {
    const UNINIT: ::std::mem::MaybeUninit<arpreq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<arpreq>(),
        36usize,
        concat!("Size of: ", stringify!(arpreq))
    );
    assert_eq!(
        ::std::mem::align_of::<arpreq>(),
        4usize,
        concat!("Alignment of ", stringify!(arpreq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arp_pa) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(arpreq), "::", stringify!(arp_pa))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arp_ha) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(arpreq), "::", stringify!(arp_ha))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arp_flags) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(arpreq), "::", stringify!(arp_flags))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rb_type {
    pub t_compare: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub t_augment: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub t_offset: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_rb_type() {
    const UNINIT: ::std::mem::MaybeUninit<rb_type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rb_type>(),
        24usize,
        concat!("Size of: ", stringify!(rb_type))
    );
    assert_eq!(
        ::std::mem::align_of::<rb_type>(),
        8usize,
        concat!("Alignment of ", stringify!(rb_type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).t_compare) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(rb_type), "::", stringify!(t_compare))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).t_augment) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(rb_type), "::", stringify!(t_augment))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).t_offset) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(rb_type), "::", stringify!(t_offset))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rb_tree {
    pub rbt_root: *mut rb_entry,
}
#[test]
fn bindgen_test_layout_rb_tree() {
    const UNINIT: ::std::mem::MaybeUninit<rb_tree> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rb_tree>(),
        8usize,
        concat!("Size of: ", stringify!(rb_tree))
    );
    assert_eq!(
        ::std::mem::align_of::<rb_tree>(),
        8usize,
        concat!("Alignment of ", stringify!(rb_tree))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rbt_root) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(rb_tree), "::", stringify!(rbt_root))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rb_entry {
    pub rbt_parent: *mut rb_entry,
    pub rbt_left: *mut rb_entry,
    pub rbt_right: *mut rb_entry,
    pub rbt_color: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_rb_entry() {
    const UNINIT: ::std::mem::MaybeUninit<rb_entry> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rb_entry>(),
        32usize,
        concat!("Size of: ", stringify!(rb_entry))
    );
    assert_eq!(
        ::std::mem::align_of::<rb_entry>(),
        8usize,
        concat!("Alignment of ", stringify!(rb_entry))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rbt_parent) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(rb_entry), "::", stringify!(rbt_parent))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rbt_left) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(rb_entry), "::", stringify!(rbt_left))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rbt_right) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(rb_entry), "::", stringify!(rbt_right))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rbt_color) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(rb_entry), "::", stringify!(rbt_color))
    );
}
unsafe extern "C" {
    pub fn _rb_insert(
        arg1: *const rb_type,
        arg2: *mut rb_tree,
        arg3: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _rb_remove(
        arg1: *const rb_type,
        arg2: *mut rb_tree,
        arg3: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _rb_find(
        arg1: *const rb_type,
        arg2: *mut rb_tree,
        arg3: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _rb_nfind(
        arg1: *const rb_type,
        arg2: *mut rb_tree,
        arg3: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _rb_root(arg1: *const rb_type, arg2: *mut rb_tree) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _rb_min(arg1: *const rb_type, arg2: *mut rb_tree) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _rb_max(arg1: *const rb_type, arg2: *mut rb_tree) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _rb_next(arg1: *const rb_type, arg2: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _rb_prev(arg1: *const rb_type, arg2: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _rb_left(arg1: *const rb_type, arg2: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _rb_right(arg1: *const rb_type, arg2: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _rb_parent(arg1: *const rb_type, arg2: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _rb_set_left(arg1: *const rb_type, arg2: *mut ::std::os::raw::c_void, arg3: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _rb_set_right(arg1: *const rb_type, arg2: *mut ::std::os::raw::c_void, arg3: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _rb_set_parent(arg1: *const rb_type, arg2: *mut ::std::os::raw::c_void, arg3: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _rb_poison(arg1: *const rb_type, arg2: *mut ::std::os::raw::c_void, arg3: ::std::os::raw::c_ulong);
}
unsafe extern "C" {
    pub fn _rb_check(
        arg1: *const rb_type,
        arg2: *mut ::std::os::raw::c_void,
        arg3: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
pub const lock_class_index_LO_CLASS_KERNEL_LOCK: lock_class_index = 0;
pub const lock_class_index_LO_CLASS_SCHED_LOCK: lock_class_index = 1;
pub const lock_class_index_LO_CLASS_MUTEX: lock_class_index = 2;
pub const lock_class_index_LO_CLASS_RWLOCK: lock_class_index = 3;
pub const lock_class_index_LO_CLASS_RRWLOCK: lock_class_index = 4;
pub type lock_class_index = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lock_object {
    pub lo_type: *const lock_type,
    pub lo_name: *const ::std::os::raw::c_char,
    pub lo_witness: *mut witness,
    pub lo_flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_lock_object() {
    const UNINIT: ::std::mem::MaybeUninit<lock_object> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lock_object>(),
        32usize,
        concat!("Size of: ", stringify!(lock_object))
    );
    assert_eq!(
        ::std::mem::align_of::<lock_object>(),
        8usize,
        concat!("Alignment of ", stringify!(lock_object))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lo_type) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(lock_object), "::", stringify!(lo_type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lo_name) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(lock_object), "::", stringify!(lo_name))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lo_witness) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lock_object),
            "::",
            stringify!(lo_witness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lo_flags) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(lock_object), "::", stringify!(lo_flags))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lock_type {
    pub lt_name: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_lock_type() {
    const UNINIT: ::std::mem::MaybeUninit<lock_type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lock_type>(),
        8usize,
        concat!("Size of: ", stringify!(lock_type))
    );
    assert_eq!(
        ::std::mem::align_of::<lock_type>(),
        8usize,
        concat!("Alignment of ", stringify!(lock_type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lt_name) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(lock_type), "::", stringify!(lt_name))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct proc_ {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rwlock {
    pub rwl_owner: ::std::os::raw::c_ulong,
    pub rwl_name: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_rwlock() {
    const UNINIT: ::std::mem::MaybeUninit<rwlock> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rwlock>(),
        16usize,
        concat!("Size of: ", stringify!(rwlock))
    );
    assert_eq!(
        ::std::mem::align_of::<rwlock>(),
        8usize,
        concat!("Alignment of ", stringify!(rwlock))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rwl_owner) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(rwlock), "::", stringify!(rwl_owner))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rwl_name) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(rwlock), "::", stringify!(rwl_name))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rrwlock {
    pub rrwl_lock: rwlock,
    pub rrwl_wcnt: u32,
}
#[test]
fn bindgen_test_layout_rrwlock() {
    const UNINIT: ::std::mem::MaybeUninit<rrwlock> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rrwlock>(),
        24usize,
        concat!("Size of: ", stringify!(rrwlock))
    );
    assert_eq!(
        ::std::mem::align_of::<rrwlock>(),
        8usize,
        concat!("Alignment of ", stringify!(rrwlock))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rrwl_lock) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(rrwlock), "::", stringify!(rrwl_lock))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rrwl_wcnt) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(rrwlock), "::", stringify!(rrwl_wcnt))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct refcnt {
    pub r_refs: ::std::os::raw::c_uint,
    pub r_traceidx: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_refcnt() {
    const UNINIT: ::std::mem::MaybeUninit<refcnt> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<refcnt>(),
        8usize,
        concat!("Size of: ", stringify!(refcnt))
    );
    assert_eq!(
        ::std::mem::align_of::<refcnt>(),
        4usize,
        concat!("Alignment of ", stringify!(refcnt))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r_refs) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(refcnt), "::", stringify!(r_refs))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r_traceidx) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(refcnt), "::", stringify!(r_traceidx))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct circq {
    pub next: *mut circq,
    pub prev: *mut circq,
}
#[test]
fn bindgen_test_layout_circq() {
    const UNINIT: ::std::mem::MaybeUninit<circq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<circq>(),
        16usize,
        concat!("Size of: ", stringify!(circq))
    );
    assert_eq!(
        ::std::mem::align_of::<circq>(),
        8usize,
        concat!("Alignment of ", stringify!(circq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(circq), "::", stringify!(next))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(circq), "::", stringify!(prev))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeout {
    pub to_list: circq,
    pub to_abstime: timespec,
    pub to_func: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub to_arg: *mut ::std::os::raw::c_void,
    pub to_process: *mut process,
    pub to_time: ::std::os::raw::c_int,
    pub to_flags: ::std::os::raw::c_int,
    pub to_kclock: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_timeout() {
    const UNINIT: ::std::mem::MaybeUninit<timeout> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timeout>(),
        72usize,
        concat!("Size of: ", stringify!(timeout))
    );
    assert_eq!(
        ::std::mem::align_of::<timeout>(),
        8usize,
        concat!("Alignment of ", stringify!(timeout))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).to_list) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(timeout), "::", stringify!(to_list))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).to_abstime) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(timeout), "::", stringify!(to_abstime))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).to_func) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(timeout), "::", stringify!(to_func))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).to_arg) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(timeout), "::", stringify!(to_arg))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).to_process) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(timeout), "::", stringify!(to_process))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).to_time) as usize - ptr as usize },
        56usize,
        concat!("Offset of field: ", stringify!(timeout), "::", stringify!(to_time))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).to_flags) as usize - ptr as usize },
        60usize,
        concat!("Offset of field: ", stringify!(timeout), "::", stringify!(to_flags))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).to_kclock) as usize - ptr as usize },
        64usize,
        concat!("Offset of field: ", stringify!(timeout), "::", stringify!(to_kclock))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeoutstat {
    pub tos_added: u64,
    pub tos_cancelled: u64,
    pub tos_deleted: u64,
    pub tos_late: u64,
    pub tos_pending: u64,
    pub tos_readded: u64,
    pub tos_rescheduled: u64,
    pub tos_run_softclock: u64,
    pub tos_run_thread: u64,
    pub tos_scheduled: u64,
    pub tos_softclocks: u64,
    pub tos_thread_wakeups: u64,
}
#[test]
fn bindgen_test_layout_timeoutstat() {
    const UNINIT: ::std::mem::MaybeUninit<timeoutstat> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timeoutstat>(),
        96usize,
        concat!("Size of: ", stringify!(timeoutstat))
    );
    assert_eq!(
        ::std::mem::align_of::<timeoutstat>(),
        8usize,
        concat!("Alignment of ", stringify!(timeoutstat))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tos_added) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeoutstat),
            "::",
            stringify!(tos_added)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tos_cancelled) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeoutstat),
            "::",
            stringify!(tos_cancelled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tos_deleted) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(timeoutstat),
            "::",
            stringify!(tos_deleted)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tos_late) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(timeoutstat), "::", stringify!(tos_late))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tos_pending) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(timeoutstat),
            "::",
            stringify!(tos_pending)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tos_readded) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(timeoutstat),
            "::",
            stringify!(tos_readded)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tos_rescheduled) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(timeoutstat),
            "::",
            stringify!(tos_rescheduled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tos_run_softclock) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(timeoutstat),
            "::",
            stringify!(tos_run_softclock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tos_run_thread) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(timeoutstat),
            "::",
            stringify!(tos_run_thread)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tos_scheduled) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(timeoutstat),
            "::",
            stringify!(tos_scheduled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tos_softclocks) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(timeoutstat),
            "::",
            stringify!(tos_softclocks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tos_thread_wakeups) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(timeoutstat),
            "::",
            stringify!(tos_thread_wakeups)
        )
    );
}
pub type in_addr_t = __in_addr_t;
pub type in_port_t = __in_port_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_addr {
    pub s_addr: in_addr_t,
}
#[test]
fn bindgen_test_layout_in_addr() {
    const UNINIT: ::std::mem::MaybeUninit<in_addr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<in_addr>(),
        4usize,
        concat!("Size of: ", stringify!(in_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<in_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(in_addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s_addr) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(in_addr), "::", stringify!(s_addr))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_in {
    pub sin_len: u_int8_t,
    pub sin_family: sa_family_t,
    pub sin_port: in_port_t,
    pub sin_addr: in_addr,
    pub sin_zero: [i8; 8usize],
}
#[test]
fn bindgen_test_layout_sockaddr_in() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr_in> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr_in>(),
        16usize,
        concat!("Size of: ", stringify!(sockaddr_in))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_in>(),
        4usize,
        concat!("Alignment of ", stringify!(sockaddr_in))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin_len) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sockaddr_in), "::", stringify!(sin_len))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin_family) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin_port) as usize - ptr as usize },
        2usize,
        concat!("Offset of field: ", stringify!(sockaddr_in), "::", stringify!(sin_port))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin_addr) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(sockaddr_in), "::", stringify!(sin_addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin_zero) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(sockaddr_in), "::", stringify!(sin_zero))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_opts {
    pub ip_dst: in_addr,
    pub ip_opts: [i8; 40usize],
}
#[test]
fn bindgen_test_layout_ip_opts() {
    const UNINIT: ::std::mem::MaybeUninit<ip_opts> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ip_opts>(),
        44usize,
        concat!("Size of: ", stringify!(ip_opts))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_opts>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_opts))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ip_dst) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ip_opts), "::", stringify!(ip_dst))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ip_opts) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(ip_opts), "::", stringify!(ip_opts))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreq {
    pub imr_multiaddr: in_addr,
    pub imr_interface: in_addr,
}
#[test]
fn bindgen_test_layout_ip_mreq() {
    const UNINIT: ::std::mem::MaybeUninit<ip_mreq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ip_mreq>(),
        8usize,
        concat!("Size of: ", stringify!(ip_mreq))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_mreq>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_mreq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imr_multiaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq),
            "::",
            stringify!(imr_multiaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imr_interface) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq),
            "::",
            stringify!(imr_interface)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreqn {
    pub imr_multiaddr: in_addr,
    pub imr_address: in_addr,
    pub imr_ifindex: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ip_mreqn() {
    const UNINIT: ::std::mem::MaybeUninit<ip_mreqn> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ip_mreqn>(),
        12usize,
        concat!("Size of: ", stringify!(ip_mreqn))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_mreqn>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_mreqn))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imr_multiaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreqn),
            "::",
            stringify!(imr_multiaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imr_address) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(ip_mreqn), "::", stringify!(imr_address))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imr_ifindex) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(ip_mreqn), "::", stringify!(imr_ifindex))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in6_addr {
    pub __u6_addr: in6_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union in6_addr__bindgen_ty_1 {
    pub __u6_addr8: [u_int8_t; 16usize],
    pub __u6_addr16: [u_int16_t; 8usize],
    pub __u6_addr32: [u_int32_t; 4usize],
}
#[test]
fn bindgen_test_layout_in6_addr__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<in6_addr__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<in6_addr__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(in6_addr__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<in6_addr__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_addr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__u6_addr8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__u6_addr16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__u6_addr32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr32)
        )
    );
}
#[test]
fn bindgen_test_layout_in6_addr() {
    const UNINIT: ::std::mem::MaybeUninit<in6_addr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<in6_addr>(),
        16usize,
        concat!("Size of: ", stringify!(in6_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<in6_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__u6_addr) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(in6_addr), "::", stringify!(__u6_addr))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sockaddr_in6 {
    pub sin6_len: u_int8_t,
    pub sin6_family: sa_family_t,
    pub sin6_port: in_port_t,
    pub sin6_flowinfo: u_int32_t,
    pub sin6_addr: in6_addr,
    pub sin6_scope_id: u_int32_t,
}
#[test]
fn bindgen_test_layout_sockaddr_in6() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr_in6> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr_in6>(),
        28usize,
        concat!("Size of: ", stringify!(sockaddr_in6))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_in6>(),
        4usize,
        concat!("Alignment of ", stringify!(sockaddr_in6))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin6_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin6_family) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin6_port) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_port)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin6_flowinfo) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_flowinfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin6_addr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin6_scope_id) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_scope_id)
        )
    );
}
unsafe extern "C" {
    pub static in6addr_any: in6_addr;
}
unsafe extern "C" {
    pub static in6addr_loopback: in6_addr;
}
unsafe extern "C" {
    pub static in6addr_intfacelocal_allnodes: in6_addr;
}
unsafe extern "C" {
    pub static in6addr_linklocal_allnodes: in6_addr;
}
unsafe extern "C" {
    pub static in6addr_linklocal_allrouters: in6_addr;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ipv6_mreq {
    pub ipv6mr_multiaddr: in6_addr,
    pub ipv6mr_interface: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_ipv6_mreq() {
    const UNINIT: ::std::mem::MaybeUninit<ipv6_mreq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ipv6_mreq>(),
        20usize,
        concat!("Size of: ", stringify!(ipv6_mreq))
    );
    assert_eq!(
        ::std::mem::align_of::<ipv6_mreq>(),
        4usize,
        concat!("Alignment of ", stringify!(ipv6_mreq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ipv6mr_multiaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ipv6_mreq),
            "::",
            stringify!(ipv6mr_multiaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ipv6mr_interface) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ipv6_mreq),
            "::",
            stringify!(ipv6mr_interface)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in6_pktinfo {
    pub ipi6_addr: in6_addr,
    pub ipi6_ifindex: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_in6_pktinfo() {
    const UNINIT: ::std::mem::MaybeUninit<in6_pktinfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<in6_pktinfo>(),
        20usize,
        concat!("Size of: ", stringify!(in6_pktinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<in6_pktinfo>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_pktinfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ipi6_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_pktinfo),
            "::",
            stringify!(ipi6_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ipi6_ifindex) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_pktinfo),
            "::",
            stringify!(ipi6_ifindex)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ip6_mtuinfo {
    pub ip6m_addr: sockaddr_in6,
    pub ip6m_mtu: u_int32_t,
}
#[test]
fn bindgen_test_layout_ip6_mtuinfo() {
    const UNINIT: ::std::mem::MaybeUninit<ip6_mtuinfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ip6_mtuinfo>(),
        32usize,
        concat!("Size of: ", stringify!(ip6_mtuinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<ip6_mtuinfo>(),
        4usize,
        concat!("Alignment of ", stringify!(ip6_mtuinfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ip6m_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip6_mtuinfo),
            "::",
            stringify!(ip6m_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ip6m_mtu) as usize - ptr as usize },
        28usize,
        concat!("Offset of field: ", stringify!(ip6_mtuinfo), "::", stringify!(ip6m_mtu))
    );
}
unsafe extern "C" {
    pub fn inet6_opt_init(arg1: *mut ::std::os::raw::c_void, arg2: socklen_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn inet6_opt_append(
        arg1: *mut ::std::os::raw::c_void,
        arg2: socklen_t,
        arg3: ::std::os::raw::c_int,
        arg4: u_int8_t,
        arg5: socklen_t,
        arg6: u_int8_t,
        arg7: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn inet6_opt_finish(
        arg1: *mut ::std::os::raw::c_void,
        arg2: socklen_t,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn inet6_opt_set_val(
        arg1: *mut ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_void,
        arg4: socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn inet6_opt_next(
        arg1: *mut ::std::os::raw::c_void,
        arg2: socklen_t,
        arg3: ::std::os::raw::c_int,
        arg4: *mut u_int8_t,
        arg5: *mut socklen_t,
        arg6: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn inet6_opt_find(
        arg1: *mut ::std::os::raw::c_void,
        arg2: socklen_t,
        arg3: ::std::os::raw::c_int,
        arg4: u_int8_t,
        arg5: *mut socklen_t,
        arg6: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn inet6_opt_get_val(
        arg1: *mut ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_void,
        arg4: socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn inet6_rth_space(arg1: ::std::os::raw::c_int, arg2: ::std::os::raw::c_int) -> socklen_t;
}
unsafe extern "C" {
    pub fn inet6_rth_init(
        arg1: *mut ::std::os::raw::c_void,
        arg2: socklen_t,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn inet6_rth_add(arg1: *mut ::std::os::raw::c_void, arg2: *const in6_addr) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn inet6_rth_reverse(
        arg1: *const ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn inet6_rth_segments(arg1: *const ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn inet6_rth_getaddr(arg1: *const ::std::os::raw::c_void, arg2: ::std::os::raw::c_int) -> *mut in6_addr;
}
unsafe extern "C" {
    pub fn bindresvport(arg1: ::std::os::raw::c_int, arg2: *mut sockaddr_in) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn bindresvport_sa(arg1: ::std::os::raw::c_int, arg2: *mut sockaddr) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct radix_node {
    pub rn_mklist: *mut radix_mask,
    pub rn_p: *mut radix_node,
    pub rn_b: ::std::os::raw::c_short,
    pub rn_bmask: ::std::os::raw::c_char,
    pub rn_flags: u_char,
    pub rn_u: radix_node__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union radix_node__bindgen_ty_1 {
    pub rn_leaf: radix_node__bindgen_ty_1__bindgen_ty_1,
    pub rn_node: radix_node__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct radix_node__bindgen_ty_1__bindgen_ty_1 {
    pub rn_Key: caddr_t,
    pub rn_Mask: caddr_t,
    pub rn_Dupedkey: *mut radix_node,
}
#[test]
fn bindgen_test_layout_radix_node__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<radix_node__bindgen_ty_1__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<radix_node__bindgen_ty_1__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(radix_node__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<radix_node__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(radix_node__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_Key) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(rn_Key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_Mask) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(rn_Mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_Dupedkey) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(rn_Dupedkey)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct radix_node__bindgen_ty_1__bindgen_ty_2 {
    pub rn_Off: ::std::os::raw::c_int,
    pub rn_L: *mut radix_node,
    pub rn_R: *mut radix_node,
}
#[test]
fn bindgen_test_layout_radix_node__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<radix_node__bindgen_ty_1__bindgen_ty_2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<radix_node__bindgen_ty_1__bindgen_ty_2>(),
        24usize,
        concat!("Size of: ", stringify!(radix_node__bindgen_ty_1__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<radix_node__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(radix_node__bindgen_ty_1__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_Off) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(rn_Off)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_L) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(rn_L)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_R) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(rn_R)
        )
    );
}
#[test]
fn bindgen_test_layout_radix_node__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<radix_node__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<radix_node__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(radix_node__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<radix_node__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(radix_node__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_leaf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node__bindgen_ty_1),
            "::",
            stringify!(rn_leaf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_node) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node__bindgen_ty_1),
            "::",
            stringify!(rn_node)
        )
    );
}
#[test]
fn bindgen_test_layout_radix_node() {
    const UNINIT: ::std::mem::MaybeUninit<radix_node> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<radix_node>(),
        48usize,
        concat!("Size of: ", stringify!(radix_node))
    );
    assert_eq!(
        ::std::mem::align_of::<radix_node>(),
        8usize,
        concat!("Alignment of ", stringify!(radix_node))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_mklist) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(radix_node), "::", stringify!(rn_mklist))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_p) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(radix_node), "::", stringify!(rn_p))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_b) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(radix_node), "::", stringify!(rn_b))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_bmask) as usize - ptr as usize },
        18usize,
        concat!("Offset of field: ", stringify!(radix_node), "::", stringify!(rn_bmask))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_flags) as usize - ptr as usize },
        19usize,
        concat!("Offset of field: ", stringify!(radix_node), "::", stringify!(rn_flags))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rn_u) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(radix_node), "::", stringify!(rn_u))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct radix_mask {
    pub rm_b: ::std::os::raw::c_short,
    pub rm_unused: ::std::os::raw::c_char,
    pub rm_flags: u_char,
    pub rm_mklist: *mut radix_mask,
    pub rm_rmu: radix_mask__bindgen_ty_1,
    pub rm_refs: ::std::os::raw::c_int,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union radix_mask__bindgen_ty_1 {
    pub rmu_mask: caddr_t,
    pub rmu_leaf: *mut radix_node,
}
#[test]
fn bindgen_test_layout_radix_mask__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<radix_mask__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<radix_mask__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(radix_mask__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<radix_mask__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(radix_mask__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rmu_mask) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_mask__bindgen_ty_1),
            "::",
            stringify!(rmu_mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rmu_leaf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_mask__bindgen_ty_1),
            "::",
            stringify!(rmu_leaf)
        )
    );
}
#[test]
fn bindgen_test_layout_radix_mask() {
    const UNINIT: ::std::mem::MaybeUninit<radix_mask> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<radix_mask>(),
        32usize,
        concat!("Size of: ", stringify!(radix_mask))
    );
    assert_eq!(
        ::std::mem::align_of::<radix_mask>(),
        8usize,
        concat!("Alignment of ", stringify!(radix_mask))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rm_b) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(radix_mask), "::", stringify!(rm_b))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rm_unused) as usize - ptr as usize },
        2usize,
        concat!("Offset of field: ", stringify!(radix_mask), "::", stringify!(rm_unused))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rm_flags) as usize - ptr as usize },
        3usize,
        concat!("Offset of field: ", stringify!(radix_mask), "::", stringify!(rm_flags))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rm_mklist) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(radix_mask), "::", stringify!(rm_mklist))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rm_rmu) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(radix_mask), "::", stringify!(rm_rmu))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rm_refs) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(radix_mask), "::", stringify!(rm_refs))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct radix_node_head {
    pub rnh_treetop: *mut radix_node,
    pub rnh_addrsize: ::std::os::raw::c_int,
    pub rnh_pktsize: ::std::os::raw::c_int,
    pub rnh_nodes: [radix_node; 3usize],
    pub rnh_rtableid: u_int,
}
#[test]
fn bindgen_test_layout_radix_node_head() {
    const UNINIT: ::std::mem::MaybeUninit<radix_node_head> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<radix_node_head>(),
        168usize,
        concat!("Size of: ", stringify!(radix_node_head))
    );
    assert_eq!(
        ::std::mem::align_of::<radix_node_head>(),
        8usize,
        concat!("Alignment of ", stringify!(radix_node_head))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rnh_treetop) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node_head),
            "::",
            stringify!(rnh_treetop)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rnh_addrsize) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node_head),
            "::",
            stringify!(rnh_addrsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rnh_pktsize) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node_head),
            "::",
            stringify!(rnh_pktsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rnh_nodes) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node_head),
            "::",
            stringify!(rnh_nodes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rnh_rtableid) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(radix_node_head),
            "::",
            stringify!(rnh_rtableid)
        )
    );
}
unsafe extern "C" {
    pub fn rn_init(arg1: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn rn_inithead(arg1: *mut *mut ::std::os::raw::c_void, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rn_walktree(
        arg1: *mut radix_node_head,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut radix_node,
                arg2: *mut ::std::os::raw::c_void,
                arg3: u_int,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rn_addroute(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_void,
        arg3: *mut radix_node_head,
        arg4: *mut radix_node,
        arg5: u_int8_t,
    ) -> *mut radix_node;
}
unsafe extern "C" {
    pub fn rn_delete(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_void,
        arg3: *mut radix_node_head,
        arg4: *mut radix_node,
    ) -> *mut radix_node;
}
unsafe extern "C" {
    pub fn rn_lookup(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_void,
        arg3: *mut radix_node_head,
    ) -> *mut radix_node;
}
unsafe extern "C" {
    pub fn rn_match(arg1: *mut ::std::os::raw::c_void, arg2: *mut radix_node_head) -> *mut radix_node;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rt_metrics {
    pub rmx_pksent: u_int64_t,
    pub rmx_expire: i64,
    pub rmx_locks: u_int,
    pub rmx_mtu: u_int,
    pub rmx_refcnt: u_int,
    pub rmx_hopcount: u_int,
    pub rmx_recvpipe: u_int,
    pub rmx_sendpipe: u_int,
    pub rmx_ssthresh: u_int,
    pub rmx_rtt: u_int,
    pub rmx_rttvar: u_int,
    pub rmx_pad: u_int,
}
#[test]
fn bindgen_test_layout_rt_metrics() {
    const UNINIT: ::std::mem::MaybeUninit<rt_metrics> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rt_metrics>(),
        56usize,
        concat!("Size of: ", stringify!(rt_metrics))
    );
    assert_eq!(
        ::std::mem::align_of::<rt_metrics>(),
        8usize,
        concat!("Alignment of ", stringify!(rt_metrics))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rmx_pksent) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rt_metrics),
            "::",
            stringify!(rmx_pksent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rmx_expire) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rt_metrics),
            "::",
            stringify!(rmx_expire)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rmx_locks) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(rt_metrics), "::", stringify!(rmx_locks))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rmx_mtu) as usize - ptr as usize },
        20usize,
        concat!("Offset of field: ", stringify!(rt_metrics), "::", stringify!(rmx_mtu))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rmx_refcnt) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rt_metrics),
            "::",
            stringify!(rmx_refcnt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rmx_hopcount) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(rt_metrics),
            "::",
            stringify!(rmx_hopcount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rmx_recvpipe) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(rt_metrics),
            "::",
            stringify!(rmx_recvpipe)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rmx_sendpipe) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(rt_metrics),
            "::",
            stringify!(rmx_sendpipe)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rmx_ssthresh) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(rt_metrics),
            "::",
            stringify!(rmx_ssthresh)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rmx_rtt) as usize - ptr as usize },
        44usize,
        concat!("Offset of field: ", stringify!(rt_metrics), "::", stringify!(rmx_rtt))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rmx_rttvar) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(rt_metrics),
            "::",
            stringify!(rmx_rttvar)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rmx_pad) as usize - ptr as usize },
        52usize,
        concat!("Offset of field: ", stringify!(rt_metrics), "::", stringify!(rmx_pad))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rtstat {
    pub rts_badredirect: u_int32_t,
    pub rts_dynamic: u_int32_t,
    pub rts_newgateway: u_int32_t,
    pub rts_unreach: u_int32_t,
    pub rts_wildcard: u_int32_t,
}
#[test]
fn bindgen_test_layout_rtstat() {
    const UNINIT: ::std::mem::MaybeUninit<rtstat> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rtstat>(),
        20usize,
        concat!("Size of: ", stringify!(rtstat))
    );
    assert_eq!(
        ::std::mem::align_of::<rtstat>(),
        4usize,
        concat!("Alignment of ", stringify!(rtstat))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rts_badredirect) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rtstat),
            "::",
            stringify!(rts_badredirect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rts_dynamic) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(rtstat), "::", stringify!(rts_dynamic))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rts_newgateway) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rtstat),
            "::",
            stringify!(rts_newgateway)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rts_unreach) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(rtstat), "::", stringify!(rts_unreach))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rts_wildcard) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(rtstat), "::", stringify!(rts_wildcard))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rt_tableinfo {
    pub rti_tableid: u_short,
    pub rti_domainid: u_short,
}
#[test]
fn bindgen_test_layout_rt_tableinfo() {
    const UNINIT: ::std::mem::MaybeUninit<rt_tableinfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rt_tableinfo>(),
        4usize,
        concat!("Size of: ", stringify!(rt_tableinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<rt_tableinfo>(),
        2usize,
        concat!("Alignment of ", stringify!(rt_tableinfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rti_tableid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rt_tableinfo),
            "::",
            stringify!(rti_tableid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rti_domainid) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rt_tableinfo),
            "::",
            stringify!(rti_domainid)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rt_msghdr {
    pub rtm_msglen: u_short,
    pub rtm_version: u_char,
    pub rtm_type: u_char,
    pub rtm_hdrlen: u_short,
    pub rtm_index: u_short,
    pub rtm_tableid: u_short,
    pub rtm_priority: u_char,
    pub rtm_mpls: u_char,
    pub rtm_addrs: ::std::os::raw::c_int,
    pub rtm_flags: ::std::os::raw::c_int,
    pub rtm_fmask: ::std::os::raw::c_int,
    pub rtm_pid: pid_t,
    pub rtm_seq: ::std::os::raw::c_int,
    pub rtm_errno: ::std::os::raw::c_int,
    pub rtm_inits: u_int,
    pub rtm_rmx: rt_metrics,
}
#[test]
fn bindgen_test_layout_rt_msghdr() {
    const UNINIT: ::std::mem::MaybeUninit<rt_msghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rt_msghdr>(),
        96usize,
        concat!("Size of: ", stringify!(rt_msghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<rt_msghdr>(),
        8usize,
        concat!("Alignment of ", stringify!(rt_msghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rtm_msglen) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(rt_msghdr), "::", stringify!(rtm_msglen))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rtm_version) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rt_msghdr),
            "::",
            stringify!(rtm_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rtm_type) as usize - ptr as usize },
        3usize,
        concat!("Offset of field: ", stringify!(rt_msghdr), "::", stringify!(rtm_type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rtm_hdrlen) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(rt_msghdr), "::", stringify!(rtm_hdrlen))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rtm_index) as usize - ptr as usize },
        6usize,
        concat!("Offset of field: ", stringify!(rt_msghdr), "::", stringify!(rtm_index))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rtm_tableid) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rt_msghdr),
            "::",
            stringify!(rtm_tableid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rtm_priority) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(rt_msghdr),
            "::",
            stringify!(rtm_priority)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rtm_mpls) as usize - ptr as usize },
        11usize,
        concat!("Offset of field: ", stringify!(rt_msghdr), "::", stringify!(rtm_mpls))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rtm_addrs) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(rt_msghdr), "::", stringify!(rtm_addrs))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rtm_flags) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(rt_msghdr), "::", stringify!(rtm_flags))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rtm_fmask) as usize - ptr as usize },
        20usize,
        concat!("Offset of field: ", stringify!(rt_msghdr), "::", stringify!(rtm_fmask))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rtm_pid) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(rt_msghdr), "::", stringify!(rtm_pid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rtm_seq) as usize - ptr as usize },
        28usize,
        concat!("Offset of field: ", stringify!(rt_msghdr), "::", stringify!(rtm_seq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rtm_errno) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(rt_msghdr), "::", stringify!(rtm_errno))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rtm_inits) as usize - ptr as usize },
        36usize,
        concat!("Offset of field: ", stringify!(rt_msghdr), "::", stringify!(rtm_inits))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rtm_rmx) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(rt_msghdr), "::", stringify!(rtm_rmx))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_rtlabel {
    pub sr_len: u_int8_t,
    pub sr_family: sa_family_t,
    pub sr_label: [::std::os::raw::c_char; 32usize],
}
#[test]
fn bindgen_test_layout_sockaddr_rtlabel() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr_rtlabel> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr_rtlabel>(),
        34usize,
        concat!("Size of: ", stringify!(sockaddr_rtlabel))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_rtlabel>(),
        1usize,
        concat!("Alignment of ", stringify!(sockaddr_rtlabel))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sr_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_rtlabel),
            "::",
            stringify!(sr_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sr_family) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_rtlabel),
            "::",
            stringify!(sr_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sr_label) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_rtlabel),
            "::",
            stringify!(sr_label)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_rtdns {
    pub sr_len: u_int8_t,
    pub sr_family: sa_family_t,
    pub sr_dns: [::std::os::raw::c_char; 128usize],
}
#[test]
fn bindgen_test_layout_sockaddr_rtdns() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr_rtdns> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr_rtdns>(),
        130usize,
        concat!("Size of: ", stringify!(sockaddr_rtdns))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_rtdns>(),
        1usize,
        concat!("Alignment of ", stringify!(sockaddr_rtdns))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sr_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_rtdns),
            "::",
            stringify!(sr_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sr_family) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_rtdns),
            "::",
            stringify!(sr_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sr_dns) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_rtdns),
            "::",
            stringify!(sr_dns)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_rtstatic {
    pub sr_len: u_int8_t,
    pub sr_family: sa_family_t,
    pub sr_static: [::std::os::raw::c_char; 128usize],
}
#[test]
fn bindgen_test_layout_sockaddr_rtstatic() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr_rtstatic> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr_rtstatic>(),
        130usize,
        concat!("Size of: ", stringify!(sockaddr_rtstatic))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_rtstatic>(),
        1usize,
        concat!("Alignment of ", stringify!(sockaddr_rtstatic))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sr_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_rtstatic),
            "::",
            stringify!(sr_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sr_family) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_rtstatic),
            "::",
            stringify!(sr_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sr_static) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_rtstatic),
            "::",
            stringify!(sr_static)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_rtsearch {
    pub sr_len: u_int8_t,
    pub sr_family: sa_family_t,
    pub sr_search: [::std::os::raw::c_char; 128usize],
}
#[test]
fn bindgen_test_layout_sockaddr_rtsearch() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr_rtsearch> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr_rtsearch>(),
        130usize,
        concat!("Size of: ", stringify!(sockaddr_rtsearch))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_rtsearch>(),
        1usize,
        concat!("Alignment of ", stringify!(sockaddr_rtsearch))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sr_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_rtsearch),
            "::",
            stringify!(sr_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sr_family) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_rtsearch),
            "::",
            stringify!(sr_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sr_search) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_rtsearch),
            "::",
            stringify!(sr_search)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rt_addrinfo {
    pub rti_addrs: ::std::os::raw::c_int,
    pub rti_info: [*const sockaddr; 15usize],
    pub rti_flags: ::std::os::raw::c_int,
    pub rti_ifa: *mut ifaddr,
    pub rti_rtm: *mut rt_msghdr,
    pub rti_mpls: u_char,
}
#[test]
fn bindgen_test_layout_rt_addrinfo() {
    const UNINIT: ::std::mem::MaybeUninit<rt_addrinfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rt_addrinfo>(),
        160usize,
        concat!("Size of: ", stringify!(rt_addrinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<rt_addrinfo>(),
        8usize,
        concat!("Alignment of ", stringify!(rt_addrinfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rti_addrs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rt_addrinfo),
            "::",
            stringify!(rti_addrs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rti_info) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(rt_addrinfo), "::", stringify!(rti_info))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rti_flags) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(rt_addrinfo),
            "::",
            stringify!(rti_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rti_ifa) as usize - ptr as usize },
        136usize,
        concat!("Offset of field: ", stringify!(rt_addrinfo), "::", stringify!(rti_ifa))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rti_rtm) as usize - ptr as usize },
        144usize,
        concat!("Offset of field: ", stringify!(rt_addrinfo), "::", stringify!(rti_rtm))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rti_mpls) as usize - ptr as usize },
        152usize,
        concat!("Offset of field: ", stringify!(rt_addrinfo), "::", stringify!(rti_mpls))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct route {
    pub ro_rt: *mut rtentry,
    pub ro_generation: u_long,
    pub ro_tableid: u_long,
    pub __bindgen_anon_1: route__bindgen_ty_1,
    pub __bindgen_anon_2: route__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union route__bindgen_ty_1 {
    pub ro_dstsa: sockaddr,
    pub ro_dstsin: sockaddr_in,
    pub ro_dstsin6: sockaddr_in6,
}
#[test]
fn bindgen_test_layout_route__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<route__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<route__bindgen_ty_1>(),
        28usize,
        concat!("Size of: ", stringify!(route__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<route__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(route__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ro_dstsa) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(route__bindgen_ty_1),
            "::",
            stringify!(ro_dstsa)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ro_dstsin) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(route__bindgen_ty_1),
            "::",
            stringify!(ro_dstsin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ro_dstsin6) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(route__bindgen_ty_1),
            "::",
            stringify!(ro_dstsin6)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union route__bindgen_ty_2 {
    pub ro_srcin: in_addr,
    pub ro_srcin6: in6_addr,
}
#[test]
fn bindgen_test_layout_route__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<route__bindgen_ty_2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<route__bindgen_ty_2>(),
        16usize,
        concat!("Size of: ", stringify!(route__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<route__bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(route__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ro_srcin) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(route__bindgen_ty_2),
            "::",
            stringify!(ro_srcin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ro_srcin6) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(route__bindgen_ty_2),
            "::",
            stringify!(ro_srcin6)
        )
    );
}
#[test]
fn bindgen_test_layout_route() {
    const UNINIT: ::std::mem::MaybeUninit<route> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<route>(),
        72usize,
        concat!("Size of: ", stringify!(route))
    );
    assert_eq!(
        ::std::mem::align_of::<route>(),
        8usize,
        concat!("Alignment of ", stringify!(route))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ro_rt) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(route), "::", stringify!(ro_rt))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ro_generation) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(route), "::", stringify!(ro_generation))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ro_tableid) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(route), "::", stringify!(ro_tableid))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip6_hdr {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mbuf_list {
    _unused: [u8; 0],
}
pub type pf_refcnt_t = refcnt;
pub const PF_INOUT: _bindgen_ty_1 = 0;
pub const PF_IN: _bindgen_ty_1 = 1;
pub const PF_OUT: _bindgen_ty_1 = 2;
pub const PF_FWD: _bindgen_ty_1 = 3;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
pub const PF_PASS: _bindgen_ty_2 = 0;
pub const PF_DROP: _bindgen_ty_2 = 1;
pub const PF_SCRUB: _bindgen_ty_2 = 2;
pub const PF_NOSCRUB: _bindgen_ty_2 = 3;
pub const PF_NAT: _bindgen_ty_2 = 4;
pub const PF_NONAT: _bindgen_ty_2 = 5;
pub const PF_BINAT: _bindgen_ty_2 = 6;
pub const PF_NOBINAT: _bindgen_ty_2 = 7;
pub const PF_RDR: _bindgen_ty_2 = 8;
pub const PF_NORDR: _bindgen_ty_2 = 9;
pub const PF_SYNPROXY_DROP: _bindgen_ty_2 = 10;
pub const PF_DEFER: _bindgen_ty_2 = 11;
pub const PF_MATCH: _bindgen_ty_2 = 12;
pub const PF_DIVERT: _bindgen_ty_2 = 13;
pub const PF_RT: _bindgen_ty_2 = 14;
pub const PF_AFRT: _bindgen_ty_2 = 15;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
pub const PF_TRANS_RULESET: _bindgen_ty_3 = 0;
pub const PF_TRANS_TABLE: _bindgen_ty_3 = 1;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
pub const PF_OP_NONE: _bindgen_ty_4 = 0;
pub const PF_OP_IRG: _bindgen_ty_4 = 1;
pub const PF_OP_EQ: _bindgen_ty_4 = 2;
pub const PF_OP_NE: _bindgen_ty_4 = 3;
pub const PF_OP_LT: _bindgen_ty_4 = 4;
pub const PF_OP_LE: _bindgen_ty_4 = 5;
pub const PF_OP_GT: _bindgen_ty_4 = 6;
pub const PF_OP_GE: _bindgen_ty_4 = 7;
pub const PF_OP_XRG: _bindgen_ty_4 = 8;
pub const PF_OP_RRG: _bindgen_ty_4 = 9;
pub type _bindgen_ty_4 = ::std::os::raw::c_uint;
pub const PF_CHANGE_NONE: _bindgen_ty_5 = 0;
pub const PF_CHANGE_ADD_HEAD: _bindgen_ty_5 = 1;
pub const PF_CHANGE_ADD_TAIL: _bindgen_ty_5 = 2;
pub const PF_CHANGE_ADD_BEFORE: _bindgen_ty_5 = 3;
pub const PF_CHANGE_ADD_AFTER: _bindgen_ty_5 = 4;
pub const PF_CHANGE_REMOVE: _bindgen_ty_5 = 5;
pub const PF_CHANGE_GET_TICKET: _bindgen_ty_5 = 6;
pub type _bindgen_ty_5 = ::std::os::raw::c_uint;
pub const PF_GET_NONE: _bindgen_ty_6 = 0;
pub const PF_GET_CLR_CNTR: _bindgen_ty_6 = 1;
pub type _bindgen_ty_6 = ::std::os::raw::c_uint;
pub const PF_SK_WIRE: _bindgen_ty_7 = 0;
pub const PF_SK_STACK: _bindgen_ty_7 = 1;
pub const PF_SK_BOTH: _bindgen_ty_7 = 2;
pub type _bindgen_ty_7 = ::std::os::raw::c_uint;
pub const PF_PEER_SRC: _bindgen_ty_8 = 0;
pub const PF_PEER_DST: _bindgen_ty_8 = 1;
pub const PF_PEER_BOTH: _bindgen_ty_8 = 2;
pub type _bindgen_ty_8 = ::std::os::raw::c_uint;
pub const PFTM_TCP_FIRST_PACKET: _bindgen_ty_9 = 0;
pub const PFTM_TCP_OPENING: _bindgen_ty_9 = 1;
pub const PFTM_TCP_ESTABLISHED: _bindgen_ty_9 = 2;
pub const PFTM_TCP_CLOSING: _bindgen_ty_9 = 3;
pub const PFTM_TCP_FIN_WAIT: _bindgen_ty_9 = 4;
pub const PFTM_TCP_CLOSED: _bindgen_ty_9 = 5;
pub const PFTM_UDP_FIRST_PACKET: _bindgen_ty_9 = 6;
pub const PFTM_UDP_SINGLE: _bindgen_ty_9 = 7;
pub const PFTM_UDP_MULTIPLE: _bindgen_ty_9 = 8;
pub const PFTM_ICMP_FIRST_PACKET: _bindgen_ty_9 = 9;
pub const PFTM_ICMP_ERROR_REPLY: _bindgen_ty_9 = 10;
pub const PFTM_OTHER_FIRST_PACKET: _bindgen_ty_9 = 11;
pub const PFTM_OTHER_SINGLE: _bindgen_ty_9 = 12;
pub const PFTM_OTHER_MULTIPLE: _bindgen_ty_9 = 13;
pub const PFTM_FRAG: _bindgen_ty_9 = 14;
pub const PFTM_INTERVAL: _bindgen_ty_9 = 15;
pub const PFTM_ADAPTIVE_START: _bindgen_ty_9 = 16;
pub const PFTM_ADAPTIVE_END: _bindgen_ty_9 = 17;
pub const PFTM_SRC_NODE: _bindgen_ty_9 = 18;
pub const PFTM_TS_DIFF: _bindgen_ty_9 = 19;
pub const PFTM_MAX: _bindgen_ty_9 = 20;
pub const PFTM_PURGE: _bindgen_ty_9 = 21;
pub const PFTM_UNLINKED: _bindgen_ty_9 = 22;
pub type _bindgen_ty_9 = ::std::os::raw::c_uint;
pub const PF_NOPFROUTE: _bindgen_ty_10 = 0;
pub const PF_ROUTETO: _bindgen_ty_10 = 1;
pub const PF_DUPTO: _bindgen_ty_10 = 2;
pub const PF_REPLYTO: _bindgen_ty_10 = 3;
pub type _bindgen_ty_10 = ::std::os::raw::c_uint;
pub const PF_LIMIT_STATES: _bindgen_ty_11 = 0;
pub const PF_LIMIT_SRC_NODES: _bindgen_ty_11 = 1;
pub const PF_LIMIT_FRAGS: _bindgen_ty_11 = 2;
pub const PF_LIMIT_TABLES: _bindgen_ty_11 = 3;
pub const PF_LIMIT_TABLE_ENTRIES: _bindgen_ty_11 = 4;
pub const PF_LIMIT_PKTDELAY_PKTS: _bindgen_ty_11 = 5;
pub const PF_LIMIT_ANCHORS: _bindgen_ty_11 = 6;
pub const PF_LIMIT_MAX: _bindgen_ty_11 = 7;
pub type _bindgen_ty_11 = ::std::os::raw::c_uint;
pub const PF_POOL_NONE: _bindgen_ty_12 = 0;
pub const PF_POOL_BITMASK: _bindgen_ty_12 = 1;
pub const PF_POOL_RANDOM: _bindgen_ty_12 = 2;
pub const PF_POOL_SRCHASH: _bindgen_ty_12 = 3;
pub const PF_POOL_ROUNDROBIN: _bindgen_ty_12 = 4;
pub const PF_POOL_LEASTSTATES: _bindgen_ty_12 = 5;
pub type _bindgen_ty_12 = ::std::os::raw::c_uint;
pub const PF_ADDR_ADDRMASK: _bindgen_ty_13 = 0;
pub const PF_ADDR_NOROUTE: _bindgen_ty_13 = 1;
pub const PF_ADDR_DYNIFTL: _bindgen_ty_13 = 2;
pub const PF_ADDR_TABLE: _bindgen_ty_13 = 3;
pub const PF_ADDR_RTLABEL: _bindgen_ty_13 = 4;
pub const PF_ADDR_URPFFAILED: _bindgen_ty_13 = 5;
pub const PF_ADDR_RANGE: _bindgen_ty_13 = 6;
pub const PF_ADDR_NONE: _bindgen_ty_13 = 7;
pub type _bindgen_ty_13 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pf_addr {
    pub pfa: pf_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pf_addr__bindgen_ty_1 {
    pub v4: in_addr,
    pub v6: in6_addr,
    pub addr8: [u_int8_t; 16usize],
    pub addr16: [u_int16_t; 8usize],
    pub addr32: [u_int32_t; 4usize],
}
#[test]
fn bindgen_test_layout_pf_addr__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<pf_addr__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_addr__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(pf_addr__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_addr__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(pf_addr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v4) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr__bindgen_ty_1),
            "::",
            stringify!(v4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v6) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr__bindgen_ty_1),
            "::",
            stringify!(v6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr__bindgen_ty_1),
            "::",
            stringify!(addr8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr__bindgen_ty_1),
            "::",
            stringify!(addr16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr__bindgen_ty_1),
            "::",
            stringify!(addr32)
        )
    );
}
#[test]
fn bindgen_test_layout_pf_addr() {
    const UNINIT: ::std::mem::MaybeUninit<pf_addr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_addr>(),
        16usize,
        concat!("Size of: ", stringify!(pf_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(pf_addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfa) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(pf_addr), "::", stringify!(pfa))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pf_addr_wrap {
    pub v: pf_addr_wrap__bindgen_ty_1,
    pub p: pf_addr_wrap__bindgen_ty_2,
    pub type_: u_int8_t,
    pub iflags: u_int8_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pf_addr_wrap__bindgen_ty_1 {
    pub a: pf_addr_wrap__bindgen_ty_1__bindgen_ty_1,
    pub ifname: [::std::os::raw::c_char; 16usize],
    pub tblname: [::std::os::raw::c_char; 32usize],
    pub rtlabelname: [::std::os::raw::c_char; 32usize],
    pub rtlabel: u_int32_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pf_addr_wrap__bindgen_ty_1__bindgen_ty_1 {
    pub addr: pf_addr,
    pub mask: pf_addr,
}
#[test]
fn bindgen_test_layout_pf_addr_wrap__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<pf_addr_wrap__bindgen_ty_1__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_addr_wrap__bindgen_ty_1__bindgen_ty_1>(),
        32usize,
        concat!("Size of: ", stringify!(pf_addr_wrap__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_addr_wrap__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(pf_addr_wrap__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mask) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(mask)
        )
    );
}
#[test]
fn bindgen_test_layout_pf_addr_wrap__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<pf_addr_wrap__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_addr_wrap__bindgen_ty_1>(),
        32usize,
        concat!("Size of: ", stringify!(pf_addr_wrap__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_addr_wrap__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(pf_addr_wrap__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap__bindgen_ty_1),
            "::",
            stringify!(a)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifname) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap__bindgen_ty_1),
            "::",
            stringify!(ifname)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tblname) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap__bindgen_ty_1),
            "::",
            stringify!(tblname)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rtlabelname) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap__bindgen_ty_1),
            "::",
            stringify!(rtlabelname)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rtlabel) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap__bindgen_ty_1),
            "::",
            stringify!(rtlabel)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pf_addr_wrap__bindgen_ty_2 {
    pub dyn_: *mut pfi_dynaddr,
    pub tbl: *mut pfr_ktable,
    pub dyncnt: ::std::os::raw::c_int,
    pub tblcnt: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pf_addr_wrap__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<pf_addr_wrap__bindgen_ty_2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_addr_wrap__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(pf_addr_wrap__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_addr_wrap__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_addr_wrap__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dyn_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap__bindgen_ty_2),
            "::",
            stringify!(dyn_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tbl) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap__bindgen_ty_2),
            "::",
            stringify!(tbl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dyncnt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap__bindgen_ty_2),
            "::",
            stringify!(dyncnt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tblcnt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap__bindgen_ty_2),
            "::",
            stringify!(tblcnt)
        )
    );
}
#[test]
fn bindgen_test_layout_pf_addr_wrap() {
    const UNINIT: ::std::mem::MaybeUninit<pf_addr_wrap> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_addr_wrap>(),
        48usize,
        concat!("Size of: ", stringify!(pf_addr_wrap))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_addr_wrap>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_addr_wrap))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(pf_addr_wrap), "::", stringify!(v))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(pf_addr_wrap), "::", stringify!(p))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(pf_addr_wrap), "::", stringify!(type_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iflags) as usize - ptr as usize },
        41usize,
        concat!("Offset of field: ", stringify!(pf_addr_wrap), "::", stringify!(iflags))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_rule_uid {
    pub uid: [uid_t; 2usize],
    pub op: u_int8_t,
}
#[test]
fn bindgen_test_layout_pf_rule_uid() {
    const UNINIT: ::std::mem::MaybeUninit<pf_rule_uid> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_rule_uid>(),
        12usize,
        concat!("Size of: ", stringify!(pf_rule_uid))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_rule_uid>(),
        4usize,
        concat!("Alignment of ", stringify!(pf_rule_uid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uid) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(pf_rule_uid), "::", stringify!(uid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).op) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(pf_rule_uid), "::", stringify!(op))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_rule_gid {
    pub gid: [uid_t; 2usize],
    pub op: u_int8_t,
}
#[test]
fn bindgen_test_layout_pf_rule_gid() {
    const UNINIT: ::std::mem::MaybeUninit<pf_rule_gid> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_rule_gid>(),
        12usize,
        concat!("Size of: ", stringify!(pf_rule_gid))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_rule_gid>(),
        4usize,
        concat!("Alignment of ", stringify!(pf_rule_gid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gid) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(pf_rule_gid), "::", stringify!(gid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).op) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(pf_rule_gid), "::", stringify!(op))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pf_rule_addr {
    pub addr: pf_addr_wrap,
    pub port: [u_int16_t; 2usize],
    pub neg: u_int8_t,
    pub port_op: u_int8_t,
    pub weight: u_int16_t,
}
#[test]
fn bindgen_test_layout_pf_rule_addr() {
    const UNINIT: ::std::mem::MaybeUninit<pf_rule_addr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_rule_addr>(),
        56usize,
        concat!("Size of: ", stringify!(pf_rule_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_rule_addr>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_rule_addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(pf_rule_addr), "::", stringify!(addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(pf_rule_addr), "::", stringify!(port))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).neg) as usize - ptr as usize },
        52usize,
        concat!("Offset of field: ", stringify!(pf_rule_addr), "::", stringify!(neg))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).port_op) as usize - ptr as usize },
        53usize,
        concat!("Offset of field: ", stringify!(pf_rule_addr), "::", stringify!(port_op))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).weight) as usize - ptr as usize },
        54usize,
        concat!("Offset of field: ", stringify!(pf_rule_addr), "::", stringify!(weight))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_threshold {
    pub limit: u_int32_t,
    pub seconds: u_int32_t,
    pub count: u_int32_t,
    pub last: u_int32_t,
}
#[test]
fn bindgen_test_layout_pf_threshold() {
    const UNINIT: ::std::mem::MaybeUninit<pf_threshold> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_threshold>(),
        16usize,
        concat!("Size of: ", stringify!(pf_threshold))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_threshold>(),
        4usize,
        concat!("Alignment of ", stringify!(pf_threshold))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).limit) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(pf_threshold), "::", stringify!(limit))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seconds) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(pf_threshold), "::", stringify!(seconds))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(pf_threshold), "::", stringify!(count))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).last) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(pf_threshold), "::", stringify!(last))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pf_poolhashkey {
    pub pfk: pf_poolhashkey__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pf_poolhashkey__bindgen_ty_1 {
    pub key8: [u_int8_t; 16usize],
    pub key16: [u_int16_t; 8usize],
    pub key32: [u_int32_t; 4usize],
}
#[test]
fn bindgen_test_layout_pf_poolhashkey__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<pf_poolhashkey__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_poolhashkey__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(pf_poolhashkey__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_poolhashkey__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(pf_poolhashkey__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_poolhashkey__bindgen_ty_1),
            "::",
            stringify!(key8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_poolhashkey__bindgen_ty_1),
            "::",
            stringify!(key16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_poolhashkey__bindgen_ty_1),
            "::",
            stringify!(key32)
        )
    );
}
#[test]
fn bindgen_test_layout_pf_poolhashkey() {
    const UNINIT: ::std::mem::MaybeUninit<pf_poolhashkey> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_poolhashkey>(),
        16usize,
        concat!("Size of: ", stringify!(pf_poolhashkey))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_poolhashkey>(),
        4usize,
        concat!("Alignment of ", stringify!(pf_poolhashkey))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfk) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(pf_poolhashkey), "::", stringify!(pfk))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pf_pool {
    pub addr: pf_addr_wrap,
    pub key: pf_poolhashkey,
    pub counter: pf_addr,
    pub ifname: [::std::os::raw::c_char; 16usize],
    pub kif: *mut pfi_kif,
    pub tblidx: ::std::os::raw::c_int,
    pub states: u_int64_t,
    pub curweight: ::std::os::raw::c_int,
    pub weight: u_int16_t,
    pub proxy_port: [u_int16_t; 2usize],
    pub port_op: u_int8_t,
    pub opts: u_int8_t,
}
#[test]
fn bindgen_test_layout_pf_pool() {
    const UNINIT: ::std::mem::MaybeUninit<pf_pool> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_pool>(),
        136usize,
        concat!("Size of: ", stringify!(pf_pool))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_pool>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_pool))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(pf_pool), "::", stringify!(addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(pf_pool), "::", stringify!(key))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).counter) as usize - ptr as usize },
        64usize,
        concat!("Offset of field: ", stringify!(pf_pool), "::", stringify!(counter))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifname) as usize - ptr as usize },
        80usize,
        concat!("Offset of field: ", stringify!(pf_pool), "::", stringify!(ifname))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).kif) as usize - ptr as usize },
        96usize,
        concat!("Offset of field: ", stringify!(pf_pool), "::", stringify!(kif))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tblidx) as usize - ptr as usize },
        104usize,
        concat!("Offset of field: ", stringify!(pf_pool), "::", stringify!(tblidx))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).states) as usize - ptr as usize },
        112usize,
        concat!("Offset of field: ", stringify!(pf_pool), "::", stringify!(states))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).curweight) as usize - ptr as usize },
        120usize,
        concat!("Offset of field: ", stringify!(pf_pool), "::", stringify!(curweight))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).weight) as usize - ptr as usize },
        124usize,
        concat!("Offset of field: ", stringify!(pf_pool), "::", stringify!(weight))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).proxy_port) as usize - ptr as usize },
        126usize,
        concat!("Offset of field: ", stringify!(pf_pool), "::", stringify!(proxy_port))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).port_op) as usize - ptr as usize },
        130usize,
        concat!("Offset of field: ", stringify!(pf_pool), "::", stringify!(port_op))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).opts) as usize - ptr as usize },
        131usize,
        concat!("Offset of field: ", stringify!(pf_pool), "::", stringify!(opts))
    );
}
pub type pf_osfp_t = u_int32_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_osfp_entry {
    pub fp_entry: pf_osfp_entry__bindgen_ty_1,
    pub fp_os: pf_osfp_t,
    pub fp_enflags: ::std::os::raw::c_int,
    pub fp_class_nm: [u_char; 32usize],
    pub fp_version_nm: [u_char; 32usize],
    pub fp_subtype_nm: [u_char; 32usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_osfp_entry__bindgen_ty_1 {
    pub sle_next: *mut pf_osfp_entry,
}
#[test]
fn bindgen_test_layout_pf_osfp_entry__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<pf_osfp_entry__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_osfp_entry__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(pf_osfp_entry__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_osfp_entry__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_osfp_entry__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sle_next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_osfp_entry__bindgen_ty_1),
            "::",
            stringify!(sle_next)
        )
    );
}
#[test]
fn bindgen_test_layout_pf_osfp_entry() {
    const UNINIT: ::std::mem::MaybeUninit<pf_osfp_entry> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_osfp_entry>(),
        112usize,
        concat!("Size of: ", stringify!(pf_osfp_entry))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_osfp_entry>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_osfp_entry))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_entry) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_osfp_entry),
            "::",
            stringify!(fp_entry)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_os) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(pf_osfp_entry), "::", stringify!(fp_os))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_enflags) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_osfp_entry),
            "::",
            stringify!(fp_enflags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_class_nm) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_osfp_entry),
            "::",
            stringify!(fp_class_nm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_version_nm) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_osfp_entry),
            "::",
            stringify!(fp_version_nm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_subtype_nm) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_osfp_entry),
            "::",
            stringify!(fp_subtype_nm)
        )
    );
}
pub type pf_tcpopts_t = u_int64_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_os_fingerprint {
    pub fp_oses: pf_os_fingerprint_pf_osfp_enlist,
    pub fp_tcpopts: pf_tcpopts_t,
    pub fp_wsize: u_int16_t,
    pub fp_psize: u_int16_t,
    pub fp_mss: u_int16_t,
    pub fp_flags: u_int16_t,
    pub fp_optcnt: u_int8_t,
    pub fp_wscale: u_int8_t,
    pub fp_ttl: u_int8_t,
    pub fp_next: pf_os_fingerprint__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_os_fingerprint_pf_osfp_enlist {
    pub slh_first: *mut pf_osfp_entry,
}
#[test]
fn bindgen_test_layout_pf_os_fingerprint_pf_osfp_enlist() {
    const UNINIT: ::std::mem::MaybeUninit<pf_os_fingerprint_pf_osfp_enlist> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_os_fingerprint_pf_osfp_enlist>(),
        8usize,
        concat!("Size of: ", stringify!(pf_os_fingerprint_pf_osfp_enlist))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_os_fingerprint_pf_osfp_enlist>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_os_fingerprint_pf_osfp_enlist))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slh_first) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_os_fingerprint_pf_osfp_enlist),
            "::",
            stringify!(slh_first)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_os_fingerprint__bindgen_ty_1 {
    pub sle_next: *mut pf_os_fingerprint,
}
#[test]
fn bindgen_test_layout_pf_os_fingerprint__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<pf_os_fingerprint__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_os_fingerprint__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(pf_os_fingerprint__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_os_fingerprint__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_os_fingerprint__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sle_next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_os_fingerprint__bindgen_ty_1),
            "::",
            stringify!(sle_next)
        )
    );
}
#[test]
fn bindgen_test_layout_pf_os_fingerprint() {
    const UNINIT: ::std::mem::MaybeUninit<pf_os_fingerprint> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_os_fingerprint>(),
        40usize,
        concat!("Size of: ", stringify!(pf_os_fingerprint))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_os_fingerprint>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_os_fingerprint))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_oses) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_os_fingerprint),
            "::",
            stringify!(fp_oses)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_tcpopts) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_os_fingerprint),
            "::",
            stringify!(fp_tcpopts)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_wsize) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_os_fingerprint),
            "::",
            stringify!(fp_wsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_psize) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_os_fingerprint),
            "::",
            stringify!(fp_psize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_mss) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_os_fingerprint),
            "::",
            stringify!(fp_mss)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_flags) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_os_fingerprint),
            "::",
            stringify!(fp_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_optcnt) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_os_fingerprint),
            "::",
            stringify!(fp_optcnt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_wscale) as usize - ptr as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_os_fingerprint),
            "::",
            stringify!(fp_wscale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_ttl) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_os_fingerprint),
            "::",
            stringify!(fp_ttl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_next) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_os_fingerprint),
            "::",
            stringify!(fp_next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_osfp_ioctl {
    pub fp_os: pf_osfp_entry,
    pub fp_tcpopts: pf_tcpopts_t,
    pub fp_wsize: u_int16_t,
    pub fp_psize: u_int16_t,
    pub fp_mss: u_int16_t,
    pub fp_flags: u_int16_t,
    pub fp_optcnt: u_int8_t,
    pub fp_wscale: u_int8_t,
    pub fp_ttl: u_int8_t,
    pub fp_getnum: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pf_osfp_ioctl() {
    const UNINIT: ::std::mem::MaybeUninit<pf_osfp_ioctl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_osfp_ioctl>(),
        136usize,
        concat!("Size of: ", stringify!(pf_osfp_ioctl))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_osfp_ioctl>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_osfp_ioctl))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_os) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(pf_osfp_ioctl), "::", stringify!(fp_os))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_tcpopts) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_osfp_ioctl),
            "::",
            stringify!(fp_tcpopts)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_wsize) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_osfp_ioctl),
            "::",
            stringify!(fp_wsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_psize) as usize - ptr as usize },
        122usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_osfp_ioctl),
            "::",
            stringify!(fp_psize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_mss) as usize - ptr as usize },
        124usize,
        concat!("Offset of field: ", stringify!(pf_osfp_ioctl), "::", stringify!(fp_mss))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_flags) as usize - ptr as usize },
        126usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_osfp_ioctl),
            "::",
            stringify!(fp_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_optcnt) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_osfp_ioctl),
            "::",
            stringify!(fp_optcnt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_wscale) as usize - ptr as usize },
        129usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_osfp_ioctl),
            "::",
            stringify!(fp_wscale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_ttl) as usize - ptr as usize },
        130usize,
        concat!("Offset of field: ", stringify!(pf_osfp_ioctl), "::", stringify!(fp_ttl))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_getnum) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_osfp_ioctl),
            "::",
            stringify!(fp_getnum)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_rule_actions {
    pub rtableid: ::std::os::raw::c_int,
    pub qid: u_int16_t,
    pub pqid: u_int16_t,
    pub max_mss: u_int16_t,
    pub flags: u_int16_t,
    pub delay: u_int16_t,
    pub log: u_int8_t,
    pub set_tos: u_int8_t,
    pub min_ttl: u_int8_t,
    pub set_prio: [u_int8_t; 2usize],
    pub pad: [u_int8_t; 1usize],
}
#[test]
fn bindgen_test_layout_pf_rule_actions() {
    const UNINIT: ::std::mem::MaybeUninit<pf_rule_actions> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_rule_actions>(),
        20usize,
        concat!("Size of: ", stringify!(pf_rule_actions))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_rule_actions>(),
        4usize,
        concat!("Alignment of ", stringify!(pf_rule_actions))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rtableid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule_actions),
            "::",
            stringify!(rtableid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qid) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(pf_rule_actions), "::", stringify!(qid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pqid) as usize - ptr as usize },
        6usize,
        concat!("Offset of field: ", stringify!(pf_rule_actions), "::", stringify!(pqid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_mss) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule_actions),
            "::",
            stringify!(max_mss)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule_actions),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).delay) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule_actions),
            "::",
            stringify!(delay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).log) as usize - ptr as usize },
        14usize,
        concat!("Offset of field: ", stringify!(pf_rule_actions), "::", stringify!(log))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).set_tos) as usize - ptr as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule_actions),
            "::",
            stringify!(set_tos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_ttl) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule_actions),
            "::",
            stringify!(min_ttl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).set_prio) as usize - ptr as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule_actions),
            "::",
            stringify!(set_prio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad) as usize - ptr as usize },
        19usize,
        concat!("Offset of field: ", stringify!(pf_rule_actions), "::", stringify!(pad))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pf_rule_ptr {
    pub ptr: *mut pf_rule,
    pub nr: u_int32_t,
}
#[test]
fn bindgen_test_layout_pf_rule_ptr() {
    const UNINIT: ::std::mem::MaybeUninit<pf_rule_ptr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_rule_ptr>(),
        8usize,
        concat!("Size of: ", stringify!(pf_rule_ptr))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_rule_ptr>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_rule_ptr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ptr) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(pf_rule_ptr), "::", stringify!(ptr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nr) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(pf_rule_ptr), "::", stringify!(nr))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pf_rule {
    pub src: pf_rule_addr,
    pub dst: pf_rule_addr,
    pub skip: [pf_rule_ptr; 9usize],
    pub label: [::std::os::raw::c_char; 64usize],
    pub ifname: [::std::os::raw::c_char; 16usize],
    pub rcv_ifname: [::std::os::raw::c_char; 16usize],
    pub qname: [::std::os::raw::c_char; 64usize],
    pub pqname: [::std::os::raw::c_char; 64usize],
    pub tagname: [::std::os::raw::c_char; 64usize],
    pub match_tagname: [::std::os::raw::c_char; 64usize],
    pub overload_tblname: [::std::os::raw::c_char; 32usize],
    pub entries: pf_rule__bindgen_ty_1,
    pub nat: pf_pool,
    pub rdr: pf_pool,
    pub route: pf_pool,
    pub pktrate: pf_threshold,
    pub evaluations: u_int64_t,
    pub packets: [u_int64_t; 2usize],
    pub bytes: [u_int64_t; 2usize],
    pub kif: *mut pfi_kif,
    pub rcv_kif: *mut pfi_kif,
    pub anchor: *mut pf_anchor,
    pub overload_tbl: *mut pfr_ktable,
    pub os_fingerprint: pf_osfp_t,
    pub rtableid: ::std::os::raw::c_int,
    pub onrdomain: ::std::os::raw::c_int,
    pub timeout: [u_int32_t; 20usize],
    pub states_cur: u_int32_t,
    pub states_tot: u_int32_t,
    pub max_states: u_int32_t,
    pub src_nodes: u_int32_t,
    pub max_src_nodes: u_int32_t,
    pub max_src_states: u_int32_t,
    pub max_src_conn: u_int32_t,
    pub max_src_conn_rate: pf_rule__bindgen_ty_2,
    pub qid: u_int32_t,
    pub pqid: u_int32_t,
    pub rt_listid: u_int32_t,
    pub nr: u_int32_t,
    pub prob: u_int32_t,
    pub cuid: uid_t,
    pub cpid: pid_t,
    pub return_icmp: u_int16_t,
    pub return_icmp6: u_int16_t,
    pub max_mss: u_int16_t,
    pub tag: u_int16_t,
    pub match_tag: u_int16_t,
    pub scrub_flags: u_int16_t,
    pub delay: u_int16_t,
    pub uid: pf_rule_uid,
    pub gid: pf_rule_gid,
    pub rule_flag: u_int32_t,
    pub action: u_int8_t,
    pub direction: u_int8_t,
    pub log: u_int8_t,
    pub logif: u_int8_t,
    pub quick: u_int8_t,
    pub ifnot: u_int8_t,
    pub match_tag_not: u_int8_t,
    pub keep_state: u_int8_t,
    pub af: sa_family_t,
    pub proto: u_int8_t,
    pub type_: u_int16_t,
    pub code: u_int16_t,
    pub flags: u_int8_t,
    pub flagset: u_int8_t,
    pub min_ttl: u_int8_t,
    pub allow_opts: u_int8_t,
    pub rt: u_int8_t,
    pub return_ttl: u_int8_t,
    pub tos: u_int8_t,
    pub set_tos: u_int8_t,
    pub anchor_relative: u_int8_t,
    pub anchor_wildcard: u_int8_t,
    pub flush: u_int8_t,
    pub prio: u_int8_t,
    pub set_prio: [u_int8_t; 2usize],
    pub naf: sa_family_t,
    pub rcvifnot: u_int8_t,
    pub divert: pf_rule__bindgen_ty_3,
    pub exptime: time_t,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_rule__bindgen_ty_1 {
    pub tqe_next: *mut pf_rule,
    pub tqe_prev: *mut *mut pf_rule,
}
#[test]
fn bindgen_test_layout_pf_rule__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<pf_rule__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_rule__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(pf_rule__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_rule__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_rule__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tqe_next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule__bindgen_ty_1),
            "::",
            stringify!(tqe_next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tqe_prev) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule__bindgen_ty_1),
            "::",
            stringify!(tqe_prev)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_rule__bindgen_ty_2 {
    pub limit: u_int32_t,
    pub seconds: u_int32_t,
}
#[test]
fn bindgen_test_layout_pf_rule__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<pf_rule__bindgen_ty_2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_rule__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(pf_rule__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_rule__bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(pf_rule__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).limit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule__bindgen_ty_2),
            "::",
            stringify!(limit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seconds) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule__bindgen_ty_2),
            "::",
            stringify!(seconds)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pf_rule__bindgen_ty_3 {
    pub addr: pf_addr,
    pub port: u_int16_t,
    pub type_: u_int8_t,
}
#[test]
fn bindgen_test_layout_pf_rule__bindgen_ty_3() {
    const UNINIT: ::std::mem::MaybeUninit<pf_rule__bindgen_ty_3> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_rule__bindgen_ty_3>(),
        20usize,
        concat!("Size of: ", stringify!(pf_rule__bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_rule__bindgen_ty_3>(),
        4usize,
        concat!("Alignment of ", stringify!(pf_rule__bindgen_ty_3))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule__bindgen_ty_3),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule__bindgen_ty_3),
            "::",
            stringify!(port)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule__bindgen_ty_3),
            "::",
            stringify!(type_)
        )
    );
}
#[test]
fn bindgen_test_layout_pf_rule() {
    const UNINIT: ::std::mem::MaybeUninit<pf_rule> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_rule>(),
        1344usize,
        concat!("Size of: ", stringify!(pf_rule))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_rule>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_rule))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).src) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(src))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dst) as usize - ptr as usize },
        56usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(dst))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skip) as usize - ptr as usize },
        112usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(skip))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).label) as usize - ptr as usize },
        184usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(label))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifname) as usize - ptr as usize },
        248usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(ifname))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rcv_ifname) as usize - ptr as usize },
        264usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(rcv_ifname))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qname) as usize - ptr as usize },
        280usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(qname))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pqname) as usize - ptr as usize },
        344usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(pqname))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tagname) as usize - ptr as usize },
        408usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(tagname))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).match_tagname) as usize - ptr as usize },
        472usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(match_tagname)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).overload_tblname) as usize - ptr as usize },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(overload_tblname)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).entries) as usize - ptr as usize },
        568usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(entries))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nat) as usize - ptr as usize },
        584usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(nat))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rdr) as usize - ptr as usize },
        720usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(rdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).route) as usize - ptr as usize },
        856usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(route))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pktrate) as usize - ptr as usize },
        992usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(pktrate))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).evaluations) as usize - ptr as usize },
        1008usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(evaluations))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).packets) as usize - ptr as usize },
        1016usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(packets))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bytes) as usize - ptr as usize },
        1032usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(bytes))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).kif) as usize - ptr as usize },
        1048usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(kif))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rcv_kif) as usize - ptr as usize },
        1056usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(rcv_kif))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).anchor) as usize - ptr as usize },
        1064usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(anchor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).overload_tbl) as usize - ptr as usize },
        1072usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(overload_tbl))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).os_fingerprint) as usize - ptr as usize },
        1080usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(os_fingerprint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rtableid) as usize - ptr as usize },
        1084usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(rtableid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onrdomain) as usize - ptr as usize },
        1088usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(onrdomain))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeout) as usize - ptr as usize },
        1092usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(timeout))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).states_cur) as usize - ptr as usize },
        1172usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(states_cur))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).states_tot) as usize - ptr as usize },
        1176usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(states_tot))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_states) as usize - ptr as usize },
        1180usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(max_states))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).src_nodes) as usize - ptr as usize },
        1184usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(src_nodes))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_src_nodes) as usize - ptr as usize },
        1188usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(max_src_nodes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_src_states) as usize - ptr as usize },
        1192usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(max_src_states)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_src_conn) as usize - ptr as usize },
        1196usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(max_src_conn))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_src_conn_rate) as usize - ptr as usize },
        1200usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(max_src_conn_rate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qid) as usize - ptr as usize },
        1208usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(qid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pqid) as usize - ptr as usize },
        1212usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(pqid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rt_listid) as usize - ptr as usize },
        1216usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(rt_listid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nr) as usize - ptr as usize },
        1220usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(nr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prob) as usize - ptr as usize },
        1224usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(prob))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cuid) as usize - ptr as usize },
        1228usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(cuid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cpid) as usize - ptr as usize },
        1232usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(cpid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).return_icmp) as usize - ptr as usize },
        1236usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(return_icmp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).return_icmp6) as usize - ptr as usize },
        1238usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(return_icmp6))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_mss) as usize - ptr as usize },
        1240usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(max_mss))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tag) as usize - ptr as usize },
        1242usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(tag))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).match_tag) as usize - ptr as usize },
        1244usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(match_tag))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scrub_flags) as usize - ptr as usize },
        1246usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(scrub_flags))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).delay) as usize - ptr as usize },
        1248usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(delay))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uid) as usize - ptr as usize },
        1252usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(uid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gid) as usize - ptr as usize },
        1264usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(gid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rule_flag) as usize - ptr as usize },
        1276usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(rule_flag))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).action) as usize - ptr as usize },
        1280usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(action))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).direction) as usize - ptr as usize },
        1281usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(direction))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).log) as usize - ptr as usize },
        1282usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(log))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).logif) as usize - ptr as usize },
        1283usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(logif))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quick) as usize - ptr as usize },
        1284usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(quick))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifnot) as usize - ptr as usize },
        1285usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(ifnot))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).match_tag_not) as usize - ptr as usize },
        1286usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(match_tag_not)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keep_state) as usize - ptr as usize },
        1287usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(keep_state))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).af) as usize - ptr as usize },
        1288usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(af))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).proto) as usize - ptr as usize },
        1289usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(proto))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        1290usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(type_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).code) as usize - ptr as usize },
        1292usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(code))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        1294usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(flags))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flagset) as usize - ptr as usize },
        1295usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(flagset))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_ttl) as usize - ptr as usize },
        1296usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(min_ttl))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).allow_opts) as usize - ptr as usize },
        1297usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(allow_opts))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rt) as usize - ptr as usize },
        1298usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(rt))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).return_ttl) as usize - ptr as usize },
        1299usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(return_ttl))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tos) as usize - ptr as usize },
        1300usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(tos))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).set_tos) as usize - ptr as usize },
        1301usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(set_tos))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).anchor_relative) as usize - ptr as usize },
        1302usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(anchor_relative)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).anchor_wildcard) as usize - ptr as usize },
        1303usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(anchor_wildcard)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flush) as usize - ptr as usize },
        1304usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(flush))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prio) as usize - ptr as usize },
        1305usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(prio))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).set_prio) as usize - ptr as usize },
        1306usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(set_prio))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).naf) as usize - ptr as usize },
        1308usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(naf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rcvifnot) as usize - ptr as usize },
        1309usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(rcvifnot))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).divert) as usize - ptr as usize },
        1312usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(divert))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).exptime) as usize - ptr as usize },
        1336usize,
        concat!("Offset of field: ", stringify!(pf_rule), "::", stringify!(exptime))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_rule_item {
    pub entry: pf_rule_item__bindgen_ty_1,
    pub r: *mut pf_rule,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_rule_item__bindgen_ty_1 {
    pub sle_next: *mut pf_rule_item,
}
#[test]
fn bindgen_test_layout_pf_rule_item__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<pf_rule_item__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_rule_item__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(pf_rule_item__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_rule_item__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_rule_item__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sle_next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule_item__bindgen_ty_1),
            "::",
            stringify!(sle_next)
        )
    );
}
#[test]
fn bindgen_test_layout_pf_rule_item() {
    const UNINIT: ::std::mem::MaybeUninit<pf_rule_item> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_rule_item>(),
        16usize,
        concat!("Size of: ", stringify!(pf_rule_item))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_rule_item>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_rule_item))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).entry) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(pf_rule_item), "::", stringify!(entry))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(pf_rule_item), "::", stringify!(r))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_rule_slist {
    pub slh_first: *mut pf_rule_item,
}
#[test]
fn bindgen_test_layout_pf_rule_slist() {
    const UNINIT: ::std::mem::MaybeUninit<pf_rule_slist> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_rule_slist>(),
        8usize,
        concat!("Size of: ", stringify!(pf_rule_slist))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_rule_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_rule_slist))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slh_first) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule_slist),
            "::",
            stringify!(slh_first)
        )
    );
}
pub const pf_sn_types_PF_SN_NONE: pf_sn_types = 0;
pub const pf_sn_types_PF_SN_NAT: pf_sn_types = 1;
pub const pf_sn_types_PF_SN_RDR: pf_sn_types = 2;
pub const pf_sn_types_PF_SN_ROUTE: pf_sn_types = 3;
pub const pf_sn_types_PF_SN_MAX: pf_sn_types = 4;
pub type pf_sn_types = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pf_src_node {
    pub entry: pf_src_node__bindgen_ty_1,
    pub addr: pf_addr,
    pub raddr: pf_addr,
    pub rule: pf_rule_ptr,
    pub kif: *mut pfi_kif,
    pub bytes: [u_int64_t; 2usize],
    pub packets: [u_int64_t; 2usize],
    pub states: u_int32_t,
    pub conn: u_int32_t,
    pub conn_rate: pf_threshold,
    pub creation: i32,
    pub expire: i32,
    pub af: sa_family_t,
    pub naf: sa_family_t,
    pub type_: u_int8_t,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_src_node__bindgen_ty_1 {
    pub rbe_left: *mut pf_src_node,
    pub rbe_right: *mut pf_src_node,
    pub rbe_parent: *mut pf_src_node,
    pub rbe_color: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pf_src_node__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<pf_src_node__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_src_node__bindgen_ty_1>(),
        32usize,
        concat!("Size of: ", stringify!(pf_src_node__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_src_node__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_src_node__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rbe_left) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_src_node__bindgen_ty_1),
            "::",
            stringify!(rbe_left)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rbe_right) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_src_node__bindgen_ty_1),
            "::",
            stringify!(rbe_right)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rbe_parent) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_src_node__bindgen_ty_1),
            "::",
            stringify!(rbe_parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rbe_color) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_src_node__bindgen_ty_1),
            "::",
            stringify!(rbe_color)
        )
    );
}
#[test]
fn bindgen_test_layout_pf_src_node() {
    const UNINIT: ::std::mem::MaybeUninit<pf_src_node> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_src_node>(),
        152usize,
        concat!("Size of: ", stringify!(pf_src_node))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_src_node>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_src_node))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).entry) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(pf_src_node), "::", stringify!(entry))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(pf_src_node), "::", stringify!(addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).raddr) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(pf_src_node), "::", stringify!(raddr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rule) as usize - ptr as usize },
        64usize,
        concat!("Offset of field: ", stringify!(pf_src_node), "::", stringify!(rule))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).kif) as usize - ptr as usize },
        72usize,
        concat!("Offset of field: ", stringify!(pf_src_node), "::", stringify!(kif))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bytes) as usize - ptr as usize },
        80usize,
        concat!("Offset of field: ", stringify!(pf_src_node), "::", stringify!(bytes))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).packets) as usize - ptr as usize },
        96usize,
        concat!("Offset of field: ", stringify!(pf_src_node), "::", stringify!(packets))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).states) as usize - ptr as usize },
        112usize,
        concat!("Offset of field: ", stringify!(pf_src_node), "::", stringify!(states))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).conn) as usize - ptr as usize },
        116usize,
        concat!("Offset of field: ", stringify!(pf_src_node), "::", stringify!(conn))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).conn_rate) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_src_node),
            "::",
            stringify!(conn_rate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).creation) as usize - ptr as usize },
        136usize,
        concat!("Offset of field: ", stringify!(pf_src_node), "::", stringify!(creation))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).expire) as usize - ptr as usize },
        140usize,
        concat!("Offset of field: ", stringify!(pf_src_node), "::", stringify!(expire))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).af) as usize - ptr as usize },
        144usize,
        concat!("Offset of field: ", stringify!(pf_src_node), "::", stringify!(af))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).naf) as usize - ptr as usize },
        145usize,
        concat!("Offset of field: ", stringify!(pf_src_node), "::", stringify!(naf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        146usize,
        concat!("Offset of field: ", stringify!(pf_src_node), "::", stringify!(type_))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_sn_item {
    pub next: pf_sn_item__bindgen_ty_1,
    pub sn: *mut pf_src_node,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_sn_item__bindgen_ty_1 {
    pub sle_next: *mut pf_sn_item,
}
#[test]
fn bindgen_test_layout_pf_sn_item__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<pf_sn_item__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_sn_item__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(pf_sn_item__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_sn_item__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_sn_item__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sle_next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_sn_item__bindgen_ty_1),
            "::",
            stringify!(sle_next)
        )
    );
}
#[test]
fn bindgen_test_layout_pf_sn_item() {
    const UNINIT: ::std::mem::MaybeUninit<pf_sn_item> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_sn_item>(),
        16usize,
        concat!("Size of: ", stringify!(pf_sn_item))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_sn_item>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_sn_item))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(pf_sn_item), "::", stringify!(next))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sn) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(pf_sn_item), "::", stringify!(sn))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_sn_head {
    pub slh_first: *mut pf_sn_item,
}
#[test]
fn bindgen_test_layout_pf_sn_head() {
    const UNINIT: ::std::mem::MaybeUninit<pf_sn_head> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_sn_head>(),
        8usize,
        concat!("Size of: ", stringify!(pf_sn_head))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_sn_head>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_sn_head))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slh_first) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(pf_sn_head), "::", stringify!(slh_first))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_state_scrub {
    pub pfss_last: timeval,
    pub pfss_tsecr: u_int32_t,
    pub pfss_tsval: u_int32_t,
    pub pfss_tsval0: u_int32_t,
    pub pfss_flags: u_int16_t,
    pub pfss_ttl: u_int8_t,
    pub pad: u_int8_t,
    pub pfss_ts_mod: u_int32_t,
}
#[test]
fn bindgen_test_layout_pf_state_scrub() {
    const UNINIT: ::std::mem::MaybeUninit<pf_state_scrub> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_state_scrub>(),
        40usize,
        concat!("Size of: ", stringify!(pf_state_scrub))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_state_scrub>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_state_scrub))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfss_last) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_state_scrub),
            "::",
            stringify!(pfss_last)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfss_tsecr) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_state_scrub),
            "::",
            stringify!(pfss_tsecr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfss_tsval) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_state_scrub),
            "::",
            stringify!(pfss_tsval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfss_tsval0) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_state_scrub),
            "::",
            stringify!(pfss_tsval0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfss_flags) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_state_scrub),
            "::",
            stringify!(pfss_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfss_ttl) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_state_scrub),
            "::",
            stringify!(pfss_ttl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad) as usize - ptr as usize },
        31usize,
        concat!("Offset of field: ", stringify!(pf_state_scrub), "::", stringify!(pad))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfss_ts_mod) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_state_scrub),
            "::",
            stringify!(pfss_ts_mod)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pf_state_host {
    pub addr: pf_addr,
    pub port: u_int16_t,
    pub pad: u_int16_t,
}
#[test]
fn bindgen_test_layout_pf_state_host() {
    const UNINIT: ::std::mem::MaybeUninit<pf_state_host> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_state_host>(),
        20usize,
        concat!("Size of: ", stringify!(pf_state_host))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_state_host>(),
        4usize,
        concat!("Alignment of ", stringify!(pf_state_host))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(pf_state_host), "::", stringify!(addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(pf_state_host), "::", stringify!(port))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad) as usize - ptr as usize },
        18usize,
        concat!("Offset of field: ", stringify!(pf_state_host), "::", stringify!(pad))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_state_peer {
    pub scrub: *mut pf_state_scrub,
    pub seqlo: u_int32_t,
    pub seqhi: u_int32_t,
    pub seqdiff: u_int32_t,
    pub max_win: u_int16_t,
    pub mss: u_int16_t,
    pub state: u_int8_t,
    pub wscale: u_int8_t,
    pub tcp_est: u_int8_t,
    pub pad: [u_int8_t; 1usize],
}
#[test]
fn bindgen_test_layout_pf_state_peer() {
    const UNINIT: ::std::mem::MaybeUninit<pf_state_peer> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_state_peer>(),
        32usize,
        concat!("Size of: ", stringify!(pf_state_peer))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_state_peer>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_state_peer))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scrub) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(pf_state_peer), "::", stringify!(scrub))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seqlo) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(pf_state_peer), "::", stringify!(seqlo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seqhi) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(pf_state_peer), "::", stringify!(seqhi))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seqdiff) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_state_peer),
            "::",
            stringify!(seqdiff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_win) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_state_peer),
            "::",
            stringify!(max_win)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mss) as usize - ptr as usize },
        22usize,
        concat!("Offset of field: ", stringify!(pf_state_peer), "::", stringify!(mss))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(pf_state_peer), "::", stringify!(state))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wscale) as usize - ptr as usize },
        25usize,
        concat!("Offset of field: ", stringify!(pf_state_peer), "::", stringify!(wscale))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tcp_est) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_state_peer),
            "::",
            stringify!(tcp_est)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad) as usize - ptr as usize },
        27usize,
        concat!("Offset of field: ", stringify!(pf_state_peer), "::", stringify!(pad))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_state_queue {
    pub tqh_first: *mut pf_state,
    pub tqh_last: *mut *mut pf_state,
}
#[test]
fn bindgen_test_layout_pf_state_queue() {
    const UNINIT: ::std::mem::MaybeUninit<pf_state_queue> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_state_queue>(),
        16usize,
        concat!("Size of: ", stringify!(pf_state_queue))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_state_queue>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_state_queue))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tqh_first) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_state_queue),
            "::",
            stringify!(tqh_first)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tqh_last) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_state_queue),
            "::",
            stringify!(tqh_last)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pf_state_key_cmp {
    pub addr: [pf_addr; 2usize],
    pub port: [u_int16_t; 2usize],
    pub rdomain: u_int16_t,
    pub hash: u_int16_t,
    pub af: sa_family_t,
    pub proto: u_int8_t,
}
#[test]
fn bindgen_test_layout_pf_state_key_cmp() {
    const UNINIT: ::std::mem::MaybeUninit<pf_state_key_cmp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_state_key_cmp>(),
        44usize,
        concat!("Size of: ", stringify!(pf_state_key_cmp))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_state_key_cmp>(),
        4usize,
        concat!("Alignment of ", stringify!(pf_state_key_cmp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_state_key_cmp),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_state_key_cmp),
            "::",
            stringify!(port)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rdomain) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_state_key_cmp),
            "::",
            stringify!(rdomain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hash) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_state_key_cmp),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).af) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(pf_state_key_cmp), "::", stringify!(af))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).proto) as usize - ptr as usize },
        41usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_state_key_cmp),
            "::",
            stringify!(proto)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_state_cmp {
    pub id: u_int64_t,
    pub creatorid: u_int32_t,
    pub direction: u_int8_t,
    pub pad: [u_int8_t; 3usize],
}
#[test]
fn bindgen_test_layout_pf_state_cmp() {
    const UNINIT: ::std::mem::MaybeUninit<pf_state_cmp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_state_cmp>(),
        16usize,
        concat!("Size of: ", stringify!(pf_state_cmp))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_state_cmp>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_state_cmp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(pf_state_cmp), "::", stringify!(id))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).creatorid) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_state_cmp),
            "::",
            stringify!(creatorid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).direction) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_state_cmp),
            "::",
            stringify!(direction)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad) as usize - ptr as usize },
        13usize,
        concat!("Offset of field: ", stringify!(pf_state_cmp), "::", stringify!(pad))
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct pfsync_state_scrub {
    pub pfss_flags: u_int16_t,
    pub pfss_ttl: u_int8_t,
    pub scrub_flag: u_int8_t,
    pub pfss_ts_mod: u_int32_t,
}
#[test]
fn bindgen_test_layout_pfsync_state_scrub() {
    const UNINIT: ::std::mem::MaybeUninit<pfsync_state_scrub> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pfsync_state_scrub>(),
        8usize,
        concat!("Size of: ", stringify!(pfsync_state_scrub))
    );
    assert_eq!(
        ::std::mem::align_of::<pfsync_state_scrub>(),
        1usize,
        concat!("Alignment of ", stringify!(pfsync_state_scrub))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfss_flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_scrub),
            "::",
            stringify!(pfss_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfss_ttl) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_scrub),
            "::",
            stringify!(pfss_ttl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scrub_flag) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_scrub),
            "::",
            stringify!(scrub_flag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfss_ts_mod) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_scrub),
            "::",
            stringify!(pfss_ts_mod)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct pfsync_state_peer {
    pub scrub: pfsync_state_scrub,
    pub seqlo: u_int32_t,
    pub seqhi: u_int32_t,
    pub seqdiff: u_int32_t,
    pub max_win: u_int16_t,
    pub mss: u_int16_t,
    pub state: u_int8_t,
    pub wscale: u_int8_t,
    pub pad: [u_int8_t; 6usize],
}
#[test]
fn bindgen_test_layout_pfsync_state_peer() {
    const UNINIT: ::std::mem::MaybeUninit<pfsync_state_peer> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pfsync_state_peer>(),
        32usize,
        concat!("Size of: ", stringify!(pfsync_state_peer))
    );
    assert_eq!(
        ::std::mem::align_of::<pfsync_state_peer>(),
        1usize,
        concat!("Alignment of ", stringify!(pfsync_state_peer))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scrub) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_peer),
            "::",
            stringify!(scrub)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seqlo) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_peer),
            "::",
            stringify!(seqlo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seqhi) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_peer),
            "::",
            stringify!(seqhi)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seqdiff) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_peer),
            "::",
            stringify!(seqdiff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_win) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_peer),
            "::",
            stringify!(max_win)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mss) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_peer),
            "::",
            stringify!(mss)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_peer),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wscale) as usize - ptr as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_peer),
            "::",
            stringify!(wscale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_peer),
            "::",
            stringify!(pad)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pfsync_state_key {
    pub addr: [pf_addr; 2usize],
    pub port: [u_int16_t; 2usize],
    pub rdomain: u_int16_t,
    pub af: sa_family_t,
    pub pad: u_int8_t,
}
#[test]
fn bindgen_test_layout_pfsync_state_key() {
    const UNINIT: ::std::mem::MaybeUninit<pfsync_state_key> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pfsync_state_key>(),
        40usize,
        concat!("Size of: ", stringify!(pfsync_state_key))
    );
    assert_eq!(
        ::std::mem::align_of::<pfsync_state_key>(),
        4usize,
        concat!("Alignment of ", stringify!(pfsync_state_key))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_key),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_key),
            "::",
            stringify!(port)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rdomain) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_key),
            "::",
            stringify!(rdomain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).af) as usize - ptr as usize },
        38usize,
        concat!("Offset of field: ", stringify!(pfsync_state_key), "::", stringify!(af))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad) as usize - ptr as usize },
        39usize,
        concat!("Offset of field: ", stringify!(pfsync_state_key), "::", stringify!(pad))
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct pfsync_state {
    pub id: u_int64_t,
    pub ifname: [::std::os::raw::c_char; 16usize],
    pub key: [pfsync_state_key; 2usize],
    pub src: pfsync_state_peer,
    pub dst: pfsync_state_peer,
    pub rt_addr: pf_addr,
    pub rule: u_int32_t,
    pub anchor: u_int32_t,
    pub nat_rule: u_int32_t,
    pub creation: u_int32_t,
    pub expire: u_int32_t,
    pub packets: [[u_int32_t; 2usize]; 2usize],
    pub bytes: [[u_int32_t; 2usize]; 2usize],
    pub creatorid: u_int32_t,
    pub rtableid: [i32; 2usize],
    pub max_mss: u_int16_t,
    pub af: sa_family_t,
    pub proto: u_int8_t,
    pub direction: u_int8_t,
    pub log: u_int8_t,
    pub rt: u_int8_t,
    pub timeout: u_int8_t,
    pub sync_flags: u_int8_t,
    pub updates: u_int8_t,
    pub min_ttl: u_int8_t,
    pub set_tos: u_int8_t,
    pub state_flags: u_int16_t,
    pub set_prio: [u_int8_t; 2usize],
}
#[test]
fn bindgen_test_layout_pfsync_state() {
    const UNINIT: ::std::mem::MaybeUninit<pfsync_state> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pfsync_state>(),
        264usize,
        concat!("Size of: ", stringify!(pfsync_state))
    );
    assert_eq!(
        ::std::mem::align_of::<pfsync_state>(),
        1usize,
        concat!("Alignment of ", stringify!(pfsync_state))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(pfsync_state), "::", stringify!(id))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifname) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(pfsync_state), "::", stringify!(ifname))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(pfsync_state), "::", stringify!(key))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).src) as usize - ptr as usize },
        104usize,
        concat!("Offset of field: ", stringify!(pfsync_state), "::", stringify!(src))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dst) as usize - ptr as usize },
        136usize,
        concat!("Offset of field: ", stringify!(pfsync_state), "::", stringify!(dst))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rt_addr) as usize - ptr as usize },
        168usize,
        concat!("Offset of field: ", stringify!(pfsync_state), "::", stringify!(rt_addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rule) as usize - ptr as usize },
        184usize,
        concat!("Offset of field: ", stringify!(pfsync_state), "::", stringify!(rule))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).anchor) as usize - ptr as usize },
        188usize,
        concat!("Offset of field: ", stringify!(pfsync_state), "::", stringify!(anchor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nat_rule) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(nat_rule)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).creation) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(creation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).expire) as usize - ptr as usize },
        200usize,
        concat!("Offset of field: ", stringify!(pfsync_state), "::", stringify!(expire))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).packets) as usize - ptr as usize },
        204usize,
        concat!("Offset of field: ", stringify!(pfsync_state), "::", stringify!(packets))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bytes) as usize - ptr as usize },
        220usize,
        concat!("Offset of field: ", stringify!(pfsync_state), "::", stringify!(bytes))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).creatorid) as usize - ptr as usize },
        236usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(creatorid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rtableid) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(rtableid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_mss) as usize - ptr as usize },
        248usize,
        concat!("Offset of field: ", stringify!(pfsync_state), "::", stringify!(max_mss))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).af) as usize - ptr as usize },
        250usize,
        concat!("Offset of field: ", stringify!(pfsync_state), "::", stringify!(af))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).proto) as usize - ptr as usize },
        251usize,
        concat!("Offset of field: ", stringify!(pfsync_state), "::", stringify!(proto))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).direction) as usize - ptr as usize },
        252usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(direction)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).log) as usize - ptr as usize },
        253usize,
        concat!("Offset of field: ", stringify!(pfsync_state), "::", stringify!(log))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rt) as usize - ptr as usize },
        254usize,
        concat!("Offset of field: ", stringify!(pfsync_state), "::", stringify!(rt))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeout) as usize - ptr as usize },
        255usize,
        concat!("Offset of field: ", stringify!(pfsync_state), "::", stringify!(timeout))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sync_flags) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(sync_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).updates) as usize - ptr as usize },
        257usize,
        concat!("Offset of field: ", stringify!(pfsync_state), "::", stringify!(updates))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_ttl) as usize - ptr as usize },
        258usize,
        concat!("Offset of field: ", stringify!(pfsync_state), "::", stringify!(min_ttl))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).set_tos) as usize - ptr as usize },
        259usize,
        concat!("Offset of field: ", stringify!(pfsync_state), "::", stringify!(set_tos))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state_flags) as usize - ptr as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(state_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).set_prio) as usize - ptr as usize },
        262usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(set_prio)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_rulequeue {
    pub tqh_first: *mut pf_rule,
    pub tqh_last: *mut *mut pf_rule,
}
#[test]
fn bindgen_test_layout_pf_rulequeue() {
    const UNINIT: ::std::mem::MaybeUninit<pf_rulequeue> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_rulequeue>(),
        16usize,
        concat!("Size of: ", stringify!(pf_rulequeue))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_rulequeue>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_rulequeue))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tqh_first) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rulequeue),
            "::",
            stringify!(tqh_first)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tqh_last) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rulequeue),
            "::",
            stringify!(tqh_last)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_ruleset {
    pub rules: pf_ruleset__bindgen_ty_1,
    pub anchor: *mut pf_anchor,
    pub tticket: u_int32_t,
    pub tables: ::std::os::raw::c_int,
    pub topen: ::std::os::raw::c_int,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_ruleset__bindgen_ty_1 {
    pub queues: [pf_rulequeue; 2usize],
    pub active: pf_ruleset__bindgen_ty_1__bindgen_ty_1,
    pub inactive: pf_ruleset__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_ruleset__bindgen_ty_1__bindgen_ty_1 {
    pub ptr: *mut pf_rulequeue,
    pub rcount: u_int32_t,
    pub version: u_int32_t,
    pub open: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pf_ruleset__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<pf_ruleset__bindgen_ty_1__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_ruleset__bindgen_ty_1__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(pf_ruleset__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_ruleset__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_ruleset__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ptr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_ruleset__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rcount) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_ruleset__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(rcount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_ruleset__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).open) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_ruleset__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(open)
        )
    );
}
#[test]
fn bindgen_test_layout_pf_ruleset__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<pf_ruleset__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_ruleset__bindgen_ty_1>(),
        80usize,
        concat!("Size of: ", stringify!(pf_ruleset__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_ruleset__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_ruleset__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).queues) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_ruleset__bindgen_ty_1),
            "::",
            stringify!(queues)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).active) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_ruleset__bindgen_ty_1),
            "::",
            stringify!(active)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).inactive) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_ruleset__bindgen_ty_1),
            "::",
            stringify!(inactive)
        )
    );
}
#[test]
fn bindgen_test_layout_pf_ruleset() {
    const UNINIT: ::std::mem::MaybeUninit<pf_ruleset> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_ruleset>(),
        104usize,
        concat!("Size of: ", stringify!(pf_ruleset))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_ruleset>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_ruleset))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rules) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(pf_ruleset), "::", stringify!(rules))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).anchor) as usize - ptr as usize },
        80usize,
        concat!("Offset of field: ", stringify!(pf_ruleset), "::", stringify!(anchor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tticket) as usize - ptr as usize },
        88usize,
        concat!("Offset of field: ", stringify!(pf_ruleset), "::", stringify!(tticket))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tables) as usize - ptr as usize },
        92usize,
        concat!("Offset of field: ", stringify!(pf_ruleset), "::", stringify!(tables))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).topen) as usize - ptr as usize },
        96usize,
        concat!("Offset of field: ", stringify!(pf_ruleset), "::", stringify!(topen))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_anchor_global {
    pub rbh_root: *mut pf_anchor,
}
#[test]
fn bindgen_test_layout_pf_anchor_global() {
    const UNINIT: ::std::mem::MaybeUninit<pf_anchor_global> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_anchor_global>(),
        8usize,
        concat!("Size of: ", stringify!(pf_anchor_global))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_anchor_global>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_anchor_global))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rbh_root) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor_global),
            "::",
            stringify!(rbh_root)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_anchor_node {
    pub rbh_root: *mut pf_anchor,
}
#[test]
fn bindgen_test_layout_pf_anchor_node() {
    const UNINIT: ::std::mem::MaybeUninit<pf_anchor_node> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_anchor_node>(),
        8usize,
        concat!("Size of: ", stringify!(pf_anchor_node))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_anchor_node>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_anchor_node))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rbh_root) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor_node),
            "::",
            stringify!(rbh_root)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_anchor {
    pub entry_global: pf_anchor__bindgen_ty_1,
    pub entry_node: pf_anchor__bindgen_ty_2,
    pub parent: *mut pf_anchor,
    pub children: pf_anchor_node,
    pub name: [::std::os::raw::c_char; 64usize],
    pub path: [::std::os::raw::c_char; 1024usize],
    pub ruleset: pf_ruleset,
    pub refcnt: ::std::os::raw::c_int,
    pub match_: ::std::os::raw::c_int,
    pub ref_: refcnt,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_anchor__bindgen_ty_1 {
    pub rbe_left: *mut pf_anchor,
    pub rbe_right: *mut pf_anchor,
    pub rbe_parent: *mut pf_anchor,
    pub rbe_color: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pf_anchor__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<pf_anchor__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_anchor__bindgen_ty_1>(),
        32usize,
        concat!("Size of: ", stringify!(pf_anchor__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_anchor__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_anchor__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rbe_left) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor__bindgen_ty_1),
            "::",
            stringify!(rbe_left)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rbe_right) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor__bindgen_ty_1),
            "::",
            stringify!(rbe_right)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rbe_parent) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor__bindgen_ty_1),
            "::",
            stringify!(rbe_parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rbe_color) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor__bindgen_ty_1),
            "::",
            stringify!(rbe_color)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_anchor__bindgen_ty_2 {
    pub rbe_left: *mut pf_anchor,
    pub rbe_right: *mut pf_anchor,
    pub rbe_parent: *mut pf_anchor,
    pub rbe_color: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pf_anchor__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<pf_anchor__bindgen_ty_2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_anchor__bindgen_ty_2>(),
        32usize,
        concat!("Size of: ", stringify!(pf_anchor__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_anchor__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_anchor__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rbe_left) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor__bindgen_ty_2),
            "::",
            stringify!(rbe_left)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rbe_right) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor__bindgen_ty_2),
            "::",
            stringify!(rbe_right)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rbe_parent) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor__bindgen_ty_2),
            "::",
            stringify!(rbe_parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rbe_color) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor__bindgen_ty_2),
            "::",
            stringify!(rbe_color)
        )
    );
}
#[test]
fn bindgen_test_layout_pf_anchor() {
    const UNINIT: ::std::mem::MaybeUninit<pf_anchor> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pf_anchor>(),
        1288usize,
        concat!("Size of: ", stringify!(pf_anchor))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_anchor>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_anchor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).entry_global) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor),
            "::",
            stringify!(entry_global)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).entry_node) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(pf_anchor), "::", stringify!(entry_node))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        64usize,
        concat!("Offset of field: ", stringify!(pf_anchor), "::", stringify!(parent))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).children) as usize - ptr as usize },
        72usize,
        concat!("Offset of field: ", stringify!(pf_anchor), "::", stringify!(children))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        80usize,
        concat!("Offset of field: ", stringify!(pf_anchor), "::", stringify!(name))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).path) as usize - ptr as usize },
        144usize,
        concat!("Offset of field: ", stringify!(pf_anchor), "::", stringify!(path))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ruleset) as usize - ptr as usize },
        1168usize,
        concat!("Offset of field: ", stringify!(pf_anchor), "::", stringify!(ruleset))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refcnt) as usize - ptr as usize },
        1272usize,
        concat!("Offset of field: ", stringify!(pf_anchor), "::", stringify!(refcnt))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).match_) as usize - ptr as usize },
        1276usize,
        concat!("Offset of field: ", stringify!(pf_anchor), "::", stringify!(match_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ref_) as usize - ptr as usize },
        1280usize,
        concat!("Offset of field: ", stringify!(pf_anchor), "::", stringify!(ref_))
    );
}
unsafe extern "C" {
    pub fn pf_anchor_global_RB_INSERT_COLOR(arg1: *mut pf_anchor_global, arg2: *mut pf_anchor);
}
unsafe extern "C" {
    pub fn pf_anchor_global_RB_REMOVE_COLOR(arg1: *mut pf_anchor_global, arg2: *mut pf_anchor, arg3: *mut pf_anchor);
}
unsafe extern "C" {
    pub fn pf_anchor_global_RB_REMOVE(arg1: *mut pf_anchor_global, arg2: *mut pf_anchor) -> *mut pf_anchor;
}
unsafe extern "C" {
    pub fn pf_anchor_global_RB_INSERT(arg1: *mut pf_anchor_global, arg2: *mut pf_anchor) -> *mut pf_anchor;
}
unsafe extern "C" {
    pub fn pf_anchor_global_RB_FIND(arg1: *mut pf_anchor_global, arg2: *mut pf_anchor) -> *mut pf_anchor;
}
unsafe extern "C" {
    pub fn pf_anchor_global_RB_NFIND(arg1: *mut pf_anchor_global, arg2: *mut pf_anchor) -> *mut pf_anchor;
}
unsafe extern "C" {
    pub fn pf_anchor_global_RB_NEXT(arg1: *mut pf_anchor) -> *mut pf_anchor;
}
unsafe extern "C" {
    pub fn pf_anchor_global_RB_PREV(arg1: *mut pf_anchor) -> *mut pf_anchor;
}
unsafe extern "C" {
    pub fn pf_anchor_global_RB_MINMAX(arg1: *mut pf_anchor_global, arg2: ::std::os::raw::c_int) -> *mut pf_anchor;
}
unsafe extern "C" {
    pub fn pf_anchor_node_RB_INSERT_COLOR(arg1: *mut pf_anchor_node, arg2: *mut pf_anchor);
}
unsafe extern "C" {
    pub fn pf_anchor_node_RB_REMOVE_COLOR(arg1: *mut pf_anchor_node, arg2: *mut pf_anchor, arg3: *mut pf_anchor);
}
unsafe extern "C" {
    pub fn pf_anchor_node_RB_REMOVE(arg1: *mut pf_anchor_node, arg2: *mut pf_anchor) -> *mut pf_anchor;
}
unsafe extern "C" {
    pub fn pf_anchor_node_RB_INSERT(arg1: *mut pf_anchor_node, arg2: *mut pf_anchor) -> *mut pf_anchor;
}
unsafe extern "C" {
    pub fn pf_anchor_node_RB_FIND(arg1: *mut pf_anchor_node, arg2: *mut pf_anchor) -> *mut pf_anchor;
}
unsafe extern "C" {
    pub fn pf_anchor_node_RB_NFIND(arg1: *mut pf_anchor_node, arg2: *mut pf_anchor) -> *mut pf_anchor;
}
unsafe extern "C" {
    pub fn pf_anchor_node_RB_NEXT(arg1: *mut pf_anchor) -> *mut pf_anchor;
}
unsafe extern "C" {
    pub fn pf_anchor_node_RB_PREV(arg1: *mut pf_anchor) -> *mut pf_anchor;
}
unsafe extern "C" {
    pub fn pf_anchor_node_RB_MINMAX(arg1: *mut pf_anchor_node, arg2: ::std::os::raw::c_int) -> *mut pf_anchor;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pfr_table {
    pub pfrt_anchor: [::std::os::raw::c_char; 1024usize],
    pub pfrt_name: [::std::os::raw::c_char; 32usize],
    pub pfrt_flags: u_int32_t,
    pub pfrt_fback: u_int8_t,
}
#[test]
fn bindgen_test_layout_pfr_table() {
    const UNINIT: ::std::mem::MaybeUninit<pfr_table> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pfr_table>(),
        1064usize,
        concat!("Size of: ", stringify!(pfr_table))
    );
    assert_eq!(
        ::std::mem::align_of::<pfr_table>(),
        4usize,
        concat!("Alignment of ", stringify!(pfr_table))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfrt_anchor) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pfr_table),
            "::",
            stringify!(pfrt_anchor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfrt_name) as usize - ptr as usize },
        1024usize,
        concat!("Offset of field: ", stringify!(pfr_table), "::", stringify!(pfrt_name))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfrt_flags) as usize - ptr as usize },
        1056usize,
        concat!("Offset of field: ", stringify!(pfr_table), "::", stringify!(pfrt_flags))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfrt_fback) as usize - ptr as usize },
        1060usize,
        concat!("Offset of field: ", stringify!(pfr_table), "::", stringify!(pfrt_fback))
    );
}
pub const PFR_FB_NONE: _bindgen_ty_14 = 0;
pub const PFR_FB_MATCH: _bindgen_ty_14 = 1;
pub const PFR_FB_ADDED: _bindgen_ty_14 = 2;
pub const PFR_FB_DELETED: _bindgen_ty_14 = 3;
pub const PFR_FB_CHANGED: _bindgen_ty_14 = 4;
pub const PFR_FB_CLEARED: _bindgen_ty_14 = 5;
pub const PFR_FB_DUPLICATE: _bindgen_ty_14 = 6;
pub const PFR_FB_NOTMATCH: _bindgen_ty_14 = 7;
pub const PFR_FB_CONFLICT: _bindgen_ty_14 = 8;
pub const PFR_FB_NOCOUNT: _bindgen_ty_14 = 9;
pub const PFR_FB_MAX: _bindgen_ty_14 = 10;
pub type _bindgen_ty_14 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pfr_addr {
    pub pfra_u: pfr_addr__bindgen_ty_1,
    pub pfra_ifname: [::std::os::raw::c_char; 16usize],
    pub pfra_states: u_int32_t,
    pub pfra_weight: u_int16_t,
    pub pfra_af: u_int8_t,
    pub pfra_net: u_int8_t,
    pub pfra_not: u_int8_t,
    pub pfra_fback: u_int8_t,
    pub pfra_type: u_int8_t,
    pub pad: [u_int8_t; 7usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pfr_addr__bindgen_ty_1 {
    pub _pfra_ip4addr: in_addr,
    pub _pfra_ip6addr: in6_addr,
}
#[test]
fn bindgen_test_layout_pfr_addr__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<pfr_addr__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pfr_addr__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(pfr_addr__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pfr_addr__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(pfr_addr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pfra_ip4addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pfr_addr__bindgen_ty_1),
            "::",
            stringify!(_pfra_ip4addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pfra_ip6addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pfr_addr__bindgen_ty_1),
            "::",
            stringify!(_pfra_ip6addr)
        )
    );
}
#[test]
fn bindgen_test_layout_pfr_addr() {
    const UNINIT: ::std::mem::MaybeUninit<pfr_addr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pfr_addr>(),
        52usize,
        concat!("Size of: ", stringify!(pfr_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<pfr_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(pfr_addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfra_u) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(pfr_addr), "::", stringify!(pfra_u))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfra_ifname) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(pfr_addr), "::", stringify!(pfra_ifname))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfra_states) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(pfr_addr), "::", stringify!(pfra_states))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfra_weight) as usize - ptr as usize },
        36usize,
        concat!("Offset of field: ", stringify!(pfr_addr), "::", stringify!(pfra_weight))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfra_af) as usize - ptr as usize },
        38usize,
